{
	"docs": [{
			"$doctype": "Build",
			"Build": "Battle Cleric",
			"Subclass": "Cleric",
			"Description": "If you choose to concentrate on melee, you find a good assortment of strikes to your liking. To achieve this build, make Strength your primary score. Make Wisdom your secondary score and assign Charisma as your tertiary score. Make sure to concentrate on powers that work with melee attacks, since these play to your key ability scores.",
			"Feat": "Weapon Focus",
			"Human Feat": "Action Surge",
			"Skill": ["Diplomacy",
				"Heal",
				"Insight",
				"Religion"
			],
			"At-Will": ["Righteous Brand",
				"Priest's Shield"
			],
			"Encounter": "Wraithful Thunder",
			"Daily": "Avenging Flame",
			"Option": ""
		},
		{
			"$doctype": "Build",
			"Build": "Devoted Cleric",
			"Subclass": "Cleric",
			"Description": "With this build, you choose to stand back and concentrate your abilities on keeping your fellow adventurers healthy and optimized. To this end, choose powers that grant bonuses and healing, such as divine glow and beacon of hope. Assign your highest ability score to Wisdom, with Charisma secondary and Strength tertiary. Make sure to concentrate on powers that use Wisdom for attacks, since this is your highest ability score.",
			"Feat": "Channel Divinity",
			"Human Feat": "Human Preseverance",
			"Skill": ["Arcana", "Heal", "History", "Religion"],
			"At-Will": ["Lance of Faith", "Sacred Flame"],
			"Encounter": "Healing Strike",
			"Daily": "Beacon of Hope",
			"Option": ""
		},
		{
			"$doctype": "Build",
			"Build": "Great Weapon Fighter",
			"Subclass": "Fighter",
			"Description": "You’re interested in dealing out the most damage you can. You prefer big two-handed weapons such as the greatsword or greataxe. You’re more interested in fighting hard than fighting smart. Your best ability score is definitely Strength. A good Constitution improves your ability to use high damage weapons, such as axes and hammers. Plus, extra hit points always help. Select powers that work well with twohanded weapons to make the most of this build.",
			"Feat": "Power Attack",
			"Human Feat": "Action Surge",
			"Skill": ["Athletics", "Endurance", "Intimidate"],
			"At-Will": ["Cleave", "Reaping Strike"],
			"Encounter": "Spinning Sweep",
			"Daily": "Brute Strike",
			"Option": "Two-Handed Weapons"
		},
		{
			"$doctype": "Build",
			"Build": "Guardian Fighter",
			"Subclass": "Fighter",
			"Description": "To fight better, you fight smarter. You’re willing to trade offense for superior defenses and better ability to control the battlefield around you. You fight with a heavy shield and a good one-handed weapon, such as a longsword, f lail, or battleaxe. Like the great weapon fighter, you make Strength your best ability score. After that, prioritize your Dexterity to\ntake advantage of weapons that can be improved by Dexterity-based feats, or your Wisdom to make the most of the combat superiority class feature. You’re hard to hurt and hard to move away from. Select powers that make use of your one-handed weapon and shield, as well as take advantage of your higher Dexterity score.",
			"Feat": "Weapon Focus",
			"Human Feat": "Human Perseverance",
			"Skill": ["Heal", "Intimidate", "Streetwise"],
			"At-Will": ["Sure Strike", "Tide of Iron"],
			"Encounter": "Covering Attack",
			"Daily": "Comeback Strike",
			"Option": "One-Handed Weapons"
		},
		{
			"$doctype": "Build",
			"Build": "Avenging Paladin",
			"Subclass": "Paladin",
			"Description": "You burn with the desire to punish the wicked and smite the unbelievers. In your view, the best way to safeguard your allies is to destroy your enemies with divine power and overwhelming attacks. Choose Strength as your highest ability score, since your most damaging attacks are based on Strength. Charisma should be your second-best ability score, and Wisdom\nyour third. Consider wielding a big two-handed weapon such as a greatsword or greataxe, and choose powers that deliver the highest amount of damage.",
			"Feat": "Power Attack",
			"Human Feat": "Human Perseverance",
			"Skill": ["Endurance", "Heal", "Intimidate", "Religion"],
			"At-Will": ["Holy Strike", "Valiant Strike"],
			"Encounter": "Radiant Smite",
			"Daily": "Paladin’s Judgment",
			"Option": ""
		},
		{
			"$doctype": "Build",
			"Build": "Protecting Paladin",
			"Subclass": "Paladin",
			"Description": "You emphasize defense, guarding your allies, and healing and bolstering them with a few of your powers. You do not deal as much damage as the avenging paladin, but you are better at dealing with a widerarray of situations. Your best ability score should be  Charisma. Choose Strength for your second-best score (you’ll want a few Strength-based attacks), and Wisdom as your third-best score. The protecting paladin works best as a shield-carrying warrior, so you should probably use a heavy shield and a one-handed weapon such as a longsword or a warhammer. Selectpowers that help your allies, along with a few damagedealing powers for when the need arises.",
			"Feat": "Healing Hands",
			"Human Feat": "Action Surge",
			"Skill": ["Diplomacy", "Heal", "Insight", "Religion"],
			"At-Will": ["Bolstering Strike", "Enfeebling Strike"],
			"Encounter": "Shielding Smite",
			"Daily": "Radiant Delirium",
			"Option": ""
		},
		{
			"$doctype": "Build",
			"Build": "Archer Ranger",
			"Subclass": "Ranger",
			"Description": "You are a master of the bow (or, rarely, the crossbow, sling, or thrown weapon). You prefer ranged attack powers, and you resort to melee only when there are no good targets left for your arrows. Most of your attack powers use Dexterity, so Dexterity should be your highest ability score. You find yourself in melee from time to time, so Strength is a good choice for your second-highest score. Wisdom should be your thirdbest ability score. Choose powers that reflect your preference for ranged weapons.",
			"Feat": "Agile Hunter",
			"Human Feat": "Human Perseverance",
			"Skill": ["Endurance", "Heal", "Nature", "Perception", "Stealth"],
			"At-Will": ["Careful Attack", "Nimble Strike"],
			"Encounter": "Evasive Strike",
			"Daily": "Split the Tree",
			"Option": "Archer Fighting Style"
		},
		{
			"$doctype": "Build",
			"Build": "Two-Blade Ranger",
			"Subclass": "Ranger",
			"Description": "You like to get up close and rely on the ranger’s famous two-weapon fighting style. Naturally, you prefer melee attack powers, and that means Strength should be your highest ability score. For your second ability, Dexterity is a good choice because it improves your AC. Make Wisdom your third choice, since it adds to your Will defense and provides a bonus to many of your powers. Choose powers that reflect your preference for fighting with two melee weapons.",
			"Feat": "Lethal Hunter",
			"Human Feat": "Action Surge",
			"Skill": ["Acrobatics", "Dungeoneering", "Endurance", "Heal", "Perception"],
			"At-Will": ["Hit and Run", "Twin Strike"],
			"Encounter": "Dire Wolverine Strike",
			"Daily": "Jaws of the Wolf",
			"Option": "Two-Blade Fighting Style"
		},
		{
			"$doctype": "Build",
			"Build": "Brawny Rogue",
			"Subclass": "Rouge",
			"Description": "You like powers that deal plenty of damage, aided by your Strength, and also stun, immobilize, knock down, or push your foes. Your attacks use Dexterity, so keep that your highest ability score. Strength should be a close second—it increases your damage directly, and it can determine other effects of your attacks. Charisma is a good third ability score, particularly if you want to dabble in powers from the other rogue build. Select the brutal scoundrel rogue tactic, and look for powers that pack a lot of damage into every punch.",
			"Feat": "Weapon Focus",
			"Human Feat": "Toughness",
			"Skill": ["Athletics", "Dungeoneering", "Intimidate", "Stealth", "Streetwise", "Thievery  "],
			"At-Will": ["Piercing Strik", "Riposte Strike"],
			"Encounter": "Torturous Strike",
			"Daily": "Easy Target",
			"Option": "Brutal Scoundrel"
		},
		{
			"$doctype": "Build",
			"Build": "Trickster Rogue",
			"Subclass": "Rouge",
			"Description": "You like powers that deceive and misdirect your foes. You dart in and out of the fray in combat, dodging your enemies’ attacks or redirecting them to other foes. Most of your attack powers rely on Dexterity, so that should be your best ability score. Charisma is important for a few attacks, for Charisma-based skills you sometimes use in place of attacks, and for\nother effects that depend on successful attacks, so make Charisma your second-best score. Strength is useful if you want to choose powers intended forthe other rogue build. Select the artful dodger rogue  tactic. Look for powers that take advantage of your high Charisma score, as well as those that add to your trickster nature.",
			"Feat": "Backstabber",
			"Human Feat": "Human Preseverance",
			"Skill": ["Acrobatics", "Bluff", "Insight", "Perception", "Stealth", "Thievery"],
			"At-Will": ["Deft Strike", "Sly Flourish"],
			"Encounter": "Positioning Strike",
			"Daily": "Trick Strike",
			"Option": "Artful Dodger"
		},
		{
			"$doctype": "Build",
			"Build": "Deceptive Warlock",
			"Subclass": "Warlock",
			"Description": "You prefer spells that deal a little less damage, but that inflict a variety of penalties and negative conditions on your foe. You’d rather fight at range and avoid getting caught in close-up battles. Most of your attack powers depend on Charisma, so that should be your best score. Many of your powers receive a bonus if you have a good Intelligence score, so that should be your second-best score. Constitution should be your third choice since you might want to choose some Constitution-based powers. You need it for a good Fortitude  defense anyway. Deceptive warlocks should choose the fey pact or the star pact.",
			"Feat": "Improved Misty Step",
			"Human Feat": "Human Preseverance",
			"Skill": ["Arcana", "Bluff", "Insight", "Thievery"],
			"At-Will": ["Eldritch Blast", "Eyebite"],
			"Encounter": "Witchfire",
			"Daily": "Curse of the Dark Dream",
			"Option": "Fey "
		},
		{
			"$doctype": "Build",
			"Build": "Scourge Warlock",
			"Subclass": "Warlock",
			"Description": "No subtlety here—you want to deal damage. You’re tougher than the deceptive warlock, and you’ve got powers to help you attack and defend in melee, as well as excellent ranged attacks. Your best attack powers depend on Constitution—make that your best ability score. Choose Intelligence second because it provides special bonuses to many of your powers and improves your Reflex defense and AC, too. Charisma is clearly your third choice. Scourge warlocks should choose the infernal pact or the star pact.",
			"Feat": "Improved Dark One's Blessing",
			"Human Feat": "Action Surge",
			"Skill": ["Arcana", "History", "Intimidate", "Streetwise"],
			"At-Will": ["Eldritch Blast", "Hellish Rebuke"],
			"Encounter": "Vampiric Embrace",
			"Daily": "Flames of Phlegethos",
			"Option": ""
		},
		{
			"$doctype": "Build",
			"Build": "Inspiring Warlord",
			"Subclass": "Warlord",
			"Description": "You lead by exhortation, encouragement, and inspiration. Your powers help your allies find new surges of courage and endurance within themselves, helping them heal, shrug off debilitating conditions, anddefend themselves from attack. Your attack powers rely on Strength, so that should be your best ability score. The benefits you give your allies, though,\ndepend almost entirely on Charisma, so make that second best. Intelligence is your best third choice, so you can dabble in other warlord powers and to help your Reflex defense. Select powers that make the best use of your high Charisma score.",
			"Feat": "Inspired Recovery",
			"Human Feat": "Toughness",
			"Skill": ["Athletics", "Diplomacy", "Heal", "History"],
			"At-Will": ["Commander's Strike", "Furious Smash"],
			"Encounter": "Guarding Attack",
			"Daily": "Bastion of Defense",
			"Option": "Inspiring Presence"
		},
		{
			"$doctype": "Build",
			"Build": "Tactical Warlord",
			"Subclass": "Warlord",
			"Description": "Your leadership takes the form of quick commands, cunning strategies, and tactical superiority. Your powers guide your allies to extra and more powerfulattacks, as well as helping them move quickly in  combat situations. You also assist your allies by moving your enemies around or knocking them prone. You use Strength for your attack powers, so make that your best ability score. Intelligence is secondary, because your Intelligence determines just how effective a  leader you are. Charisma should be your third best score, so you can dabble in other warlord powers and to improve your Will defense. Select powers that make the best use of your high Intelligence score.",
			"Feat": "Tactical Assault",
			"Human Feat": "Weapon Focus",
			"Skill": ["Endurance", "Heal", "History", "Intimidate"],
			"At-Will": ["Viper's Strike", "Wolf Pack Tactics"],
			"Encounter": "Warlord's Favor",
			"Daily": "Lead the Attack",
			"Option": "Tactical Presence"
		},
		{
			"$doctype": "Build",
			"Build": "Control Wizard",
			"Subclass": "Wizard",
			"Description": "Your favorite powers restrict your enemies in various ways—crushing them in the coils of a lightning serpent, trapping them in a cloud of noxious vapor, orencasing them in ice. Intelligence drives your attack  powers, so make it your highest ability score. Wisdom  can help you maintain control over your enemies if you choose the orb of imposition form of Implement\nMastery, so it should be your second-best score. Make Dexterity your third best score. Putting a good score in Constitution can help you stay alive by increasing your  hit points and healing surges, as well as contributing to your Fortitude defense. If you choose the staff of defense form of Implement Mastery, your Constitution can also help your other defenses. Select owers that help you control the battlefield and make the best use of your high Wisdom score.",
			"Feat": "Improved Initiative",
			"Human Feat": "Human Preseverance",
			"Skill": ["Arcana", "Diplomacy", "Insight", "Nature"],
			"At-Will": ["Cloud of Daggers", "Thunderwave"],
			"Encounter": "Icy Terrain",
			"Daily": "Sleep",
			"Option": ""
		},
		{
			"$doctype": "Build",
			"Build": "War Wizard",
			"Subclass": "Wizard",
			"Description": "Your delight is in powers that deal damage—lots of damage, to many foes at a time. Enormous bursts of fire, searing bolts of lightning, and waves of caustic acid are your weapons. Intelligence is your mostimportant ability score. Dexterity should be your second-best score, and it is important if you choose the wand of accuracy form of Implement Mastery. Make\nWisdom your third-best score. You might instead choose the staff of defense form of Implement Mastery,which lets your Constitution aid your defenses against  some attacks. Even if you don’t, Constitution increases your hit points, healing surges, and Fortitude defense. Select powers that deal lots of damage and that make the best use of your high Dexterity score.",
			"Feat": "Expanded Spellbook",
			"Human Feat": "Action Surge",
			"Skill": ["Arcana", "Dungeoneering", "History", "Religion"],
			"At-Will": ["Magic Missile", "Scorching Burst"],
			"Encounter": "Burning Hands",
			"Daily": "Acid Arrow",
			"Option": ""
		}
	]
}