{
	"docs": [{
  			"$doctype": "Subclass",
			"Subclass": "Ardent",
			"Source": "PHB3",
			"Power": "Psionic",
			"Role": "Leader",
			"Abilities": ["Charisma", "Constitution", "Wisdom"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 1,
			"Ref": 0,
			"Will": 1,
			"Attack": 0,
			"Surges": 7,
			"Melee": true,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": true,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 4,
			"Acro": 0,
			"Arca": 1,
			"Athl": 1,
			"Bluf": 1,
			"Dipl": 1,
			"Dung": 0,
			"End": 1,
			"Heal": 1,
			"History": 0,
			"Insight": 1,
			"Intimidate": 1,
			"Nature": 0,
			"Perception": 0,
			"Religion": 0,
			"Stealth": 0,
			"Street": 1,
			"Thievery": 0,
			"Paths": ["Mantle of Clarity", "Mantle of Elation", "Mantle of Impulsiveness"],
			"Default feat": "",
			"Implements": "",
			"Special": "Ardent Surge",
			"Encounter": "",
			"Feats": ["Ardent Mantle", "Ardent Surge", "Psionic Augmentation"],
			"Description": "Those who let their base emotions rule them invite madness and destruction. Prolonged feelings offear, greed, lust, or hatred can weaken the mind's defenses against manipulation. \\Yielding psionic power, you excite such emotions in your enemies, creating gaps in their defenses and frustrating their attacks, all while filling your allies with encouraging thoughts and guarding them against despair and other nega· tive emotions. Ardents rarely Jearn their art through formal training. I n many ways, they are incidental leaders, having stumbled onto psionic power at some point earlier in their lives. How you discovered your psionic talent can shape how you wield this power now. You might have awakened to your talent in the heat ofbattle, experiencing a mental breakthrough that allowed you to augment your attacks by rending your enemies' minds. Or your friends might reflect your power when your mood bleeds into theirs, altering their emotional states to match your own. Regardless of the revelation, you learned to harness this power to support your fighting prowess and to gUide your allies to victory.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features", "Ardent Mantle:", "Mantle of Clarity:", "Mantle of Elation:", "Mantle of Impulsiveness:", "Ardent Surge:", "Psionic Augmentation:"],
			"Detail bodies": ["You are a spiritual warrior whose thoughts swirl about you to infect your ene· mies with doubt and fill your allies with confidence", "Cloth, leather, hide, chainmail", "Simple melee, military melee, simple ranged", " ", "Choose four from the list of class skills: Arcana (Int), Athletics (Str), Bluff (Cha), Diplomacy (Cha), Endurance (Con), Heal (Wis), Insight (Wis), Intimidate (Cha), Streetwise (Cha)", "You lead your group from the front lines, mixing strong melee attacks with equally strong mental assaults. Your strikes can dismantle your enemies' defenses and make them more vulnerable to your allies' attacks. In addition, you can provoke allies to perform daring stunts and maneuvers, helping them gain better positions, leap across the battlefield to close with distant foes, or shrug off deadly afflictions.", "Ardents gravitate toward wild and unpredictable gods, favoring those who represent war or wilderness. Kord and Melora are the most popular, with more independent ardents following Avandra. Evil ardents find much to like in Bane and Gruumsh.", "Humans, half-elves, and kalashtar are the most common ardents, though dragonborn, halflings, gnomes, and tieflings also excel in this class, having the natural charisma needed to focus their inner strength.", "", "A person's state ofmind can be armor against the decay and madness born from base emotions, and thus ardents gird themselves by donning particular mindsets to ward off the perils brought on by fear, despair, and hatred. Various emotional states, called mantles, can safeguard the mind. Ardents most com· monly use the mantles ofclarity and elation. Choose one ofthe following options. Your choice gives a power to you as well as a benefit to you and your allies. Mantle of Clarity, Mantle of Elation, or Mantle of Impulsiveness", "The ardent gains use of the ardent alacrity power. All allies within 5 squares of the ardent gain a +2 bonus to Insight and Perception checks. Both the ardent, and allies within 5 squares, gain a bonus to all defenses against opportunity attacks equal to the ardent's Wisdom modifier.", "The ardent gains use of the ardent outrage power. All allies within 5 squares of the ardent gain a +2 bonus to Diplomacy and Intimidate checks. Both the ardent, and allies within 5 squares, gain a bonus to opportunity attack damage rolls equal to the ardent's Constitution modifier.", "The ardent gains use of the ardent eruption power. All allies within 5 squares of the ardent gain a +2 bonus to Endurance and Intimidate checks. When any ally within 5 squares is targeted by an opportunity attack, that ally gains a power bonus to all damage rolls equal to the ardent's Constitution modifier until the end of the ally's next turn.", "You gain the ardent surge power. Your advanced emo· tional state is inspirational, motivating your allies and helping them to recover from injuries.", "Through diScipline and careful study, you have mastered a form ofpsionic magic that offers greater versatility than other characters command. You know a broad array ofat·will powers, each ofwhich is a conduit through which you can pour as much or as little psionic energy as you choose. You channel psionic energy into a reservoir of personal power represented in the game as power points-that you can use to augment your at·will attack powers, replacing the encounter attack powers that other characters use. Because ofthis class feature, you acquire and use powers in a slightly different manner from how most other classes do."],
			"Option 1 details": ["Ardent Mantle", "A person's state ofmind can be armor against the decay and madness born from base emotions, and thus ardents gird themselves by donning particular mindsets to ward off the perils brought on by fear, despair, and hatred. Various emotional states, called mantles, can safeguard the mind. Ardents most com· monly use the mantles ofclarity and elation.\nChoose one ofthe following options. Your choice gives a power to you as well as a benefit to you and your allies."],
			"Option 1": ["Mantle of Clarity", "Mantle of Elation", "Mantle of Impulsiveness"],
			"Opt 1 choices": ["The ardent gains use of the ardent alacrity power. All allies within 5 squares of the ardent gain a +2 bonus to Insight and Perception checks. Both the ardent, and allies within 5 squares, gain a bonus to all defenses against opportunity attacks equal to the ardent's Wisdom modifier", "The ardent gains use of the ardent outrage power. All allies within 5 squares of the ardent gain a +2 bonus to Diplomacy and Intimidate checks. Both the ardent, and allies within 5 squares, gain a bonus to opportunity attack damage rolls equal to the ardent's Constitution modifier.", "The ardent gains use of the ardent eruption power. All allies within 5 squares of the ardent gain a +2 bonus to Endurance and Intimidate checks. When any ally within 5 squares is targeted by an opportunity attack, that ally gains a power bonus to all damage rolls equal to the ardent's Constitution modifier until the end of the ally's next turn."],
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": true
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Artificer",
			"Source": "EPG",
			"Power": "Arcane",
			"Role": "Striker",
			"Abilities": ["Inteligence", "Constitution", "Wisdom"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 1,
			"Ref": 0,
			"Will": 1,
			"Attack": 0,
			"Surges": 6,
			"Melee": false,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 4,
			"Acro": 0,
			"Arca": 3,
			"Athl": 0,
			"Bluf": 0,
			"Dipl": 1,
			"Dung": 1,
			"End": 0,
			"Heal": 1,
			"History": 1,
			"Insight": 0,
			"Intimidate": 0,
			"Nature": 0,
			"Perception": 1,
			"Religion": 0,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 1,
			"Paths": ["Resistive Formula", "Shielding Elixir"],
			"Default feat": "Ritual Caster",
			"Implements": ["Rod", "Staff"],
			"Special": "Healing Infusion",
			"Encounter": "",
			"Feats": ["Arcane Empowerment", "Arcane Rejuvenation", "Healing Infusion", "Ritual Casting"],
			"Description": "Artificers treat mastery of magic like a technical skill. They see patterns in energy and matter, and they understand how to manipulate the flow of magic in and around objects and creatures. Artificers channel energy into items using magical components, diagrams, and complex chains of sigils. Their skills let them assemble a magic device for any situation. As an artificer, you might be a formal student of magic who became interested in artifacts and arcane items. Alternatively, you could be a tinkerer who devised magic tools in a musty basement. Or perhaps you are an explorer who found your knowledge in the forgotten places of the world. Whatever the source of your talents, a passion for the technical components\nof magic drives you to perfect your art. With a bandolier slung across your chest, you carry an arsenal of alchemical compounds, magic implements, mundane materials, and tools. Your weapons, implements, and other gear are inscribed with runes and mystic patterns. You mix reagents, drink potions, and craft items. You use your knowledge to infuse yourself and your allies with arcane power. And one day, your magical skills will carry you into legend.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features", "Arcane Empowerment:", "Impart Energy:", "Augment Energy:", "Arcane Rejuvenation:", "Healing Infusion:", "Ritual Casting:"],
			"Detail bodies": ["The cryptic formulas of arcane magic and the complex recipes of alchemy appeal to you. You also know a great deal about magic items.", "Cloth, leather", "Simple melee, simple ranged", "Rods, staffs, wands", "Arcana, plus four more from the list of class skills:  Arcana (Int), Diplomacy (Cha), Dungeoneering (Wis), Heal (Wis), History {Int), Perception (Wis), Thievery (Dex)", "Your powers combine area and ranged attacks to impede foes while bolstering allies. Your spells deal moderate damage, and you have powers that heal and augment the attacks and the defenses of your companions. You can also create magical artifices that can aid you over the course of a battle.", "Artificers favor knowledge over faith; only a few artificers worship a specific deity. Artificers sometimes pay homage to Onatar for his influence on craft and industry and to Aureon for his favor of arcane knowledge. Many artificers also respect the innovation and creativity that the Traveler represents.", "Humans of House Cannith comprise the largest contingent of artificers in Eberron. Artificers also count the gnome shipwrights of Zilargo and the dwarf smiths of the Mror Holds among their number. Sometimes warforged become artificers in an attempt to understand their creation.", "", "The artificer's study of magic allows manipulating arcane energy found within items. An artificer begins each day with the ability to empower one magic item, and gains an additional empowerment at each milestone. You must spend a short rest with an item in order to empower it. An item may be empowered in two ways: Impart Energy or Augment Energy", "You recharge the daily power of a magic item. An item can only be recharged only once per day in this way.", "You infuse a weapon or implement with a reservoir of energy that lasts until the end of your next extended rest or until it is expended. The wielder of the implement or the weapon can use a free action after making an attack roll to expend this to gain a +2 bonus to that attack roll. An implement or weapon can be augmented only once per day in this way.", "Before combat, an artificer spends time infusing his or her allies' magic items with curative energy. Whenever an ally of an artificer uses a magic item's daily power, in addition to the power's normal effects, the ally gains temporary hit points equal to one-half the artificer's level plus the artificer's Intelligence modifier.", "At the end of an extended rest, the artificer creates two healing infusions that last until the end of the next extended rest. At 16th level, the artificer can create a third infusion. The effect of a healing infusion is determined at the time of use, not at the time of creation. When the artificer uses a healing infusion power, he expends one of the infusions created during the last extended rest. During a short rest, you or an ally can expend a healing surge to replenish one of the infusions expended.", "The artificer has Ritual Caster as a bonus feat, and owns a ritual book with the following rituals: Brew Potion, Disenchant Magic Item, Enchant Magic Item, and Make Whole. In addition, the artificer can use Disenchange magic item without expending components."],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Assassin",
			"Source": "DRMZ",
			"Power": "Shadow",
			"Role": "Striker",
			"Abilities": ["Dexterity", "Charisma"],
			"HP Start": 10,
			"HP": {
				"LVL": 4
			},
			"Fort": 1,
			"Ref": 0,
			"Will": 1,
			"Attack": 0,
			"Surges": 6,
			"Melee": true,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 4,
			"Acro": 1,
			"Arca": 1,
			"Athl": 1,
			"Bluf": 1,
			"Dipl": 0,
			"Dung": 0,
			"End": 1,
			"Heal": 0,
			"History": 0,
			"Insight": 1,
			"Intimidate": 0,
			"Nature": 0,
			"Perception": 1,
			"Religion": 0,
			"Stealth": 3,
			"Street": 1,
			"Thievery": 1,
			"Paths": ["Bleak Disciple", "Night Stalker"],
			"Default feat": "",
			"Implements": "Focus",
			"Special": "",
			"Encounter": "Shade Form",
			"Feats": ["Assassin's Shroud", "Guild Training", "Assassin Form", "Shadow Step"],
			"Description": "Few creatures embrace shadow magic without both a compelling reason and a measure of desperation. Not many visit the Shadowfell willingly, let alone pledge a shard of their souls to it. Yet that is exactly what assassins, and other practitioners of shadow magic, do to gain their power. As an assassin, you cede a portion of yourself to the Shadowfell, replacing a fundamental part of your being with a dark reflection of your true self. At times, you can manifest this twisted image in place of your body so that you can face attacks with little cause for concern. Also, the infusion of shadow magic allows you to spot the weakest points in a victim’s defenses. With a few moments of study, you can reduce even the stoutest warrior to a corpse. If others know that you are an assassin, you might find that few trust you. In some civilized realms, the study of shadow magic and assassination is banned on pain of death. In the past, and as a response to the outcry against them, assassins formed coteries, or guilds, of like-minded slayers, and each one delves into the study of shadow magic and develops unique methods of killing. A guild provides you with a measure of protection, and its grandmasters expect obedience and fealty. The wars between guilds, and the struggles within them, might never spill into mass battles, but they still leave dozens of slain folk in their wake. As an assassin, you are an outcast. You traded away part of your soul for the power of death. Perhaps you seek justice against a powerful enemy, or maybe you had no other way to preserve yourself in the face of a bleak, uncaring world. Whatever drew you onto the assassin’s path, you are an avatar of death and a trained killer from whom few can escape unharmed.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features", "Assassin's Shroud:", "Guild Training:", "Bleake Disciple:", "Night Stalker:", "Assassin Form:", "Shade Form:", "Black Flame Form:", "Shadow Step:"],
			"Detail bodies": ["You have bound your soul to the Shadowfell and become a being of darkness.", "Cloth, leather; light shield", "One-handed simple melee, military heavy blades, military light blades, simple ranged", "Ki focuses", "Stealth, plus four more from the list of class skills: Acrobatics (Dex), Arcana (Int), Athletics (Str), Bluff (Cha), Endurance (Con), Insight (Wis), Perception (Wis), Stealth (Dex),  Streetwise (Cha), Thievery (Dex)", "You can turn into an insubstantial creature of shadow. While you are in that form, even the most alert sentinel can overlook your approach, and attacks pass through you with little harm. When you spot your target, you study its weaknesses as you prepare to deliver a killing blow.", "Assassins who pursue evil creatures are often worshipers of the Raven Queen, who teaches that death is the great leveler, a tool the world needs to end abuses by powerful beings. Evil assassins wallow in the misery and fear they cause, or they revel in performing an exquisite kill. Such folk usually venerate Zehir or Lolth.", "Revenants have the combination of implacability and physical ability needed to\nflourish as assassins. Half-orcs also excel as assassins, often having a brutish nature that makes the assassin’s art palatable to them. Drow are superlative assassins, both because they grow up in a society that values skilled murder and because they are comfortable with working in darkness. Halflings make good assassins since they can combine their natural stealthiness with a native curiosity that makes hiding from them difficult. Changeling assassins possess an unsurpassed ability to infiltrate and kill from a position of trust.", "", "You subject the target to your shroud. If any of your shrouds are already on the target, you subject it to an additional shroud, up to a maximum of four. The shrouds last until you use this power against a different enemy or until the end of the encounter. Before you make an attack roll against the target, you choose to invoke either all your shrouds on it or none of them. If you invoke your shrouds, the attack deals 1d6 damage per shroud, minus one shroud if the attack misses, and all your shrouds then vanish from the target. This damage roll never benefits from bonuses to damage rolls, and is in addition to the attack's damage, if any. Level 11: 1d6 + 3 damage per shroud. Level 21: 1d6 + 6 damage per shroud.", "An assassin chooses one of the following options and gains the corresponding benefit, Bleak Disciple or Night Stalker", "When the assassin hits a target that is not bloodied, the assassin gains temporary hit points equal to the assassin's Constitution modifier. At 11th level, the temporary hit points increase to 2 + Con modifier. At 21st level, they increase to 4 + Con modifier.", "While a target is not adjacent to any other enemies, the assassin's damage rolls against the target gain a bonus equal to the assassin's Charisma modifier.", "As an assassin you chose an assassination form. It will grant you the associated power. Shade form or Black Flame form.", "You gain the shade form power.", "You gain the black flame form power.", "You gain the shadow step power."],
			"Option 1 details": ["Guild Training", "An assassin chooses one of the following options and gains the corresponding benefit."],
			"Option 1": ["Bleak Disciple", "Night Stalker"],
			"Opt 1 choices": ["When the assassin hits a target that is not bloodied, the assassin gains temporary hit points equal to the assassin's Constitution modifier. At 11th level, the temporary hit points increase to 2 + Con modifier. At 21st level, they increase to 4 + Con modifier.", "While a target is not adjacent to any other enemies, the assassin's damage rolls against the target gain a bonus equal to the assassin's Charisma modifier."],
			"Option 2 details": ["Assassin Form", "An assassin chooses one of the following options and gains the corrresponding power."],
			"Option 2": ["Shade Form", "Black Flame Form"],
			"Opt 2 Choices": ["You gain the shade form power.", "You gain the black flame form power."],
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Executioner",
			"Source": "HoS",
			"Power": ["Martial", "Shadow"],
			"Role": "Striker",
			"Abilities": ["Dexterity", "Charisma"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 1,
			"Ref": 0,
			"Will": 1,
			"Attack": 0,
			"Surges": 7,
			"Melee": true,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 4,
			"Acro": 1,
			"Arca": 1,
			"Athl": 1,
			"Bluf": 1,
			"Dipl": 0,
			"Dung": 0,
			"End": 1,
			"Heal": 0,
			"History": 0,
			"Insight": 1,
			"Intimidate": 1,
			"Nature": 0,
			"Perception": 1,
			"Religion": 0,
			"Stealth": 3,
			"Street": 1,
			"Thievery": 1,
			"Paths": ["Red Scales", "League of Whispers", "Shield Proficiency: Light", "Two-Weapon Defense"],
			"Default feat": "",
			"Implements": "Focus",
			"Special": "",
			"Encounter": "",
			"Feats": ["Assassin's Strike", "Attack Finesse", "Guild Attacks", "Poison Use", "Quick Swap", "Versatile Defense"],
			"Description": ["Executioners are more than just assassins for hire. When someone wants to send a message through an assassination, an executioner arranges the death in such a way that the message is delivered with maximum effectiveness. This might mean the quiet poisoning of a crooked merchant to warn other merchants to deal fairly, or it could be a public executjon of a tyrannical noble, meant to frighten the leaders of an area il1to treating the com.mon folk more humanely. Though many executioners perform these deeds at the request of a third party, others might do what they do in order to accomplish personal goals related to battling evil or enforcing justice. Executioners rely on their effectiveness as both infiltrators and assassins to get the job done. They dabble in shadow magic, whkh lets them walk through walls. create artificial shadows, and craft illusions to hide their intrusion into secure areas. They a Iso master the art of poison usc, giving them the ability to strike at enemies both directly and indirectly Adventuring executioners tend to perform their assassinations in the pursuit of the goals of their fellow adventurers, using slIch killings to influence the party's aJlies and enemies. An executioner stands as a capable warrior, even when not performing an assassination. This quality makes the executioner an invaluable member of an adventuring party that frequently finds itselfimmersed in conflict."],
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Class Features", "Assassin's Strike:", "Attack Finesse:", "Guild Attacks:", "Poison Use:", "Quick Swap:", "Versatile Defense:", "Shield Proficiency - Light:", "Two-Weapon Defense:"],
			"Detail bodies": ["Your sense of timing, skill with weapons, and ability to use the shadows as a weapon allow you to strike with lethal effect against an unsuspecting foe. You even mix in some shadwo magic when appropriate.", "Cloth, leather", "Simple one-handed melee, military one-handed melee, garrote, simple ranged, blowgun, bola, shortbow", "Ki focuses", "Stealth, plus four more from the list of class skills: Acrobatics (Dex), Arcana (Int), Athletics (Str), Bluff (Cha), Endurance (Con), Insight (Wis), Intimidate (Cha), Perception (Wis), Stealth (Dex), Streetwise (Cha) Thievery (Dex)", "", "Executioners with the Assassin's Strike class feature gain use of the Assassin's Strike encounter power.", "Executioners can use their Dexterity instead of Strength for melee basic attacks. In addition, once per turn you can deal 1d8 extra damage with a weapon attack using a one-handed weapon, a garrote, a blowgun, or a shortbow. The extra damage increases to 2d8 at 11th level and 3d8 at 21st level.", "As a member of either the Red Scales, the League of Whispers, or Way of the Ninja, you have learned various deadly attack techniques. At the start of your career, you can use the techniques associated with your guild.", "The Red Scales are considered by many to be the masters of close-quarters combat. The techniques that their guild members learn combine decades of study of both martial arts and common assassination techniques, giving them an edge when they are unarmed, wielding a dagger, or using a garrote. Benefit: You gain the powers garrote strangle, poisoned dagger, and quick lunge.", "Members of the League of Whispers specialize in the use of a variety of ranged weapons. This training allows them to perform special tricks that can help them execute a target or escape the local authorities. League members undergo training with bolas, hand crossbows, and blowguns to give them an edge against enemies both near and far. Like other executioners, members of the League are trained in the use of multiple weapons and usually carry a variety of weapons with which they are skilled. Benefit: You gain the powers bola takedown, precision dart, and quick shot.", "The Way of the Ninja teaches that secrets are power. Use the secrets you have learned to strike in an unexpected way. Utilize all that you know to defeat your target, and to accomplish your mission. Keep safe the secrets of your clan, even if it means your death. Mixing melee, reach, and ranged weapons means that you will never be caught off guard no matter the situation, but your opponents will. You gain the powers ninja-to rush, poisonous shuriken, and whirling kusari-gama. In addition, you have proficiency with shuriken and the kusari-gama, your Attack Finesse class feature also applies to kusari-gama and shuriken, and your assassin poisons that can be applied to ammunition can also be applied to your shuriken.", "Instead of dailies, Executioners gain the use of one poison at level 1.", "Once during each of your turns, you can take a free action to draw another weapon.", "You choose a bonus feat, either Shield Proficiency: Light or Two-Weapon Defense. You don't have to meet the feat's prerequisite.", "PLACEHOLDER", "PLACEHOLDER"],
			"Option 1 details": ["Assassins' Guild", "You must choose which guild you belong to. The executioner assasin has a choice between the Red Scales, the League of Whispers, and Way of the Ninja, though your DM might substitute his or her own guild names and descriptions for these. Your choice of guild determines some of your weapon proficiencies and the kidns of special attack techniques you learn throughout your career."],
			"Option 1": ["Red Scales", "Leage of Whispers"],
			"Opt 1 choices": ["This order of assassins works to keep society in balance. If any organization grows too powerful, too corrupt, too wealthy, or too vile the Red Scales weigh and measure the members of that organization and then collect payment that they are owed in blood. Though one might call the Red Scales idealists, none can say what truly drives them. Rumors abound that this guild's Grandfather of Assassins is touched by some planar entity. They say that his eyes are orbs of golden fire, a feature he gained, along with his new policies, only after he returned from a journey to the distant East.", "The very existence of this guild of executioners is often dismissed as myth or urban legend. The League of Whispers keeps its membership a secret. Although individual members might be known as assassins, their association with the guild is rarely more than a matter of speculation for nonmemebers. The leage keeps its existence a mystery by executing anyone who discovers the truth. The order holds secret meetings once every full moon, where the members converge to discuss jobs, trade secrets and tricks, and recieve orderrs from their Grandfather of Assassins.", "The Way of the Ninja teaches that secrets are power. Use the secrets you have learned to strike in an unexpected way. Utilize all that you know to defeat your target, and to accomplish your mission. Keep safe the secrets of your clan, even if it means your death. Mixing melee, reach, and ranged weapons means that you will never be caught off guard no matter the situation, but your opponents will. You gain the powers ninja-to rush, poisonous shuriken, and whirling kusari-gama. In addition, you have proficiency with shuriken and the kusari-gama, your Attack Finesse class feature also applies to kusari-gama and shuriken, and your assassin poisons that can be applied to ammunition can also be applied to your shuriken."],
			"Option 2 details": ["Versatile Defense", "You choose a bonus feat, either Shield Proficiency: Light or Two-Weapon Defense. You don't have to meet the feat's prerequisite."],
			"Option 2": ["Shield Proficiency: Light", "Two-Weapon Defense"],
			"Opt 2 Choices": ["PLACEHOLDER", "PLACEHOLDER"],
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Avenger",
			"Source": "PHB2",
			"Power": "Divine",
			"Role": "Striker",
			"Abilities": ["Wisdom", "Dexterity", "Inteligence"],
			"HP Start": 14,
			"HP": {
				"LVL": 6
			},
			"Fort": 1,
			"Ref": 1,
			"Will": 1,
			"Attack": 0,
			"Surges": 7,
			"Melee": true,
			"Ranged": false,
			"Cloth": true,
			"Leather": false,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 3,
			"Acro": 1,
			"Arca": 0,
			"Athl": 1,
			"Bluf": 0,
			"Dipl": 0,
			"Dung": 0,
			"End": 1,
			"Heal": 1,
			"History": 0,
			"Insight": 0,
			"Intimidate": 1,
			"Nature": 0,
			"Perception": 1,
			"Religion": 3,
			"Stealth": 1,
			"Street": 1,
			"Thievery": 0,
			"Paths": ["Censure of Pursuit", "Censure of Retribution", "Censure of Unity"],
			"Default feat": "",
			"Implements": "Symbol",
			"Special": "",
			"Encounter": "Channel Divinity",
			"Feats": ["Armor of Faith", "Avenger's Censure", "Channel Divinity", "Oath of Enmity"],
			"Description": "In secret temples far from bustling cities and priestly hierarchies, orders of esoteric warriors train their initiates in ancient traditions now forgotten or forbidden by most religious organizations. The champions of these orders are avengers—deadly weapons in the hands of their gods, imbued with divine power through secret rites of initiation. In battle, avengers swear to execute divine vengeance, entering a mental state that gives them unerring focus on a single enemy. As an avenger, you were trained in a monastery, initiated through secret rites, and imbued with the power to smite your god’s foes. You might be a disciple of Ioun, sworn to hunt and exterminate the minions of Vecna until you one day face the Maimed God. You could be an agent of the Raven Queen, bringing death to those who would defy your mistress. Or perhaps you serve Bahamut as an agent of justice, bringing ruin to tyrants and oppressors. The organizations devoted to your god might view you as a heretic or a hero, but you answer only to your god and to the vows you swore upon your initiation as an avenger. Where will those vows lead you? One thing is certain: Doing the will of your god is never easy and never free of peril.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features", "Armor of Faith:", "Avenger's Censure:", "Censure of Pursuit:", "Censure of Retribution:", "Censure of Unity:", "Channel Divinity:", "Oath of Enmity:"],
			"Detail bodies": ["You practice mysteries forgotten or forbidden by most religious orders, yet the power you wield is a gift from your god.", "Cloth", "Simple melee, military melee, simple ranged", "Holy symbols", "Religion, plus three more from the list of class skills: Acrobatics (Dex), Athletics (Str), Endurance (Con), Heal (Wis), Intimidate (Cha), Perception (Wis), Religion (Int), Stealth (Dex), Streetwise (Cha)", "Swinging a melee weapon in combat, you wield devastating divine power against your foes. You have a secondary assortment of ranged and close implement powers that let you draw your foes closer to you, teleport near them, or scorch them with divine wrath from afar.", "An avenger might serve any deity, but an avenger is more likely to worship an unaligned deity than a god of good or lawful good. Avengers of Ioun are among the most common, fighting a war of knowledge against the servants of Vecna. Unaligned avengers often revere the Raven Queen, Erathis, or Sehanine, and evil avengers often serve Asmodeus, Lolth, Tiamat, or Zehir.An avenger might serve any deity, but an avenger is more likely to worship an unaligned deity than a god of good or lawful good. Avengers of Ioun are among the most common, fighting a war of knowledge against the servants of Vecna. Unaligned avengers often revere the Raven Queen, Erathis, or Sehanine, and evil avengers often serve Asmodeus, Lolth, Tiamat, or Zehir.", "Elves and razorclaw shifters make excellent pursuing avengers, and devas excel as isolating avengers. Many avengers are human, because most of the hidden monasteries that produce avengers are of human origin.", "", "The favor of your deity wards you from harm. While you are neither wearing heavy armor or shield, you gain a +3 bonus to AC. This bonus being untyped, it stacks with the Intelligence or Dexterity bonus for wearing light armor.", "An avenger chooses one of the following options. Each option grants the avenger a bonus to damage rolls against the avenger's oath of enmity target in a given situation. Censure of Pursuit, Censure of Retribution, or Censure of Unity", "PLACEHOLDER", "PLACEHOLDER", "PLACEHOLDER", "Once per encounter you can use a channel divinity power. You start with two channel divinity powers: abjure undead and divine guidance. With DM permission, you may use divine identification instead of divine guidance.", "An avenger can use oath of enmity, a minor action encounter power that affects an enemy until the end of the encounter or until the enemy drops to 0 hit points. An avenger regains the use of oath of enmity when his or her previous oath of enmity effect ends. When the avenger makes a melee attack against his or her oath of enmity target, and the target is the only enemy adjacent to the avenger, the avenger rolls twice for the attack roll and chooses either result. If the avenger also has the Avenger's Censure class feature, he or she may deal bonus damage to his or her oath of enmity target as specified by the choice of Avenger's Censure."],
			"Option 1 details": ["Avenger's Censure:", "An avenger chooses one of the following options. Each option grants the avenger a bonus to damage rolls against the avenger's oath of enmity target in a given situation. Censure of Pursuit, Censure of Retribution, or Censure of Unity"],
			"Option 1": ["Censure of Pursuit", "Censure of Retribution", "Censure of Unity"],
			"Opt 1 choices": ["PLACEHOLDER", "PLACEHOLDER", "PLACEHOLDER"],
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Barbarian",
			"Source": "PHB2",
			"Power": "Primal",
			"Role": "Striker",
			"Abilities": ["Strength", "Dexterity", "Charisma"],
			"HP Start": 15,
			"HP": {
				"LVL": 6
			},
			"Fort": 2,
			"Ref": 1,
			"Will": 0,
			"Attack": 0,
			"Surges": 8,
			"Melee": true,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 3,
			"Acro": 1,
			"Arca": 0,
			"Athl": 1,
			"Bluf": 0,
			"Dipl": 0,
			"Dung": 0,
			"End": 1,
			"Heal": 1,
			"History": 0,
			"Insight": 0,
			"Intimidate": 1,
			"Nature": 1,
			"Perception": 1,
			"Religion": 0,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Rageblood Vigor", "Thaneborn Triumph", "Thunderborn Wrath", "Whirling Slayer"],
			"Default feat": "",
			"Implements": "",
			"Special": "",
			"Encounter": "",
			"Feats": ["Barbarian Agility", "Feral Might", "Rage Strike", "Rampage"],
			"Description": ["Barbarians are savage warriors who deal out powerful blows from their mighty weapons. They charge from foe to foe and seldom feel the pain of an enemy’s strike. For barbarians’ foes, the moments of greatest terror come when barbarians call upon primal forces to lend power to their raging spirits. These rages, although temporary, give a barbarian incredible powers, a combination of skill, willpower, and a legacy of ancient tribal rituals. As a barbarian, you have a link to powerful nature spirits and other primal forces bound to the warriors of your tribe by the songs and totems of your legacy. These spirits lend energy to your rages, transforming you into a devastating force on the battlefield. As you become more experienced, these rages transcend mortal limitations, manifesting directly as waves of elemental power or gifting you with supernatural recuperative powers. When the heat of battle is upon you, will you respond with a sudden charge that fells with one mighty swing of your weapon, or with a prolonged rage that leaves destroyed foes in your wake?"],
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Class Features", "Barbarian Agility:", "Feral Might:", "Rageblood Vigor:", "Thaneborn Triumph:", "Thunderborn Wrath:", "Whirling Slayer:", "Rage Strike:", "Rampage:"],
			"Detail bodies": ["You are a primal champion, a warrior devoted to the natural world and an embodiment of your tribe’s fierce traditions.", "Cloth, leather, hide", "Simple melee, military melee", " ", "Choose three from the list of class skills: Acrobatics (Dex), Athletics (Str), Endurance (Con), Heal (Wis), Intimidate (Cha), Nature (Wis), Perception (Wis)", "", "While you are not wearing heavy armor, you gain a +1 bonus to AC and Reflex. The bonus increases to +2 at 11th level and +3 at 21st level.", "Barbarians connect with the natural world in a variety of ways. Some barbarians grow so hardened to physical punishment that they find it easier to simply absorb, rather than avoid, attacks. Others are living examples of the power of one’s will to shape one’s fate. Choose one of the following options. The choice you make gives you the benefit described below and also provides bonuses to certain barbarian powers, as detailed in those powers. Rageblood Vigor, Thaneborn Trumph, Thunderborn Wrath, or Whirling Slayer", "When the barbarian reduces an enemy to 0 hit points with an attack, the barbarian gains temporary hit points. The number of temporary hit points at 1st level is equal to the barbarian's Constitution modifier, at 11th level, 5 + Constitution modifier, and at 21st level, 10 + Constitution modifier.", "When the barbarian bloodies an enemy, the next attack by the barbarian or an ally against that enemy gains a bonus to the attack roll equal to the barbarian's Charisma modifier.", " Once per round, when the barbarian bloodies an enemy with an attack, each enemy adjacent to the barbarian takes thunder damage equal to the barbarian's Constitution modifier.", "The barbarian can wield any one-handed weapon in the offhand and treat it as an off-hand weapon. In addition, once per round, if the barbarian's attack bloodies an enemy, the barbarian can shift 2 squares as a free action. Each enemy adjacent to the barbarian at the end of this shift grants combat advantage to the barbarian until the end of the barbarian's next turn.", "Barbarian daily attack powers have the rage keyword. They allow you to unleash powerful bursts of emotion, willpower, and primal energy. Each rage power starts with a mighty attack, and then you enter a rage, which grants an ongoing benefit. At 5th level, you gain the Rage Strike power, which lets you channel an unused rage power into a devastating attack while you’re raging. Using rage strike is an alternative to using a second rage power in a climactic battle; it gives you the damage output of a daily power without forcing you to enter a different rage.", "Once per round, when you score a critical hit with a barbarian attack power, you can immediately make a melee basic attack as a free action. You do not have to attack the same target that you scored a critical hit against."],
			"Option 1 details": ["Feral Might", "Barbarians connect with the natural world in a variety of ways. Some barbarians grow so hardened to physical punishment that they find it easier to simply absorb, rather than avoid, attacks. Others are living examples of the power of one’s will to shape one’s fate.\n\nChoose one of the following options. The choice you make gives you the benefit described below and also provides bonuses to certain barbarian powers, as detailed in those powers."],
			"Option 1": ["Rageblood Vigor", "Thaneborn Triumph", "Thunderborn Wrath", "Whirling Slayer"],
			"Opt 1 choices": ["When the barbarian reduces an enemy to 0 hit points with an attack, the barbarian gains temporary hit points. The number of temporary hit points at 1st level is equal to the barbarian's Constitution modifier, at 11th level, 5 + Constitution modifier, and at 21st level, 10 + Constitution modifier.", "When the barbarian bloodies an enemy, the next attack by the barbarian or an ally against that enemy gains a bonus to the attack roll equal to the barbarian's Charisma modifier.", "Once per round, when the barbarian bloodies an enemy with an attack, each enemy adjacent to the barbarian takes thunder damage equal to the barbarian's Constitution modifier.", "The barbarian can wield any one-handed weapon in the offhand and treat it as an off-hand weapon. In addition, once per round, if the barbarian's attack bloodies an enemy, the barbarian can shift 2 squares as a free action. Each enemy adjacent to the barbarian at the end of this shift grants combat advantage to the barbarian until the end of the barbarian's next turn."],
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Berserker",
			"Source": "PHB2",
			"Power": ["Primal", "Martial"],
			"Role": "Striker",
			"Abilities": ["Strength", "Dexterity"],
			"HP Start": 15,
			"HP": {
				"LVL": 6
			},
			"Fort": 2,
			"Ref": 1,
			"Will": 0,
			"Attack": 0,
			"Surges": 8,
			"Melee": true,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 3,
			"Acro": 1,
			"Arca": 0,
			"Athl": 1,
			"Bluf": 0,
			"Dipl": 0,
			"Dung": 0,
			"End": 1,
			"Heal": 1,
			"History": 0,
			"Insight": 0,
			"Intimidate": 1,
			"Nature": 1,
			"Perception": 1,
			"Religion": 0,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Rageblood Vigor", "Thaneborn Triumph", "Thunderborn Wrath", "Whirling Slayer"],
			"Default feat": "",
			"Implements": "",
			"Special": "",
			"Encounter": "",
			"Feats": ["Berseler Fury", "Heartland", "Poised Defender", "Vengeful Guardian"],
			"Description": "",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Class Features", "Berseler Fury:", "Heartland:", "Arid Desert:", "Frozen Land :", "Temperate Land :", "Poised Defender:", "Vengeful Guardian:"],
			"Detail bodies": ["Your skill and experience make you good at defending others, but when your rage surfaces, you become an aggressive attacker.", "Cloth, leather, hide; light shield", "Simple melee, military melee", " ", "Choose three from the list of class skills: Acrobatics (Dex), Athletics (Str), Endurance (Con), Heal (Wis), Intimidate (Cha), Nature (Wis), Perception (Wis)", "When you use a barbarian primal attack power, you enter berserker fury until the end of the encounter. Alternatively, you can use a minor action while you are bloodied to enter the fury. The fury has the following effects, Your defender aura ends, if it was active, and you cannot use defender aura or vengeful guardian until the fury ends. Some of your powers, such as your barbarian martial at-will attack powers, gain additional benefits, as noted in those powers. Your melee basic attacks deal 1d8 extra damage. This extra damage increases to 2d8 at 11th level and 3d8 at 21st level.", "Berserkers with the Defender Aura class feature gain defender aura as an at-will utility power. Defender aura creates an aura 1 that penalizes unmarked enemy attack rolls against allies without a defender aura by −2.", "A berserker chooses one of the following terrain types and gains the corresponding benefits. Arid Deser, Frozen Land, or Temperate Land", "At 1st level +3 bonus to AC and +2 bonus to Reflex while wearing cloth armor or no armor and not using a shield. At 4th level  resist 5 fire. At level 14 resist 10 fire. At level 24 resist 15 fire", "At 1st level +1 bonus to Fortitude and +1 bonus to Will.  At 4th level  resist 5 cold At level 14 resist 10 cold. At level 24 resist 15c old", "At first level +2 bonus to damage rolls with a one-handed weapon while wielding a one-handed weapon and using a shield. At ;eve; 3 +1 bonus to speed during a charge.", "Berserkers with the Poised Defender class feature gain a +2 bonus to AC when their defender aura is active and they are not wearing heavy armor.", "Berserkers with the Vengeful Guardian class feature gain vengeful guardian as an at-will attack power. Vengeful guardian can be used as an opportunity action triggered by enemies within the berserker's defender aura shift or attack an ally without a defender aura."],
			"Option 1 details": ["Heartland: ", "Berserkers live on the edge of civilization, where they are closer to the land and more shaped by the environment than other warriors are. You have cultivated certain abilities that are based on your experiences in your heartland's environment. You choose one of the following terrain types that best represents your heartland and gain its benefit."],
			"Option 1": ["Arid Desert", "Frozen Land", "Temperate Land"],
			"Opt 1 choices": ["You hail from a hot, dry desert region and are accustomed to the blistering heat and searing sands of your heartland. Your people prize light pro· tective clothing that keeps you from overheating, and compensate for lighter armor with greater agility. Benefit: While you are wearing cloth armor or no armor and not using a shield, you gain a + 3 bonus to AC and a + 2 bonus to Reflex. At 4th level, you gain resist 5 fire. The resistance increases to 10 at 14th level and 15 at 24th level.", "You hail from a land covered in ice and snow, and as such you know how to survive in cold environments. You are comfortable when othersare shivering with cold, and you have become toughened by constant exposure to harsh temperatures. Benefit:  You gain a+ 1 bonus to Fortitude and Will. At 4th level, you gain resist 5 cold. The resistance increases to 10 at 14th level and 15 at 24th level.You hail from a land covered in forests and plains. Your people are accustomed to having access to abundant resources and typically carry defensive gear such as shields. Benefit: While you are wielding a one-handed weapon and using a shield, you gain a +2 bonus to the damage rolls of any weapon attack you make with that weapon. At 4th level, you gain a+ 1 bonus to speed while charging."],
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Bard",
			"Source": "PHB2",
			"Power": "Arcane",
			"Role": "Leader",
			"Abilities": ["Charisma", "Intelligence", "Constitution"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 0,
			"Ref": 1,
			"Will": 1,
			"Attack": 0,
			"Surges": 7,
			"Melee": false,
			"Ranged": true,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": true,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 4,
			"Acro": 1,
			"Arca": 3,
			"Athl": 1,
			"Bluf": 1,
			"Dipl": 1,
			"Dung": 1,
			"End": 0,
			"Heal": 1,
			"History": 1,
			"Insight": 1,
			"Intimidate": 1,
			"Nature": 1,
			"Perception": 1,
			"Religion": 1,
			"Stealth": 0,
			"Street": 1,
			"Thievery": 0,
			"Paths": ["Virtue of Cunning", "Virtue of Valor", "Virtue of Prescience"],
			"Default feat": "Ritual Caster",
			"Implements": ["Instrument", "Wand"],
			"Special": "Majestic Word",
			"Encounter": "Words of Friendship",
			"Feats": ["Signs of Influence", "Skill Versatility", "Song of Rest", "Words of Friendship"],
			"Description": "Bards are artists first and foremost, and they practice magic just as they practice song, drama, or poetry. They have a clear sense of how people perceive reality, so they master charm magic and some illusions. Sagas of great heroes are part of a bard’s repertoire, and most bards follow the example of many fables and become skilled in a variety of fields. A bard’s artistic ability, knowledge of lore, and arcane might are widely respected, particularly among the world’s rulers. Art and magic share a sublime beauty, and, as a bard, you seek the place where the two meet. You might be a naturally talented wanderer who casts impressive spells almost instinctively, a student of a bardic college who learned ordered systems of magic and epic poetry, a warrior skald who mixes skill at arms with thundering music, a dashing performer known for putting on a good show even for your enemies, or a perfectionist who seeks the consummate formula that blends art and magic into a higher force. A steady rhythm beats in the back of your mind as you brandish your sword. Your eyes and ears pick up the motion of the villains that surround you, and one glance tells you everything you need to know to defeat them. You whistle three staccato notes, letting your allies know the symphony of battle is about to begin.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features", "Signs of Influence:", "Attract Attendants:", "Demand Audience:", "Ritual Beneficiary:", "Travel in Style:", "Welcome Guest:", "Skill Versatility:", "Song of Rest:", "Words of Friendship:", "Bardic Training:", "Bardic Virtue:", "Virtue of Cunning;", "Virtue of Prescience:", "Virtue of Valor:", "Majestic Word:", "Multiclass Versatility:"],
			"Detail bodies": ["You channel magical power through words and music, studying long and hard to master the power contained in the lore and sagas of old.", "Cloth, leather, hide, chainmail; light shield", "Simple melee, longsword, scimitar, short sword, simple ranged, military ranged", "Wands", "Arcana, plus four more from the list of class skills: Acrobatics (Dex), Arcana (Int), Athletics (Str), Bluff (Cha), Diplomacy (Cha), Dungeoneering (Wis), Heal (Wis), History (Int), Insight (Wis), Intimidate (Cha), Nature (Wis), Perception (Wis), Religion (Int), Streetwise (Cha)", "Your powers are a mix of ranged, melee, and close attacks, giving you plenty of options whether you choose to lead from the front or the rear. Your attacks can provide bonuses and extra movement to you and your allies, or they can charm and deceive your enemies.", "Many bards revere Corellon, patron of both artists and wielders of arcane magic. Cunning bards also honor Avandra and Sehanine, who are credited with inspiring trickery in the heroes of old. Valorous bards are more likely to revere Bahamut, Kord, or Moradin. Evil bards often worship Lolth, Tiamat, or Zehir.", "Half-elves are sometimes said to be the best bards, partly because their ability score bonuses favor the valorous bard and partly because their Dilettante racial trait complements the bard’s Multiclass Versatility. Gnomes and tieflings both make excellent cunning bards.", "", "At the DM's discretion, an original bard or skald may receive the Signs of Influence class feature. A bard with the Signs of Influence class feature gains benefits in places such as towns where bards are revered. A bard chooses two of the below options at 1st level, a third option at 13th level, and a fourth option at 17th level. Attract Attendants, Demand Audience, Ritual Beneficiary, Travel in Style, or Welcome Guest.", "Whenever you are in a village, town, or other civilized location that reveres bards, up to three servants will attend to your needs while in that location. These servant run errands for you, help you with physical tasks (such as moving chests of treasure or cleaning), and carry out any mundane task that a servant could reasonably be asked to perform.", "Whenever you are in a village, town, or city that reveres bards, you can receive an audience with someone representing the ruling power within 24 hours, and you are guaranteed safe passage to that audience by the local authorities. You can use this ability no more than once a month in a particular settlement.", "Whenever you are in a village, a town, or some other civilized location where a person lives who is capable of casting rituals, once per day you can have any ritual cost for free if it normally has a component cost of 150 gp or lower, provided that the ritual caster is not hostile toward you. The ritual cannot by one that produces a permanent item.", "Whenever you are in a village, town, or other civilized location where horses, carts, and carriages can be obtained and where bards are revered, you can procure horses for you and up to seven of your allies, plus a single cart or carriage at no cost, from someone in that location. Before you can use this ability again, you must return the horses and cart or carriage, leave them at a predetermined location, or pay for them. At the DM's discretion, you can obtain other modes of transportation of a similar value when available. For example, when visiting Cendriane, you might be able to obtain griffons to carry you to the city of Mithrendain, provided that the eladrin valued the use of griffons similar to that of horses and carts in the mortal world.", "Whenever you are in a village, a town, or a city that has a public inn where bards are revered, you can use your influence (and perhaps the promise of a performance) to obtain meals and a comfortable room for you and up to seven of your allies for the duration of your stay in that location.", "Bards and skalds with the Skill Versatility class feature gain a +1 bonus to untrained skill checks.", "Bards and skalds with the Song of Rest class feature can sing or play an instrument during a short rest to grant extra healing to themselves and to allies that can hear them. A character can only be affected by one Song of Rest at a time. A character affected by a Song of Rest regains additional hit points equal to the Song of Rest user's Charisma modifier for each healing surge the character spends at the end of the short rest.", "Bards and skalds with the Words of Friendship class feature gain use of the words of friendship encounter power, which adds a +5 power bonus to one Diplomacy check the bard makes.", "Bards gain Ritual Caster as a bonus feat. They have mastered one 1st-level bard ritual—that is, a ritual with bard as a prerequisite—plus one other 1st-level ritual of their choice, and possess a ritual book containing those mastered rituals. In addition, once per tier per day, original bards can perform a bard ritual of their level or lower without expending components. They must still pay any costs other than components, and use any required focus.", "Bards chooses one of the following options and gains the corresponding triggered ability. Virtue of Cunning, Virtue of Prescience, or Virtue of Valor.", "PLACEHOLDER", "PLACEHOLDER", "PLACEHOLDER", "Bards with the Majestic Word class feature gain use of the majestic word encounter power.", "Bards with the Multiclass Versatility class feature may take multiclass feats from more than one class."],
			"Option 1 details": ["Signs of Influence:", "At the DM's discretion, an original bard or skald may receive the Signs of Influence class feature. A bard with the Signs of Influence class feature gains benefits in places such as towns where bards are revered. A bard chooses two of the below options at 1st level, a third option at 13th level, and a fourth option at 17th level."],
			"Option 1": ["Attract Attendants", "Demand Audience", "Ritual Beneficiary", "Travel in Style", "Welcome Guest"],
			"Opt 1 choices": ["Whenever you are in a village, town, or other civilized location that reveres bards, up to three servants will attend to your needs while in that location. These servant run errands for you, help you with physical tasks (such as moving chests of treasure or cleaning), and carry out any mundane task that a servant could reasonably be asked to perform.", "Whenever you are in a village, town, or city that reveres bards, you can receive an audience with someone representing the ruling power within 24 hours, and you are guaranteed safe passage to that audience by the local authorities. You can use this ability no more than once a month in a particular settlement.", "Whenever you are in a village, a town, or some other civilized location where a person lives who is capable of casting rituals, once per day you can have any ritual cost for free if it normally has a component cost of 150 gp or lower, provided that the ritual caster is not hostile toward you. The ritual cannot by one that produces a permanent item.", "Whenever you are in a village, town, or other civilized location where horses, carts, and carriages can be obtained and where bards are revered, you can procure horses for you and up to seven of your allies, plus a single cart or carriage at no cost, from someone in that location. Before you can use this ability again, you must return the horses and cart or carriage, leave them at a predetermined location, or pay for them. At the DM's discretion, you can obtain other modes of transportation of a similar value when available. For example, when visiting Cendriane, you might be able to obtain griffons to carry you to the city of Mithrendain, provided that the eladrin valued the use of griffons similar to that of horses and carts in the mortal world.", "Whenever you are in a village, a town, or a city that has a public inn where bards are revered, you can use your influence (and perhaps the promise of a performance) to obtain meals and a comfortable room for you and up to seven of your allies for the duration of your stay in that location.", "Bards and skalds with the Skill Versatility class feature gain a +1 bonus to untrained skill checks.", "Bards and skalds with the Song of Rest class feature can sing or play an instrument during a short rest to grant extra healing to themselves and to allies that can hear them. A character can only be affected by one Song of Rest at a time. A character affected by a Song of Rest regains additional hit points equal to the Song of Rest user's Charisma modifier for each healing surge the character spends at the end of the short rest.", "Bards and skalds with the Words of Friendship class feature gain use of the words of friendship encounter power, which adds a +5 power bonus to one Diplomacy check the bard makes."],
			"Option 2 details": ["Bardic Virtue:", "Bards chooses one of the following options and gains the corresponding triggered ability."],
			"Option 2": ["Virtue of Cunning", "Virtue of Prescience", "Virtue of Valor"],
			"Opt 2 Choices": ["PLACEHOLDER", "PLACEHOLDER", "PLACEHOLDER"],
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Skald",
			"Source": "HoF",
			"Power": ["Arcane", "Martial"],
			"Role": "Leder",
			"Abilities": ["Charisma", "Intelligence"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 0,
			"Ref": 1,
			"Will": 1,
			"Attack": 0,
			"Surges": 7,
			"Melee": true,
			"Ranged": true,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": true,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 4,
			"Acro": 1,
			"Arca": 3,
			"Athl": 1,
			"Bluf": 1,
			"Dipl": 1,
			"Dung": 1,
			"End": 0,
			"Heal": 1,
			"History": 1,
			"Insight": 1,
			"Intimidate": 1,
			"Nature": 1,
			"Perception": 1,
			"Religion": 1,
			"Stealth": 0,
			"Street": 1,
			"Thievery": 0,
			"Paths": "",
			"Default feat": "",
			"Implements": "Wand",
			"Special": "",
			"Encounter": "",
			"Feats": ["Deceptive Duelist", "Skald's Aura", "Mastery of Story and Song", "Song of Rest", "Skill Versatility", "Words of Friendship"],
			"Description": "Those who live on the fringes of civilization, or who come from places where civilization is nothing like what the mortal races understand, rely on chroniclers and historians who maintain their history as oral tradition. These individuals, respected for their knowledge and insights, serve as the keepers of the heritage of their people. It is their responsibility to make sure that none forget the past. They are both observers and storytellers; what they see becomes the legends and tales passed on from one generation to the next. These historians are known as skalds. A skald is no mere entertainer. Skalds are responsible for witnessing firsthand the great events of their time, committing those events to memory, and then passing on those tales. They learned all the tales of the previous generation as well, and theirs is a line of storytellers who pass on the entire history of their people. Skalds travel from one place to the next, acting as witnesses to the events of their time. Along the way they pick up new stories and bits of magic and other tricks that add to their mystique. Among the people of the world and other realms who know of this bardic tradition, skalds are nearly sacred. They can move freely through enemy territory and are considered untouchable even during the most bitter of tribal feuds. In many ways, skalds are like holy leaders: All but the most honorless thugs hesitate to attack them, and they are revered and respected for their role as\nmasters of history. When a culture's entire history is contained within the tales told by a single person, that person is more than just a storyteller; he or she is the sum total of that history, and that of all its ancestors, given flesh. In the Feywild, a skald is treated as a visiting dignitary, no matter where he or she comes from. From Cendriane to Mithrendain, even the most unmannered and barbaric skalds can find food, shelter, and respect throughout the lands of the eladrin. The Summer Queen herself would not refuse an audience with a skald, though most skalds know better than to bother powerful fey lords and ladies with trifling matters in such sessions. The status of a skald is perhaps even more elevated in the Feywild than it is in the mortal world, so that few in the fey realm would risk being savaged in the stories of a skald, their names blackened for the rest of history because of an offense they committed against a storyteller.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:1", "Class Features", "Signs of Influence:", "Attract Attendants:", "Demand Audience:", "Ritual Beneficiary:", "Travel in Style:", "Welcome Guest:", "Skill Versatility:", "Song of Rest:", "Words of Friendship:", "Deceptive Duelist:", "Master of Story and Song:", "Skald's Aura:", "Bard powers:"],
			"Detail bodies": ["You combine a strong tradition of martial training and expertise with arcane tricks that you pick up along the way.", "Cloth, leather, hide, chainmail; light shield", "Simple melee, simple ranged, military ranged, longsword, scimitar, short sword", "Wands", "Arcana, plus four more from the list of class skills: Acrobatics (Dex), Arcana (lnt), Athletics (Str), Bluff (Cha), Diplomacy (Cha), Dungeoneering (Wis), Heal (Wis), History (lnt), Insight (Wis), Intimidate (Cha), Nature (Wis), Perception (Wis), Religion (lnt), Streetwise (Cha)", "Deceptive Duelist, Skald's Aura, Mastery of Story and Song, Song of Rest, Skill Versatility, Words of Friendship", "", "At the DM's discretion, an original bard or skald may receive the Signs of Influence class feature. A bard with the Signs of Influence class feature gains benefits in places such as towns where bards are revered. A bard chooses two of the below options at 1st level, a third option at 13th level, and a fourth option at 17th level. Attract Attendants, Demand Audience, Ritual Beneficiary, Travel in Style, or Welcome Guest.", "Whenever you are in a village, town, or other civilized location that reveres bards, up to three servants will attend to your needs while in that location. These servant run errands for you, help you with physical tasks (such as moving chests of treasure or cleaning), and carry out any mundane task that a servant could reasonably be asked to perform.", "Whenever you are in a village, town, or city that reveres bards, you can receive an audience with someone representing the ruling power within 24 hours, and you are guaranteed safe passage to that audience by the local authorities. You can use this ability no more than once a month in a particular settlement.", "Whenever you are in a village, a town, or some other civilized location where a person lives who is capable of casting rituals, once per day you can have any ritual cost for free if it normally has a component cost of 150 gp or lower, provided that the ritual caster is not hostile toward you. The ritual cannot by one that produces a permanent item.", "Whenever you are in a village, town, or other civilized location where horses, carts, and carriages can be obtained and where bards are revered, you can procure horses for you and up to seven of your allies, plus a single cart or carriage at no cost, from someone in that location. Before you can use this ability again, you must return the horses and cart or carriage, leave them at a predetermined location, or pay for them. At the DM's discretion, you can obtain other modes of transportation of a similar value when available. For example, when visiting Cendriane, you might be able to obtain griffons to carry you to the city of Mithrendain, provided that the eladrin valued the use of griffons similar to that of horses and carts in the mortal world.", "Whenever you are in a village, a town, or a city that has a public inn where bards are revered, you can use your influence (and perhaps the promise of a performance) to obtain meals and a comfortable room for you and up to seven of your allies for the duration of your stay in that location.", "Bards and skalds with the Skill Versatility class feature gain a +1 bonus to untrained skill checks.", "Bards and skalds with the Song of Rest class feature can sing or play an instrument during a short rest to grant extra healing to themselves and to allies that can hear them. A character can only be affected by one Song of Rest at a time. A character affected by a Song of Rest regains additional hit points equal to the Song of Rest user's Charisma modifier for each healing surge the character spends at the end of the short rest.", "Bards and skalds with the Words of Friendship class feature gain use of the words of friendship encounter power, which adds a +5 power bonus to one Diplomacy check the bard makes.", "Skalds with the Deceptive Duelist class feature can use Charisma instead of Strength for both the attack roll and the damage roll when making a melee basic attack with a one-handed weapon.", "Skalds with the Master of Story and Song class feature learn additional bard daily attack powers at levels 1, 15, 19, 25, and 29. The number of daily attacks the skald can use does not increase, and the skald cannot use more than one bard daily attack power of any particular level per day.", "Skalds with the Skald's Aura class feature gain use of the skald's aura power, which allows the skald and nearby allies to spend a healing surge, or let an adjacent ally spend a healing surge, as a minor action.", "Bard powers, having arcane or martial power sources, are also called spells or exploits."],
			"Option 1 details": ["Signs of Influence:", "At the DM's discretion, an original bard or skald may receive the Signs of Influence class feature. A bard with the Signs of Influence class feature gains benefits in places such as towns where bards are revered. A bard chooses two of the below options at 1st level, a third option at 13th level, and a fourth option at 17th level."],
			"Option 1": ["Attract Attendants", "Demand Audience", "Ritual Beneficiary", "Travel in Style", "Welcome Guest"],
			"Opt 1 choices": ["Whenever you are in a village, town, or other civilized location that reveres bards, up to three servants will attend to your needs while in that location. These servant run errands for you, help you with physical tasks (such as moving chests of treasure or cleaning), and carry out any mundane task that a servant could reasonably be asked to perform.", "Whenever you are in a village, town, or city that reveres bards, you can receive an audience with someone representing the ruling power within 24 hours, and you are guaranteed safe passage to that audience by the local authorities. You can use this ability no more than once a month in a particular settlement.", "Whenever you are in a village, a town, or some other civilized location where a person lives who is capable of casting rituals, once per day you can have any ritual cost for free if it normally has a component cost of 150 gp or lower, provided that the ritual caster is not hostile toward you. The ritual cannot by one that produces a permanent item.", "Whenever you are in a village, town, or other civilized location where horses, carts, and carriages can be obtained and where bards are revered, you can procure horses for you and up to seven of your allies, plus a single cart or carriage at no cost, from someone in that location. Before you can use this ability again, you must return the horses and cart or carriage, leave them at a predetermined location, or pay for them. At the DM's discretion, you can obtain other modes of transportation of a similar value when available. For example, when visiting Cendriane, you might be able to obtain griffons to carry you to the city of Mithrendain, provided that the eladrin valued the use of griffons similar to that of horses and carts in the mortal world.", "Whenever you are in a village, a town, or a city that has a public inn where bards are revered, you can use your influence (and perhaps the promise of a performance) to obtain meals and a comfortable room for you and up to seven of your allies for the duration of your stay in that location.", "Bards and skalds with the Skill Versatility class feature gain a +1 bonus to untrained skill checks.", "Bards and skalds with the Song of Rest class feature can sing or play an instrument during a short rest to grant extra healing to themselves and to allies that can hear them. A character can only be affected by one Song of Rest at a time. A character affected by a Song of Rest regains additional hit points equal to the Song of Rest user's Charisma modifier for each healing surge the character spends at the end of the short rest.", "Bards and skalds with the Words of Friendship class feature gain use of the words of friendship encounter power, which adds a +5 power bonus to one Diplomacy check the bard makes."],
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Battlemind",
			"Source": "PHB3",
			"Power": "Psionic",
			"Role": "Defender",
			"Abilities": ["Constitution", "Wisdom", "Charisma"],
			"HP Start": 15,
			"HP": {
				"LVL": 6
			},
			"Fort": 0,
			"Ref": 0,
			"Will": 2,
			"Attack": 0,
			"Surges": 9,
			"Melee": true,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": true,
			"Scale": true,
			"Plate": false,
			"Shield": true,
			"Training": 3,
			"Acro": 0,
			"Arca": 1,
			"Athl": 1,
			"Bluf": 1,
			"Dipl": 1,
			"Dung": 0,
			"End": 1,
			"Heal": 1,
			"History": 0,
			"Insight": 1,
			"Intimidate": 1,
			"Nature": 0,
			"Perception": 0,
			"Religion": 0,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Battle Resilience", "Speed of Thought", "Persistent Harrier", "Wild Focus"],
			"Default feat": "",
			"Implements": "",
			"Special": "",
			"Encounter": "",
			"Feats": ["Psionic Augmentation", "Psionic Defense", "Psionic Study"],
			"Description": "As wanderers, mercenaries, and adventurers; battleminds are carefree warriors who seek only to test their skill against the mightiest and most dangerous opponents. Battleminds possess a potent combination of psionic and physical skill. allowing them to use their magic to manipulate and deceive their foes even as their fighting skill lets them carve a swath through enemy ranks. Battleminds tend to be bold and sometimes arrogant, an attitude earned through bringing ruin to enemies over the course ofmany connicts. You might not share your fellow battleminds' arrogance, but you do have access to an array of combat abilities that let you manipulate, barne, and defeat your enemies. Your mind is as deadly as your weapon. and with the aid ofyour psionic magic. your body can turn aside attacks as effectively as a suit of plate armor can. Let those who would stand against your might quiver in terror when you approach. for you are a battlemind, and supremacy in combat is your birthright.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features", "Psionic Augmentation:", "Psionic Defense:", "Psionic Study:", "Battle Resilience:", "Persistent Harrier:", "Speed of Thought:", "Wild Focus:"],
			"Detail bodies": ["You are a psionic warrior. a weapon master who combines physical might and a cunning intellect.", "Constitution. Wisdom. Charisma", "Cloth. leather. hide. chainmail. scale; light shield. heavy shield", "Simple melee. military melee. simple ranged", " ", "Choose three from the list of class skills: Arcana (Int). Athletics (Str). Bluff (Cha). Diplomacy (Cha). Endurance (Con). Heal (Wis). Insight (Wis). Intimidate (Cha)", "Your heavy armor allows you to take on your enemies' attacks without fear, and your melee attacks that are augmented by psionic magic let you control your enemies like puppets and set them up for defeat. You excel at controlling the battle line and forcing enemies to fight you while your allies wreak havoc.", "Battlemlnds who live up to this class's renowned arrogance rarely pray to the gods. and stories abound of battle minds whose ill luck could be placed at the feet of their impiety. Those battleminds who do follow the gods typically revere Kord for his martial skill and strength. Bahamut for his practice of justice. or loun for being the originator of psionic magic.", "Dwarves and wilden make excellent resilient Ibattleminds. putting their Constitution and Wisdom to great use in shaping their bodies to meet the needs of combat. Half-elves are Ideal quick battlemlnds. channelIng their natural Charisma into psionic alacrity. Goliaths' sheer physica l power makes them well suited for this class. and many gnome and tiefllng warriors are drawn to the guile and tr'ickery of some battlemlnd powers.", "Battleminds gain augmentable at-will attack powers instead of encounter attack powers as they level. A 1st-level battlemind chooses two 1st-level at-will attack powers. A 3rd-level battlemind chooses a third at-will attack power. At 7th, 13th, 17th, 23rd, and 27th levels, a battlemind may replace an augmentable at-will power with a new one. This replacement is in addition to the normal retraining of a feat, power, or skill at each level. The battlemind can expend power points to enhance the effect of augmentable powers, as shown in each power's description. Spent power points are regained after a short rest or extended rest. PLAECHOLDER", "Battleminds gain the use of the battlemind's demand, blurred step, and mind spike at-will powers.", "Battleminds choose one of the following encounter powers: battle resilience, persistent harrier, speed of thought, or wild focus.", "PLACEHOLDER", "PLACEHOLDER", "PLACEHOLDER", "PLACEHOLDER"],
			"Option 1 details": ["Psionic Study:", "Battleminds choose one of the following encounter powers: battle resilience, persistent harrier, speed of thought, or wild focus."],
			"Option 1": ["Battle Resilience", "Persistent Harrier", "Speed of Thought", "Wild Focus"],
			"Opt 1 choices": ["PLACEHOLDER", "PLACEHOLDER", "PLACEHOLDER", "PLACEHOLDER"],
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": true
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Templar",
			"Source": "PHB",
			"Power": "Divine",
			"Role": "Leader",
			"Abilities": ["Wisdom", "Constitution", "Charisma"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 0,
			"Ref": 0,
			"Will": 2,
			"Attack": 0,
			"Surges": 7,
			"Melee": false,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": true,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 3,
			"Acro": 0,
			"Arca": 1,
			"Athl": 0,
			"Bluf": 0,
			"Dipl": 1,
			"Dung": 0,
			"End": 0,
			"Heal": 1,
			"History": 1,
			"Insight": 1,
			"Intimidate": 0,
			"Nature": 0,
			"Perception": 0,
			"Religion": 3,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Turn Undead", "Healer's Mercy"],
			"Default feat": "Ritual Caster",
			"Implements": "Symbol",
			"Special": "Healing Word",
			"Encounter": "Channel Divinity",
			"Feats": ["Channel Divinity:", "Channel Divinity-Divine Fortune:", "Healer's Lore:", "Healing Word:", "Ritual Casting"],
			"Description": "Clerics are battle leaders who are invested with divine power. They blast foes with magical prayers, bolster and heal companions, and lead the way to victory with a mace in one hand and a holy symbol in the other. Clerics run the gamut from humble servants of the common folk to ruthless enforcers of evil gods. As a cleric, the deity (or deities) you choose to revere goes a long way toward defining you, or at least how other people in the world see you. You could be a platinum-garbed envoy of Bahamut seeking justice throughout the land, a shadowy follower of Sehanine with a roguish streak, a burly disciple of Kord who believes the virtue of strength is sufficient for all challenges, or a dwarf cleric of Moradin bringing honor to the denizens of your mountain home. Will you protect what is sacred to your god, quest for legendary holy artifacts, pursue a life of evangelical adventuring, or attempt all these deeds and more? ",
			"Builds": ["Battle Cleric", "Devoted Clearic"],
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features:"],
			"Detail bodies": ["You have been invested with the authority to wield divine power on behalf of a deity, faith, or philosophy.", "Cloth, leather, hide, chainmail", "Simple melee, simple ranged", "Holy symbol", "Religion, plus three more from the list of class skills: Arcana (Int), Diplomacy (Cha), Heal (Wis), History (Int), Insight (Wis), Religion (Int)", "You are an extremely good healer. You have a mix of melee and ranged powers. Most of your attacks deal only moderate damage, but they safeguard your allies or provide bonuses to their attacks.", "A cleric can choose to worship any deity, but steer clear of choosing an evil or chaotic evil deity unless you have permission from your DM to choose one.", "Humans, dwarves, and devas make ideal clerics. Elves, half-elves, and dragonborn are good clerics too, but they rarely have the same values of piety and reverence found in many human and dwarven cultures. Certain gods attract a preponderance of clerics of a particular race—for example, many (but not all) clerics of Moradin are dwarves—but in general, all races respect all gods to at least some degree. The race you play and the deity your character worships have little effect on your cleric’s ability to utilize divine powers.", "Channel Divinity, Healer’s Lore, Healing Word, Ritual Casting"],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Warpriest",
			"Source": "HFL",
			"Power": "Divine",
			"Role": "Leader",
			"Abilities": ["Wisdom", "Constitution"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 1,
			"Ref": 0,
			"Will": 1,
			"Attack": 0,
			"Surges": 7,
			"Melee": false,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": true,
			"Scale": false,
			"Plate": false,
			"Shield": true,
			"Training": 3,
			"Acro": 0,
			"Arca": 1,
			"Athl": 0,
			"Bluf": 0,
			"Dipl": 1,
			"Dung": 0,
			"End": 0,
			"Heal": 1,
			"History": 1,
			"Insight": 1,
			"Intimidate": 0,
			"Nature": 0,
			"Perception": 0,
			"Religion": 3,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Storm Domain", "Sun Domain", "Earth Domain"],
			"Default feat": "",
			"Implements": "Symbol",
			"Special": "Healing Word",
			"Encounter": "",
			"Feats": ["Channel Divinity: Use one ability once/Encounter", "Powers:- Smite Undead & ", "", "Healing Word: Surge + 1d6", " "],
			"Description": "Warpriests use a combination of religious dedication and keen insight to access the divine magic granted by the gods they serve. Using that magic to back up impressive martial ability, warpriests serve as the shield of their faith. Warpriests protect the innocent from marauding monsters and lead adventuring expeditions into the dark unknown. They are drawn to the borderlands between the scattered settlements of civilization and the realms of chaos. There, they attend the spiritual and military needs of the population. Warpriests occupy the middle ground between the wizard and the fighter. They are trained to use weapons and armor, but it is their induction into the mysteries of divine magic that makes them unique. A warpriest can smash an ore with a mace one moment and unleash divine power to smite a vampire the next. The power of weapons and the might of magic meet in the divine mandate of  the warpriest.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Class Features:", "Domain and Deity:"],
			"Detail bodies": ["You lead by healing and shielding allies with your prayers, and by drawing on divine power to improve your allies' attacks. Your high Armor Class and effective weapon attacks let you lean toward defender as a secondary role.", "Cloth, leather, hide, chainmail; light shield, heavy shield", "Simple melee, simple ranged", "Holy symbols", "Religion, plus three more from the list of class skills: Arcana (Int), Diplomacy (Cha), Heal (Wis), History (Int), Insight (Wis), Religion (Int)", "Channel Divinity, Smite Undead, Healing Word", "Clerics derive their power from the gods, and choosing which deity your character follows is an important first step when creating a warpriest. The deity your character follows helps to shape the powers you wield and your\nplace in the world. A domain is a sphere of power that specific deities control. No god is powerful enough to claim the entirety of creation. Instead, each deity watches over a specific portion of t h e world and the activities of its people. As warrior clerics, warpriests have an affinity for deities associated with domains that provide the power and might needed to drive  back the forces of evil. Two such domains. Each domain has specific deities that are tied to it. Your Dungeon Master might also have other gods you can choose from that are specific to the campaign world. Before you choose a domain, think about the kind of warpriest you want to play. Clerics of t h e storm domain believe in taking the fight to the enemy. They focus on destructive attacks that set up a clear path for their allies' assault. The powers offered by the storm domain leave creatures broken and vulnerable against the next attacks they face. Clerics of the sun domain use their power primarily to shield their allies  from enemy attacks. Such clerics might use magic to\nwrap their allies in protective wards or to incapacitate their foes, leaving t h em unable to attack."],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Druid",
			"Source": "PHB2",
			"Power": "Primal",
			"Role": "Controller",
			"Abilities": ["Wisdom", "Dexterity", "Constitution"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 0,
			"Ref": 1,
			"Will": 1,
			"Attack": 0,
			"Surges": 7,
			"Melee": false,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 3,
			"Acro": 0,
			"Arca": 1,
			"Athl": 1,
			"Bluf": 0,
			"Dipl": 1,
			"Dung": 0,
			"End": 1,
			"Heal": 1,
			"History": 1,
			"Insight": 1,
			"Intimidate": 0,
			"Nature": 3,
			"Perception": 1,
			"Religion": 0,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Primal Guardian", "Primal Predator", "Primal Swarm"],
			"Default feat": "Ritual Caster",
			"Implements": ["Staff", "Totem"],
			"Special": "",
			"Encounter": "",
			"Feats": ["Wild Shape: Transform into Natural/Fey Beast", "Ritual Casting", "Primal Aspect: Light Armor gains"],
			"Description": "Secretive and enigmatic, druids call the wilderness their home. They are capable of running with a wolf pack, speaking with the most ancient trees, and watching thunderstorms from atop the clouds themselves. They regard challenges as tests, both of their fitness and of their connection with the wild places of the world. And though many druids project an outward calm, they have the cunning of the beast and the fury of the storm. Whether you were born to the wilds or retreated from civilization, whether you chose your path or answered a call that whispered in your heart, you share a bond with the primal spirits of nature. You are neither their servant nor their master, but winds, trees, and beasts heed your words, for they recognize you as kin. Call to the spirits, and they will entangle your foes or smite your enemies with the storm. Unleash your own spirit, and you will become the Primal Beast, uncaged and untamed.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features:"],
			"Detail bodies": ["You have gained your powers through a careful study of and communion with the natural world.", "Cloth, leather, hide", "Simple melee, simple ranged", "Staffs, totems", "Nature, plus three more from the list of class skills: Arcana (Int), Athletics (Str), Diplomacy (Cha), Endurance (Con), Heal (Wis), History (Int), Insight (Wis), Nature (Wis), Perception (Wis)", "You combine a number of potent ranged and area powers with the ability to take beast form and bring the fight directly to your foes. Depending on the powers you choose, you can spend more combat time in beast form or more in your humanoid form.", "Most druids do not worship the gods of the Astral Sea, instead orienting their lives and beliefs around the primal spirits of nature. It might be misleading to call their relationship with these spirits worship, but druids invoke the spirits in times of passage, implore them for aid, and appease them with offerings of burned food or spilled blood.", "Elves and razorclaw shifters make excellent predator druids, combining native insight and attunement\nto nature with grace and agility. Dwarves excel as guardian druids; goliath and human druids often follow that path as well.", "Balance of Nature, Primal Aspect, Ritual Casting, wild shape"],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Protector",
			"Source": "HoF",
			"Power": "Primal",
			"Role": "Controller",
			"Abilities": ["Wisdom", "Constitution", "Dexterity"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 0,
			"Ref": 1,
			"Will": 1,
			"Attack": 0,
			"Surges": 7,
			"Melee": false,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 3,
			"Acro": 0,
			"Arca": 1,
			"Athl": 1,
			"Bluf": 0,
			"Dipl": 1,
			"Dung": 0,
			"End": 1,
			"Heal": 1,
			"History": 1,
			"Insight": 1,
			"Intimidate": 0,
			"Nature": 3,
			"Perception": 1,
			"Religion": 0,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Primal Guardian", "Primal Predator", "Primal Swarm"],
			"Default feat": "Ritual Caster",
			"Implements": ["Staff", "Totem"],
			"Special": "",
			"Encounter": "",
			"Feats": ["Wild Shape: Transform into Natural/Fey Beast[Ritual Casting",
				"Primal Aspect: Light Armor gains"
			],
			"Description": "Though most people associate the Feywild with arcane magic, it is also home to some of the most pristine regions of natural growth across all of the planes. Primeval forests sit untouched by civilization since their creation, alongside mountainsides and hilltops upon which no intelligent being has ever set foot. It should be no surprise that there are those who have chosen a life of protection and guardianship over the natural treasures of the plane. As with all druids, protectors are the masters of ihe magic first shared with mortals by the primal spirits. The primal spirits might dwell chiefly in the world, but the druids of the Feywild hear their call and heed their guidance even in the fey realm. Though it might seem as though the presence of the primal spirits in the Feywild would be at a diminished level, in truth primal magic is often among the most effective tools to use in a plane infused with arcane magic. Where many of the dangers of the Feywild have evolved over the eons to deal with the omnipresent nature of arcane threats, primal magic is still untamed and unanticipated by most creatures of the plane. As a protector, you learned your primal magic from a druid circle, which trained you to protect nature and punish those that would do it harm. By ensuring that the land, the water, and the sky inhabited by ihe primal spirits is protected, you become a staunch defender of those who live in harmony with nature and show respect for their natural surroundings. You might go out into the world to seek new experiences and powerful artifacts of primal magic. Though you will stray far from your druid circle in the course of your adventures, your efforts reflect on its goals, and you will use the knowledge it has granted you to battle despoilers and defilers throughout the world and across the planes.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Class Features:"],
			"Detail bodies": ["You have mastered the power and magic of nature, using it to create a line of defense between the natural world and those that would harm it.", "Cloth, leather, hide", "Simple melee, simple ranged", "Staffs, totems", "Nature, plus three more from the list of class skills: Arcana (lnt), Athletics (Str), Diplomacy (Cha), Endurance (Con), Heal (Wis), History (lnt), Insight (Wis), Nature (Wis), Perception (Wis)", "Wild Shape: Transform into Natural/Fey Beast, Ritual Casting, Primal Aspect: Light Armor gains"],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Sentinel",
			"Source": "HoFK",
			"Power": "Primal",
			"Role": "Leader",
			"Abilities": ["Wisdom", "Constitution"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 2,
			"Ref": 0,
			"Will": 0,
			"Attack": 0,
			"Surges": 7,
			"Melee": false,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 3,
			"Acro": 0,
			"Arca": 0,
			"Athl": 1,
			"Bluf": 0,
			"Dipl": 1,
			"Dung": 0,
			"End": 1,
			"Heal": 1,
			"History": 1,
			"Insight": 1,
			"Intimidate": 0,
			"Nature": 3,
			"Perception": 1,
			"Religion": 0,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Druid of Spring", "Druid of Summer"],
			"Default feat": "",
			"Implements": ["Staff", "Totem"],
			"Special": "Healing Word",
			"Encounter": "",
			"Feats": ["Animal Companion: ", "Combined Attack: You and animal companion each attack", "Healing Word: Surge + 1d6", "Wilderness Knacks"],
			"Description": "As a sentinel, you use primal power to shelter your allies and defeat those that would disrupt the balance of the natural world. Some sentinels take up the profession with the expectation of becoming the leader or advisor of a frontier village. Others become hermits or wanderers, which leads naturally to the adventurer's life. However, all sentinels use their mastery of primal magic to help the people of the frontier survive hardships and maintain a respectful relationship with the natural world. As a sentinel, you draw power from the primal spirits-ancient guardians of the world that represent the countless aspects of nature. Although many denizens of the wild feel a connection to the primal spirits, you take that connection\nto its highest level. You are a creature of both the natural world and the spiritual world, whose task it is to stand against the forces that threaten both.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Class Features:"],
			"Detail bodies": ["You wield the magic of the natural world, using your connection to the primal spirits to tend the wounds of your allies and lead them to victory.", "Cloth, leather, hide; light shields", "Simple melee, simple ranged", "Staffs, totems", "Nature, plus three more from the list of class skills: Arcana (Int), Athletics (Str), Diplomacy (Cha), Endurance (Con), Heal (Wis), History (Int), Insight (Wis), Nature (Wis), Perception (Wis)", "Acolyte of the Natural Cycle, Animal Companion, Primal Guardian, Combined Attack, Healing Word, Wilderness Knacks"],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Weaponmaster",
			"Source": "PHB",
			"Power": "Martial",
			"Role": "Defender",
			"Abilities": ["Strength", "Dexterity", "Wisdom", "Constitution"],
			"HP Start": 15,
			"HP": {
				"LVL": 6
			},
			"Fort": 2,
			"Ref": 0,
			"Will": 0,
			"Attack": 1,
			"Surges": 9,
			"Melee": true,
			"Ranged": true,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": true,
			"Scale": true,
			"Plate": false,
			"Shield": true,
			"Training": 3,
			"Acro": 0,
			"Arca": 0,
			"Athl": 1,
			"Bluf": 0,
			"Dipl": 0,
			"Dung": 0,
			"End": 1,
			"Heal": 1,
			"History": 0,
			"Insight": 0,
			"Intimidate": 1,
			"Nature": 0,
			"Perception": 0,
			"Religion": 0,
			"Stealth": 0,
			"Street": 1,
			"Thievery": 0,
			"Paths": ["Weapon Talent: 1 handed Weapons", "Weapon Talent: 2 handed Weapons", "Battlerager Vigor", "Tempest Technique", "Brawler Style", "Combat Superiority", "Combat Agility"],
			"Default feat": "",
			"Implements": "",
			"Special": "",
			"Encounter": "",
			"Feats": ["Combat Challenge: Marks target", " -2 attack only others", "free basic attack if mark shifts or attacks only others"],
			"Description": ["Fighters are determined combat adepts trained to protect the other members of their adventuring groups. Fighters define the front line by bashing and slicingfoes into submission while reflecting enemy attacks through the use of heavy armor. Fighters draw  weapons for gold, for glory, for duty, and for the mere joy of unrestrained martial exercise. Regardless of your level of skill and the specificweapons you eventually master, your motivations determine who you defend and who you slay. You could be a noble champion who pledges your blade to gallant causes, a calculating mercenary who cares more for the clink of gold than praise, a homelessprince on the run from assassins, or a blood-loving  thug looking for the next good fight. Your future is yours. When you unsheathe your weapon, what battle cry flies from your lips?"],
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features:", "Combat Challenge", "Combat Superiority", "Fighter Weapon Talent"],
			"Detail bodies": ["You have become a master of combat through endless hours of practice, determination, and your own sheer physical toughness.", "Cloth, leather, hide, chainmail, scale; light shield, heavy shield", "Simple melee, military melee, simple ranged, military ranged", " ", "Choose three from the list of class skills: Athletics (Str), Endurance (Con), Heal (Wis), Intimidate (Cha), Streetwise (Cha)", "You are extremely tough, with a great Armor Class and lots of hit points. You have extraordinary resilience against physical attack. You don’t have much ability to fight at range, but you excel in melee combat. You have special abilities that make it dangerous for enemies to ignore you, so you can contain foes and keep them away from your friends.", "Fighters naturally favor deities of war, combat, adventure, or valor. Bahamut and Kord are popular, as is Avandra. Many unaligned or evil fighters pay homage to Bane, the god of war.", "Fighters come from all races. Dragonborn, dwarves, and humans are the most common fighters.", "Some of your most important characteristics are the ability to wear very good armor, your exceptional hit point total, and your astery of all military weapons. In addition, you have three unique class features.", "In combat, it’s dangerous to ignore a fighter. Every time you attack an enemy, whether the attack hits or misses, you can choose to mark that target. The mark lasts until the end of your next turn. While a target is marked, it takes a –2 penalty to attack rolls for any attack that doesn’t include you as a target. A creature can be subject to only one mark at a time. A new mark supersedes a mark that was already in place. In addition, whenever a marked enemy that is adjacent to you shifts or makes an attack that does not include you, you can make a melee basic attack against that enemy as an immediate interrupt.", "You gain a bonus to opportunity attacks equal to your Wisdom modifier. An enemy struck by your opportunity attack stops moving, if a move provoked the attack. If it still has actions remaining, it can use them to resume moving.", "Choose either one-handed or two-handed weapons. When using a weapon of your chosen style, you gain a +1 bonus to attack rolls."],
			"Option 1 details": ["Fighter Weapon Talent", "Choose either one-handed or two-handed weapons. When using a weapon of your chosen style, you gain a +1 bonus to attack rolls."],
			"Option 1": ["One-Handed Weapons", "Two-Handed Weapons"],
			"Opt 1 choices": ["When using a one-handed weapon you gain a +1 bonus to attack rolls.", "When using a two-handed weapon you gain a +1 bonus to attack rolls."],
			"Option 2 details": ["Combat Feat", "You can select Combat Agility in place of your Combat Superiority feature."],
			"Option 2": ["Combat Superiority", "Combat Agility"],
			"Opt 2 Choices": ["You gain a bonus to opportunity attacks equal to your Wisdom modifier. An enemy struck by your opportunity attack stops moving, if a move provoked the attack. If it still has actions remaining, it can use them to resume moving.", "This class feature replaces the Combat Superiority class feature.\nCombat Agility: You gain the following power."],
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Knight",
			"Source": "HoFL",
			"Power": "Martial",
			"Role": "Defender",
			"Abilities": ["Strength", "Constitution"],
			"HP Start": 15,
			"HP": {
				"LVL": 6
			},
			"Fort": 2,
			"Ref": 0,
			"Will": 0,
			"Attack": 1,
			"Surges": 9,
			"Melee": true,
			"Ranged": true,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": true,
			"Scale": true,
			"Plate": true,
			"Shield": true,
			"Training": 3,
			"Acro": 0,
			"Arca": 0,
			"Athl": 1,
			"Bluf": 0,
			"Dipl": 1,
			"Dung": 0,
			"End": 1,
			"Heal": 1,
			"History": 0,
			"Insight": 0,
			"Intimidate": 1,
			"Nature": 0,
			"Perception": 0,
			"Religion": 0,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Shield Finesse", "Spinning Deflection"],
			"Default feat": "",
			"Implements": "",
			"Special": "",
			"Encounter": "",
			"Feats": ["Defender Aura - each enemy in aura 1 takes -2 attack rolls when not including you", "Battle Guardian: Make melee basic against enemy that shifts or attacks ally", "Weapon Talent: +1 attack rolls", "Power Strike: Extra 1[W] damage 1/enc"],
			"Description": "Along the borderlands, knights are the stalwart commanders of peasant militias caravan guards, and adventuring groups. Their cunning and skill puts them in control of the battlefield and lets them minimize the onslaught of their enemies. Rampaging monsters fear a knight above almost any other attacker. While the knight locks down a formidable foe, the other members of a party close in for the kill. Many knights are members of chivalrous orders, though some are independent warriors who wander wherever their hearts take them. Each order combines a rigid sense of honor and relentless training to produce champions of the borderlands. Whenever ogres descend from the hills, when hobgoblins march from their strongholds, and when necromancers call forth armies of undead, a noble knight is the best defense an isolated community can hope for. All sorts of warriors follow the path of the knight: young wanderers seeking to prove their mettle and gain full membership into a knightly order, reclusive warriors who abandon material comforts in favor of crusades for justice, or selfcentered mercenaries who hope to claim treasure and power after every fight. Most knights start as squires, training with orders that have heroic and historic names such as the Knights of the Watch or the Order of the Silver Dragon. Through study, martial practice, and adventuring, a squire earns the right to wear armor and bear the weapons of a knight. Orders\nmaintain small keeps on the borderlands, from which they send out atrols, enforce the law, and repel monstrous incursions.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Class Features:"],
			"Detail bodies": ["Fighters such as the knight use tactical cunning to lock down and control enemies, letting their heavy armor and abundant hit points protect them from the worst attacks.",
				"Cloth, leather, hide, chainmail, scale, plate; light shield, heavy shield",
				"Simple melee, military melee, simple ranged, military ranged",
				" ",
				"Choose three from the list of class skills: Athletics (Str), Diplomacy (Cha), Endurance (Con), Heal (Wis), Intimidate (Cha)",
				"Defender Aura, Battle Guardian, Weapon Talent, Shield Finesse, Fighter Stances, Power Strike"
			],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Slayer",
			"Source": "HoFL",
			"Power": "Martial",
			"Role": "Striker",
			"Abilities": ["Strength", "Dexterity"],
			"HP Start": 15,
			"HP": {
				"LVL": 6
			},
			"Fort": 2,
			"Ref": 0,
			"Will": 0,
			"Attack": 1,
			"Surges": 9,
			"Melee": true,
			"Ranged": true,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": true,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 3,
			"Acro": 0,
			"Arca": 0,
			"Athl": 1,
			"Bluf": 0,
			"Dipl": 0,
			"Dung": 0,
			"End": 1,
			"Heal": 1,
			"History": 0,
			"Insight": 0,
			"Intimidate": 1,
			"Nature": 0,
			"Perception": 0,
			"Religion": 0,
			"Stealth": 0,
			"Street": 1,
			"Thievery": 0,
			"Paths": "",
			"Default feat": "",
			"Implements": "",
			"Special": "",
			"Encounter": "",
			"Feats": ["Heroic Slayer: +0 to damage rolls", "Weapon Talent: +1 attack rolls", "Power Strike: Extra 1[W] damage 1/enc"],
			"Description": "When tales are told of the most legendary warriors, slayers are the heroes those stories speak of. Slayers are elite shock troops, standing at the forefront of battle with a combination of strong armor, advanced tactical cunning, and a mastery of withering two-handed weapon attacks. On the borderlands of civilization, the common folk a r e beset on all sides by a\nmultitude of foes. Goblin invaders can outnumber a town's defenders five to one, and powerful giants and trolls can easily shrug off a spear thrust or a crossbow bolt. The slayer is trained to correct this imbalance. By pairing the heaviest melee weapons with fearless combat tactics, a slayer can score deadly blows against larger enemies or hew through mobs of lesser foes. Slayers come from all backgrounds and societies. Some are warriors with only the most basic training, relying on raw fury and instinct to overwhelm their enemies. Others might be former soldiers whose homes have been destroyed like so many others on the borderlands, and who have sworn to use their martial skills for vengeance. The slayer combines the best traits of a defender and a striker, with superior defenses backed by devastating weapon attacks. This class grants heavy armor proficiency and plenty of hit points, making a slayer the ideal warrior to stand at the front line ofbattle.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Class Features:"],
			"Detail bodies": ["Fighters such as the slayer use overwhelming force to take down enemies. The slayer's use of heavy armor and a large amount of hit points allow the slayer to stand in for a defender when the tide of battle requires it.", "Cloth, leather, hide, chainmail, scale", "Proficiencies: Simple melee, military melee, simple ranged, military ranged", " ", "Chooes three from the list of\nclass skills: Athletics (Str), Endurance (Con), Heal (Wis), Intimidate (Cha), Streetwise (Cha) Trained Skills: Three", "Heroic Slayer, Weapon Talent, Fighter Stances, Power Strike"],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Invoker",
			"Source": "PHB2",
			"Power": "Divine",
			"Role": "Controller",
			"Abilities": ["Wisdom", "Constitution", "Inteligence"],
			"HP Start": 10,
			"HP": {
				"LVL": 4
			},
			"Fort": 1,
			"Ref": 1,
			"Will": 1,
			"Attack": 0,
			"Surges": 6,
			"Melee": false,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": true,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 3,
			"Acro": 0,
			"Arca": 1,
			"Athl": 0,
			"Bluf": 0,
			"Dipl": 1,
			"Dung": 0,
			"End": 1,
			"Heal": 0,
			"History": 1,
			"Insight": 1,
			"Intimidate": 1,
			"Nature": 0,
			"Perception": 0,
			"Religion": 3,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Covenant of Preservation", "Covenant of Wrath", "Covenant of Malediction"],
			"Default feat": "Ritual Caster",
			"Implements": ["Rod", "Staff"],
			"Special": "Channel Divinity",
			"Encounter": "",
			"Feats": ["Covenant Manifestation: Divine Enc/day spells on your turn gain", "", "Ritual Casting", "Channel Divinity: Use one ability once/Encounter"],
			"Description": "At the dawn of time, the gods who inhabited the Astral Sea warred with the primordials of the Elemental Chaos, the mighty beings who shaped the world out of formless void. The greatest of the gods’ mortal agents in that war were invokers, imbued with a fragment of the gods’ own might to fight alongside them. No other mortal servant of the gods can claim the same kind of power. Through rites of investiture, avengers, clerics, and paladins gain the ability to manifest echoes of that power, uttering careful prayers and channeling divine energy through their holy symbols. You, however, channel your god’s power directly. No mere symbol can contain it, for you speak the words of creation, shaping the universe to your and your god’s will. Perhaps you were trained in a secret monastery, or you studied in a library where the universe’s oldest lore was preserved. Or perhaps you experienced the presence of your god firsthand and took a shard of divine power into yourself. You might even be an immortal born into flesh, slowly awakening to the awesome divine power that is your birthright. Whatever your past, you are among the gods’ most trusted servants, bound to a covenant in which you swore to use divine power with great care. To what end will you wield that might?",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features:"],
			"Detail bodies": ["You practice an ancient form of divine magic, wielding the power that the gods themselves used in their battle against the primordials.", "Cloth, leather, hide, chainmail", "Simple melee, simple ranged", "Rods, staffs", "Religion, plus three more from the list of class skills: Arcana (Int), Diplomacy (Cha), Endurance (Con), History (Int), Insight (Wis), Intimidate (Cha), Religion (Int)", "Your powers are aimed at controlling your foes: slowing, stopping, or compelling their movement; weakening their attacks; or hedging them in zones of divine fire. You summon angelic beings to face your enemies, and you empower your allies to fight with divine fervor.", "Like clerics, invokers can worship any deity,\nbut few invokers serve gods who are newer arrivals to the pantheon, such as the Raven Queen and Vecna. Invokers dedicated to Bahamut often revere Tiamat as well, worshiping those two gods as the two halves of the slain dragon-god Io. More than most other divine characters, invokers offer prayers to and call on favors from the entire pantheon, for all the gods, whatever their alignments, fought together against the primordials.", "Dwarves and devas make particularly good invokers; both the dwarven devotion to the gods and the devas’ heritage lend themselves to the invoker’s worldview. Ancient and long-lived, eladrin and elves have a racial memory that keeps alive the legends of the first wars between the gods and the primordials, and the two races often follow in the paths of the first invokers. Invokers can be found among all races, however.", "Channel Divinity, Divine Covenant, Ritual Casting"],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Monk",
			"Source": "PHB3",
			"Power": "Psionic",
			"Role": "Striker",
			"Abilities": ["Dexterity", "Strength", "Wisdom"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 1,
			"Ref": 1,
			"Will": 1,
			"Attack": 0,
			"Surges": 7,
			"Melee": false,
			"Ranged": false,
			"Cloth": true,
			"Leather": false,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 4,
			"Acro": 1,
			"Arca": 0,
			"Athl": 1,
			"Bluf": 0,
			"Dipl": 1,
			"Dung": 0,
			"End": 1,
			"Heal": 1,
			"History": 0,
			"Insight": 1,
			"Intimidate": 0,
			"Nature": 0,
			"Perception": 1,
			"Religion": 1,
			"Stealth": 1,
			"Street": 0,
			"Thievery": 1,
			"Paths": ["Centered Breath", "Stone Fist", "Iron Soul"],
			"Default feat": "",
			"Implements": ["Focus", "Staff", "Weapon"],
			"Special": "",
			"Encounter": "",
			"Feats": ["Monastic Tradition", "Unarmored Defense"],
			"Description": "From high in forbidding mountains to deep in the alleys of a city's meanest district, the ascetic warriors known as monks practice their art. By focusing on their minds and bodies, honing both to near perfection, they master a psionic fighting art that allows them to deliver a punch with the force of a giant's club and to absorb attacks as easily as a heavily armored knight. MOIiks tap into the psionic potential that rests within themselves, turning that energy further inward to fortify their bodies and sharpen their minds. Perhaps you set out on this path to put a dark past behind you. Or your village was victimized one time too many by an evil lord or marauding beasts, and you now seek justice. No matter what your motivation, the path of the monk transforms you into a living weapon. The road opens wide before you. With little more than a walking stick and perhaps a satchel of food , you are ready to take on whatever the world can throw at you. Your years of training taught you to turn your eye inward. Now it is time to look outward and test yourself against the world's dangers.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features:"],
			"Detail bodies": ["Your intense focus , constant training, and exceptional talent combine to allow you to harn ess the psionic power within yourself.", "Cloth", "Club, dagger, monk unarmed strike, quarterstaff, shuriken, sling, spear", "Ki focuses, weapons with which you have proficiency", "Choose four from the list of class skills: Acrobatics (Dex), Athletics (Str), Diplomacy (Cha), Endurance (Con), Heal (Wis), InSight (Wis), Perception (Wis), Religion (Int), Stealth (De x), Thievery (Dex)", "You use powers that combine movement with powerful strikes, alloWing you to dart in and out of battle without risking attack from your foes. Compared to other strikers, you are better at taking on small groups of enemies. You hit, move, and fade away before your enemies can respond.", "Bahamut attracts monks who serve as champions of good. Other monks revere Kord, seeing in his battle prowess an example they can aspire to. Contemplative monks devote themselves to loun, seeking to hone their minds and bring their entire beings into balance. A few monks forgo devotion to the gods, preferring to find strength in rigorous adherence to their ascetic principles and the training needed to unlock their psionic powers.", "Humans are the most common monks and master a greater variety of fighting styles than monks of other races. Githzerai society is built around monastic communities, and many members of that race adopt the monk class. Elves are talented monks, since their awareness and agility are both useful tools in 5tudying monastic diSciplines.", "Monastic Tradition, Unarmed Combatant, Unarmored Defense"],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Paladin",
			"Source": "PHB",
			"Power": "Divine",
			"Role": "Defender",
			"Abilities": ["Strength", "Charisma", "Wisdom"],
			"HP Start": 15,
			"HP": {
				"LVL": 6
			},
			"Fort": 1,
			"Ref": 1,
			"Will": 1,
			"Attack": 0,
			"Surges": 10,
			"Melee": true,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": true,
			"Scale": true,
			"Plate": true,
			"Shield": true,
			"Training": 3,
			"Acro": 0,
			"Arca": 0,
			"Athl": 0,
			"Bluf": 0,
			"Dipl": 1,
			"Dung": 0,
			"End": 1,
			"Heal": 1,
			"History": 1,
			"Insight": 1,
			"Intimidate": 1,
			"Nature": 0,
			"Perception": 0,
			"Religion": 3,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Lay on Hands", "Ardent Vow", "Virtue's Touch"],
			"Default feat": "",
			"Implements": "Symbol",
			"Special": " ",
			"Encounter": "Channel Divinity",
			"Feats": ["Channel Divinity", "Divine Mettle", "Divine Strength", "Divine Challenge"],
			"Description": "Paladins are indomitable warriors who’ve pledged their prowess to something greater than themselves. Paladins smite enemies with divine authority, bolster the courage of nearby companions, and radiate as if a beacon of inextinguishable hope. Paladins are transfigured on the field of battle, exemplars of divine ethos in action. To you is given the responsibility to unflinchingly stand before an enemy’s charge, smiting them with your sword while protecting your allies with your sacrifice. Where others waver and wonder, your motivation is pure and simple, and your devotion is your strength. Where others scheme and steal, you take thehigh road, refusing to allow the illusions of temptation  to dissuade you from your obligations.  Take up your blessed sword and sanctified shield, brave warrior, and charge forward to hallowed glory!",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features:", "Channel Divinity", "Divine Challenge", "Lay on Hands"],
			"Detail bodies": ["You are a divine warrior, a crusader and protector of your faith.", "Cloth, leather, hide, chainmail, scale, plate; light shield, heavy shield", "Simple melee, military melee, simple ranged", "Holy symbol", "Religion, plus three more from the list of class skills: Diplomacy (Cha), Endurance (Con), Heal (Wis), History (Int), Insight (Wis), Intimidate (Cha), Religion (Int)", "Like the fighter, you are extremely durable. You wear the best armor available, and your defenses are very high. You can force enemies to fight you rather than your weaker allies by using powers to challenge your enemies. Your ranged attack ability is not very good, but you are very capable in melee.", "Warriors wielding divine power can be found in the service of any deity, even evil or chaotic evil ones. However, the majority of paladins serve good or lawful good deities such as Avandra, Bahamut, Moradin, or Pelor.", "Most paladins are humans or dwarves. These races have strong traditions of pious warriors choosing to devote themselves to divine service. Dragonborn and halfelves make good paladins, too.", "Your armor, your shield, and your weapon are the most important tools of your trade. In addition, you have the following class features.", "Once per encounter you can invoke divine power, filling yourself with the might of your patron deity. With the divine might you invoke you can wield special powers, such as divine mettle and divine strength. Some paladins learn other uses for this feature; for instance, the divinity feats in Chapter 6 grant characters with access to the Channel Divinity class feature the ability to use additional special powers. Regardless of how many different uses for Channel Divinity you know, you can use only one such ability per encounter. The special ability or power you invoke works just like your other powers.", "The challenge of a paladin is filled with divine menace. You can use the divine challenge power to mark an enemy of your choice.", "Using the lay on hands power, paladins can grant their comrades additional resilience with a touch of their hands and a short prayer, though they must give of their own strength to do so.", "Paladin powers are called prayers. In battle, paladins rely on their deities to strengthen their  word-arms and fortify them against the attacks of their enemies."],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Blackguard",
			"Source": "HoS",
			"Power": "Divine",
			"Role": "Striker",
			"Abilities": ["Strength", "Charisma"],
			"HP Start": 15,
			"HP": {
				"LVL": 6
			},
			"Fort": 1,
			"Ref": 1,
			"Will": 1,
			"Attack": 0,
			"Surges": 10,
			"Melee": true,
			"Ranged": true,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": true,
			"Scale": true,
			"Plate": true,
			"Shield": true,
			"Training": 4,
			"Acro": 0,
			"Arca": 1,
			"Athl": 1,
			"Bluf": 1,
			"Dipl": 0,
			"Dung": 0,
			"End": 1,
			"Heal": 0,
			"History": 1,
			"Insight": 0,
			"Intimidate": 1,
			"Nature": 0,
			"Perception": 0,
			"Religion": 1,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 1,
			"Paths": "",
			"Default feat": "",
			"Implements": "Symbol",
			"Special": "",
			"Encounter": "",
			"Feats": "",
			"Description": "Blackguards are shadow warrirors who embrace the power of what most people consider to be a vice or a dark emotion. A blackgaurd's vice becomes a central focus for that individual's divine power. Dominance and fury are among the forces that blackguards cultivate to fuel their might. Because malevolent deities and wicked forces in the cosmos are more likely to hold a vice in esteem most blackguards are villans. Nevertheless, blackguards who cling to higher ideals do exist. A heroic blackguard might be born when a divine soldier who tries to exemplify virtue cannot control his or her anger or some other base emotion. Such blackguards are reffered to as fallen paladins. Other heroic blackguards cleave to a vice that non-evil religion or deity promotes as an asset, or they have learned by necesity to turn their negative tendencies into a divine focus so that they can lead productive lives. The power of vice is alluring because it offers fewer restrictions than virtue does. Though the power comes easily, a blackguard always faces the worst temptations of his or her vice, as well as that of other negative emotions that echo the vice. Scruples can be hard to maintain in the face of such a lure. A truly heroic blackguard can never give in and take the easy path. Heroic blackguards have a hard road to travel. Theirr truly immoral counterparts form orders that actively oppose virtuous knights and cavaliers. Whether or not a specific blackguard is a member of such a dark order, those same knights and cavaliers rarely understand that a person can channel divine power through a vice without becoming debased. The common people rightly fear all blackguards the same way they fear the black knights of legend. A blackguard who uses the divine power of the dreaded vices to combat evil still has difficulty finding a wide array of allies. Her or she rarely enjoys a hero's accolades.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Class Features:"],
			"Detail bodies": ["You are a warrior who focuses divine power through a dark vice. You wield this vice as a weapon, using it to slay any who oppose you.", "Cloth, leather, hide, chainmail, scale, plate; light shield, heacy shield", "Simple melee, miltary melee; simple ranged, military ranged", "Holy Symbol", "Choose three from the list of class skills: Aracana {Int{, Athletics (Str), Bluff (Cha), Endurance (Con), History (Int), Intimidate (Chat), Religion (Int), Thievery (Dex)", "Dark Menace, Spirit of Vice"],
			"Option 1 details": ["Vices", "Each blackgaurd selects one vice to embrace above all others, but only evil blackgaurds embrace all vices as a way of life. These impact certain powers, your allowed alignments, and other details."],
			"Option 1": ["Domination", "Fury"],
			"Opt 1 choices": ["Blackguards of domination demand submission from their enemies. They impose order by force whenever necessary, crushing resistance and making other do their bidding. Surrender on the blackguard's terms is the only hope for any foe. Those who fail to capitulate can expect to be crushed and displayed as a bloody examples of what it means to oppose the blackguard's resolve. In the hands of evil, dominance becomes tyranny. Alignment: You must be unaligned or evil to focus on the vice of domination. Good can confuse the issue of order and authority, and choasi is unacceptable.", "A blackgurad of fury channels raw anger into the violence required for victory. In battle, blackguards of fury are wild killers, impulsive, bloodthirsty, and destructive. They answer every offense or injury with overwhelming retaliation, and their enemies recieve little mercy. Allies can expect a blackguard of fury to rush to the forefront of any armed conflict and to bring foes to ruin as quickly as possible. Evil blackguards of fury allow the vice to rule them entirely, not just on the battlefield. Alignment: You can embrace the vice of fury as long as you are not lawful good. Most heroic blackguards of fury are unaligned. Rage clouds philosophical positions and overshadows peaccable solutions."],
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Cavalier",
			"Source": "HoFK",
			"Power": "Divine",
			"Role": "Defender",
			"Abilities": ["Strength", "Charisma"],
			"HP Start": 15,
			"HP": {
				"LVL": 6
			},
			"Fort": 1,
			"Ref": 1,
			"Will": 1,
			"Attack": 0,
			"Surges": 10,
			"Melee": true,
			"Ranged": true,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": true,
			"Scale": true,
			"Plate": true,
			"Shield": true,
			"Training": 4,
			"Acro": 0,
			"Arca": 0,
			"Athl": 1,
			"Bluf": 0,
			"Dipl": 1,
			"Dung": 0,
			"End": 1,
			"Heal": 1,
			"History": 1,
			"Insight": 1,
			"Intimidate": 1,
			"Nature": 0,
			"Perception": 0,
			"Religion": 1,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Sacrifice", "Valor"],
			"Default feat": "",
			"Implements": "Symbol",
			"Special": "",
			"Encounter": "Holy Smite",
			"Feats": ["Defender Aura", "Holy Smite", "Righteous Radiance", "Righteous Shield"],
			"Description": "A cavalier is a paladin who has embraced one of the heroic virtues, such as compassion, justice, sacrifice, or valor. His or her belief in this virtue is so strong that it manifests as divine magic. Although many cavaliers pledge their faith to the gods, others follow no specific religion. Regardless of one's divine affiliation (or lack thereof), a cavalier's virtue stands paramount. It guides his or her actions, pointing to the best way to protect the ever-flickering light of hope and civilization in the world. Opposing the cavaliers and the virtues that they champion are the blackguards, who embody the dreaded vices that the cavaliers stand against. Where cavaliers embrace compassion, justice, sacrifice, and valor, blackguards epitomize fury, tyranny, greed, and terror. Since the earliest days of history, these two factions have fought each other. Both wander the land, gathering allies and working to further the cause of their virtues or vices. At one time, cavaliers formed into chivalrous orders that were dedicated to the ideal of protecting the civilized realms. The forgotten kingdoms that ruled the\nland relied on cavaliers to help keep the peace. Those cavaliers maintained not only the military security of the land, but also its moral strength. A cavalier might drive off a marauding troll, but she could also mediate a dispute between two farmers, break the power of a corrupt noble, or free a wrongly accused prisoner. As with many things from the time of the forgotten kingdoms, the cavaliers' glory proved fleeting. The kingdoms of old grew weak, and some of their decline could be laid at the feet of cavaliers who strayed from the righteous path. All too often, cavaliers fell victim to the very evils they had sworn to combat. Power corrupts, and in many cases cavaliers served as perfect examples of how power can\ntwist the most resolute heart. The grand orders of cavaliers have long since faded, but their glory is not forgotten. Even as evil casts its shadow across the land, there are those who hear the call to the cavalier's path. Many of the cavaliers of old strayed from their purpose, but that purpose and the power behind it remains strong for those who stay true to it.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Class Features:"],
			"Detail bodies": ["You are a warrior of virtue, a champion of the righteous, and a defender of the weak. With your sword and your faith, you will shield the world from evil.", "Cloth, leather, hide, chainmail, scale, plate; light shield, heavy shield", "Simple melee, military melee; simple ranged, military ranged", "Holy symbols", "Choose four from the list of class skills: Athletics (Str), Diplomacy\n(Cha), Endurance (Con), Heal (Wis), History (Int), Insight (Wis), Intimidate (Cha), Religion (Int)", "Defender Aura, Holy Smite, Righteous Radiance, Righteous Shield, Spirit of Virtue"],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Psion",
			"Source": "PHB3",
			"Power": "Psionic",
			"Role": "Controller",
			"Abilities": ["Inteligence", "Charisma", "Wisdom"],
			"HP Start": 12,
			"HP": {
				"LVL": 4
			},
			"Fort": 0,
			"Ref": 0,
			"Will": 2,
			"Attack": 0,
			"Surges": 6,
			"Melee": false,
			"Ranged": false,
			"Cloth": true,
			"Leather": false,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 4,
			"Acro": 0,
			"Arca": 1,
			"Athl": 0,
			"Bluf": 1,
			"Dipl": 1,
			"Dung": 1,
			"End": 0,
			"Heal": 0,
			"History": 1,
			"Insight": 1,
			"Intimidate": 1,
			"Nature": 0,
			"Perception": 1,
			"Religion": 0,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Telekinesis Focus", "Telepathy Focus", "Shaper Focus"],
			"Default feat": "Ritual Caster",
			"Implements": ["Orb", "Staff"],
			"Special": " ",
			"Encounter": "",
			"Feats": ["Discipline Focus", "Psionic Augmentation", "Power Points"],
			"Description": "Psions are the quintessential manipulators of psionic power. Psions unleash the potential locked within every conscious mind, move objects with just a thought, and assume command of even the least desire of their foes. Psions make manifest their secret wishes when others can only dream. You know the mental pathways that lead to amazing edifices ofaltered reality. You could be a brash human youth flush with your mental ability's first flowering, a tattooed cenobite enrolled in a secret psionic academy, a fey enchanter using ancient techniques to beguile your foes, or perhaps a specially trained inquisitor who has learned one secret too many. A flare of mental energy warms you, the thoughts offriends and foes glitter like stars all about you, and your thoughts themselves are weapons halfsheathed. Ifa god can reshape the world and you can enthrall a god, what does that make you?",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features:"],
			"Detail bodies": ["You direct psionic energy fromwithin your own mind, focusing that power through meditation and contemplation. Your magic works on the minds of others or manifests your will as a physical force in the world.", "Cloth", "Simple melee, simple ranged", "Orbs, staffs", "Choose four from the list of class skills: Arcana (Int), Bluff (Cha), Diplomacy (Cha), Dungeoneering (Wis), History (Int), Insight (Wis), Intimidate (Cha), Perception (Wis)", "Brandishing the might of your mind; You unleash psionic powers against your foes. Your powers allow you to manipulate a foe's mind with telepathic commands and scatter a group of enemies with telekinetic bursts. You can augment your at-will powers by spending power points, providing you more options than nearly any other class has.", "loun, the god of knowledge, Is often considered the patron of psionic magic, and many psions worship her. Telepathic psions who live by tricking their foes often follow Sehanine, and psions who view the practice of psionic magic as an art form pray to Corellon. Other psions choose deities based on Ideals beyond their choice of class: Psions who believe fiercely in justice worship Bahamut, and those who seek to expand the power of civilization worship Erathis, for example. Evil psions (and a few unaligned ones as well) often worship Vecna, the god of secrets.", "Psionic power is most prevalent among humans, who are quick to exploit even a hint of latent psionic talent. However, many fey adventurers use psionics to beguile and bewilder their enemies, and both gnomes and eladrin are commonly telepathic psions. Tieflings, perhaps as an expression of their diabolic heritage, also enjoy manipulating the minds of their foes.", "Discipline Focus, Psionic Augmentation, Ritual Casting"],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": true
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Ranger",
			"Source": "PHB",
			"Power": "Martial",
			"Role": "Striker",
			"Abilities": ["Strength", "Dexterity", "Wisdom"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 1,
			"Ref": 1,
			"Will": 0,
			"Attack": 0,
			"Surges": 6,
			"Melee": true,
			"Ranged": true,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 4,
			"Acro": 1,
			"Arca": 0,
			"Athl": 1,
			"Bluf": 0,
			"Dipl": 0,
			"Dung": 2,
			"End": 1,
			"Heal": 1,
			"History": 0,
			"Insight": 0,
			"Intimidate": 0,
			"Nature": 2,
			"Perception": 1,
			"Religion": 0,
			"Stealth": 1,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Archer Fighting Style", "Two-Blade Fighting Style", "Beast Mastery", "Hunter Fighting Style", "Marauder Fighting Style", "Prime Shot", "Running Attack"],
			"Default feat": "",
			"Implements": "",
			"Special": "",
			"Encounter": "",
			"Feats": ["Fighting Style", "Hunters Quarry"],
			"Description": "Rangers are watchful warriors who roam past the horizon to safeguard a region, a principle, or a way of life. Masters of bow and blade, rangers excel at hit-and-run assaults and can quickly and silently eliminate foes. Rangers lay superb ambushes and excel at avoiding danger. As a ranger, you possess almost supernaturally keen senses and a deep appreciation for untamed wilderness. With your knowledge of the natural world, you are able to track enemies through nearly any landscape, using the smallest clue to set your course, even sometimes the calls and songs of beasts and birds. Your severe demeanor promises a deadly conclusion to any enemy you hunt. When you catch sight of your quarry, will the transgressor perish by swift bow shots from a distance, or by the twofold blades that glint and glitter in each of your battle-scarred hands?",
			"Builds": ["Arhcer Ranger", "Two-Blade Ranger"],
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features:", "Fighting Style", "Hunter’s Quarry", "Prime Shot"],
			"Detail bodies": ["Your talents depend on extensive training and practice, inner confidence, and natural proficiency.", "Cloth, leather, hide", "Simple melee, military melee, simple ranged, military ranged", " ", "Dungeoneering or Nature (your choice), plus four more from the list of class skills: Acrobatics (Dex), Athletics (Str), Dungeoneering (Wis), Endurance (Con), Heal (Wis), Nature (Wis), Perception (Wis), Stealth (Dex)", "You combine fast, hard-hitting melee attack power with excellent ranged attack ability, and shift easily from melee to ranged combat. You are moderately resilient in battle, but you prefer hit-and-run attacks or ambushes to prolonged slugging matches. Hit hard, get out; that’s the ranger’s way.", "Rangers favor deities of nature and of the hunt. They often revere Kord, Melora, or the Raven Queen. Evil or chaotic evil rangers usually worship Gruumsh or Zehir.", "Elves are ideal archer rangers. Humans, halflings, dragonborn, and eladrin are all sometimes drawn to the wandering life of a two-blade ranger.", "Your class features depend largely on the build and fighting style you choose.", "Choose one of the following fighting styles and gain its benefit Archer Fighting Style or Two-Blade Fighting Style.", "Once per turn as a minor action, you can designate the enemy nearest to you as your quarry. Once per round, you deal extra  damage to your quarry. The extra damage is based on your level. If you can make multiple attacks in a round, you decide which attack to apply the extra damage to after all the attacks are rolled. The hunter’s quarry effect remains active until the end of the encounter, until the quarry is defeated, or until you designate a different target as your quarry. You can designate one enemy as your quarry at a time.", "If none of your allies are nearer to your target than you are, you receive a +1 bonus to ranged attack rolls against that target."],
			"Option 1 details": ["Fighting Style", "Choose one of the following fighting styles and gain its benefit."],
			"Option 1": ["Archer Fighting Style", "Two-Blade Fighting Style"],
			"Opt 1 choices": ["Because of your focus on ranged attacks, you gain Defensive Mobility as a bonus feat.", "Because of your focus on two-weapon melee attacks, you can wield a one-handed weapon in your off hand as if it were an off-hand weapon. (Make sure to designate on your character sheet which weapon is main and which is offhand.) In addition, you gain Toughness as a bonus  feat."],
			"Option 2 details": "",
			"Option 2": ["Prime Shot", "Running Attack"],
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Hunter",
			"Source": "HoFK",
			"Power": "Primal",
			"Role": "Controller",
			"Abilities": ["Dexterity", "Wisdom"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 1,
			"Ref": 1,
			"Will": 0,
			"Attack": 1,
			"Surges": 6,
			"Melee": true,
			"Ranged": true,
			"Cloth": true,
			"Leather": true,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 4,
			"Acro": 1,
			"Arca": 0,
			"Athl": 1,
			"Bluf": 0,
			"Dipl": 0,
			"Dung": 2,
			"End": 1,
			"Heal": 1,
			"History": 0,
			"Insight": 0,
			"Intimidate": 0,
			"Nature": 2,
			"Perception": 1,
			"Religion": 0,
			"Stealth": 1,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Bow Hunter", "Crossbow Hunter"],
			"Default feat": "",
			"Implements": "",
			"Special": "",
			"Encounter": "Disruptive Shot",
			"Feats": ["Archery Style", "Aimed Shot", "Clever Shot", "Rapid Shot", "Disruptive Shot", "Aspects of the Wild", "Wilderness Knacks"],
			"Description": "Hunters are the masters of ranged weapons, and they draw on cunning battle tactics to deter their enemies. Reverent allies of the natural world, hunters train in the deep forests and wilderness, tracking down and slaying monsters intent on attacking villages and towns. At the same time, they seek to find harmony with the beneficial creatures of nature, and they learn to dabble in primal power-the magic of nature itself. A hunter is a controller first and foremost, manipulating the battlefield using high-precision ranged attacks. Against single targets, however, a hunter's attacks pack a punch that make it lean toward striker as a secondary role.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Class Features:"],
			"Detail bodies": ["Rangers such as the hunter use their training and skill with ranged weapons as well as a reverence for the natural world to make them champions of the wilderness.", "Cloth, leather", "Simple melee, military melee, simple ranged, military ranged", " ", "Dungeoneering or Nature, plus four more from the list of class skills: Acrobatics (Dex), Athletics (Str), Dungeoneering(Wis), Endurance (Con), Heal (Wis), Nature (Wis), Perception (Wis), Stealth (Dex)", "Archery Style, Expert Archer, Disruptive Shot, Weapon Talent, Aspects of the Wild, Wilderness Knacks"],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Scout",
			"Source": "HoFK",
			"Power": "Martial",
			"Role": "Striker",
			"Abilities": ["Dexterity", "Wisdom"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 1,
			"Ref": 1,
			"Will": 0,
			"Attack": 0,
			"Surges": 7,
			"Melee": true,
			"Ranged": true,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 4,
			"Acro": 1,
			"Arca": 0,
			"Athl": 1,
			"Bluf": 0,
			"Dipl": 0,
			"Dung": 2,
			"End": 1,
			"Heal": 1,
			"History": 0,
			"Insight": 0,
			"Intimidate": 0,
			"Nature": 2,
			"Perception": 1,
			"Religion": 0,
			"Stealth": 1,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Flashing Blade Mastery", "Spinning Blade Mastery"],
			"Default feat": "",
			"Implements": "",
			"Special": "",
			"Encounter": "Power Strike",
			"Feats": ["Two-Weapon Style", "Dual Weapon Attack", "Power Strike", "Aspects of the Wild", "Wilderness Knacks"],
			"Description": "Scouts learn to wield two weapons at once, from the supple combination of longsword and short sword to the brutal double assault of battleaxe and handaxe. This tactic denies the defensive benefit of a shield, but allows a scout to strike hard and fast. At their best when outnumbered and surrounded, scouts count on speed and accuracy in combat to overwhelm their foes. Scouts augment their combat prowess with primal magic, channeling the supernatural power of the natural world to their advantage. Primal power allows a scout to pass by foes unseen, to discourage pursuit, and to keep his or her companions alive in the wild under conditions that would slay lesser explorers outright.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Class Features:"],
			"Detail bodies": ["Rangers such as the scout mix a singular twoweapon combat style with a mastery of primal magic to overwhelm their foes.", "Cloth, leather, hide", "Simple melee, military melee, simple ranged, military ranged", " ", "Dungeoneering or Nature, plus four more from the list of class skills: Acrobatics (Dex), Athletics (Str), Dungeoneering (Wis), Endurance (Con), Heal (Wis), Nature\n(Wis), Perception (Wis), Stealth (Dex)", "Two-Weapon Style, Dual Weapon Attack, Attack Finesse, Power Strike, Aspects of the Wild, Wilderness Knacks"],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Scoundrel",
			"Source": "PHB",
			"Power": "Martial",
			"Role": "Striker",
			"Abilities": ["Dexterity", "Strength"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 0,
			"Ref": 2,
			"Will": 0,
			"Attack": 0,
			"Surges": 6,
			"Melee": false,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 4,
			"Acro": 1,
			"Arca": 0,
			"Athl": 1,
			"Bluf": 1,
			"Dipl": 0,
			"Dung": 1,
			"End": 0,
			"Heal": 0,
			"History": 0,
			"Insight": 1,
			"Intimidate": 1,
			"Nature": 0,
			"Perception": 1,
			"Religion": 0,
			"Stealth": 3,
			"Street": 1,
			"Thievery": 3,
			"Paths": ["Artful Dodger", "Brutal Scoundrel", "Ruthless Ruffian", "Cunning Sneak", "", "Rogue Weapon Talent", "Sharpshooter Talent: Crossbow", "Sharpshooter Talent: Sling"],
			"Default feat": "",
			"Implements": "",
			"Special": "",
			"Encounter": "",
			"Feats": ["Rogue Tactics", "First Strike", "Sneak Attack"],
			"Description": "Rogues are cunning and elusive adversaries. Rogues slip into and out of shadows on a whim, pass anywhere across the field of battle without fear of reprisal, and appear suddenly only to drive home a lethal blade. As a rogue, you might face others’ preconceptions\nregarding your motivations, but your nature is your own to mold. You could be an agent fresh from the deposed king’s shattered intelligence network, an accused criminal on the lam seeking to clear your name, a wiry performer whose goals transcend the theatrical stage, a kid trying to turn around your hardluck story, or a daredevil thrill-seeker who can’t get enough of the adrenaline rush of conflict. Or perhaps you are merely in it for the gold, after all. With a blade up your sleeve and a concealing cloak across your shoulders, you stride forth, eyes alight with anticipation. What worldly wonders and rewards are yours for the taking?",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features:", "First Strike", "Rogue Tactics", "Rogue Weapon Talent", "Sneak Attack"],
			"Detail bodies": ["Your talents depend on extensive training and constant practice, innate skill, and natural coordination.", "Cloth, leather", "Dagger, hand crossbow, shuriken, sling, short sword", " ", "Stealth and Thievery, plus four more from the list of class skills: Acrobatics (Dex), Athletics (Str), Bluff (Cha), Dungeoneering (Wis), Insight (Wis), Intimidate (Cha), Perception (Wis), Stealth (Dex), Streetwise (Cha), Thievery (Dex)", "Combat advantage provides the full benefit of your powers, and a combination of skills and powers helps you gain and keep that advantage over your foes. You are a master of skills, from Stealth and Thievery to Bluff and Acrobatics.", "Rogues prefer deities of the night, luck, freedom, and adventure, such as Sehanine and Avandra. Evil and chaotic evil rogues often favor Lolth or Zehir.", "Those with a love for secrets exchanged in shadows and change for its own sake make ideal rogues, including elves, tieflings, and halflings.", "All rogues share these class features.", "At the start of an encounter, you have combat advantage against any creatures that have not yet acted in that encounter.", "Rogues operate in a variety of ways. Some rogues use their natural charm and cunning trickery to deceive foes. Others rely on brute strength to overcome their enemies. Choose one of the following options. Artful Dodger or Brutal Scoundrel. The choice you make also provides bonuses to certain rogue powers. Individual powers detail the effects (if any) your Rogue Tactics selection has on them.", "When you wield a shuriken, your weapon damage die increases by one size. When you wield a dagger, you gain a +1 bonus to attack rolls.", "Once per round, when you have combat advantage against an enemy and are using a weapon from the light blade, the crossbow, or the sling weapon group, an attack you make against that enemy deals extra damage if the attack hits. You decide whether to apply the extra damage after making the damage roll. As you advance in level, your extra damage increases."],
			"Option 1 details": ["Rogue Tactics", "Rogues operate in a variety of ways. Some rogues use their natural charm and cunning trickery to deceive foes. Others rely on brute strength to overcome their enemies. The choice you make also provides bonuses to certain rogue powers. Individual powers detail the effects (if any) your Rogue Tactics selection has on them."],
			"Option 1": ["Brutal Scoundrel", "Artful Dodger"],
			"Opt 1 choices": ["You gain a bonus to AC equal to your Charisma modifier against opportunity attacks.", "You gain a bonus to Sneak Attack damage equal to your Strength modifier. The choice you make also provides bonuses to certain rogue powers. Individual powers detail the effects (if any) your Rogue Tactics selection has on them."],
			"Option 2 details": "",
			"Option 2": ["Rogue Weapon Talent", "Sharpshooter Talent: Crossbow", "Sharpshooter Talent: Sling"],
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Thief",
			"Source": "HoFL",
			"Power": "Martial",
			"Role": "Striker",
			"Abilities": ["Dexterity", "Strength", "Charisma"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 0,
			"Ref": 2,
			"Will": 0,
			"Attack": 0,
			"Surges": 6,
			"Melee": false,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 4,
			"Acro": 1,
			"Arca": 0,
			"Athl": 1,
			"Bluf": 1,
			"Dipl": 0,
			"Dung": 1,
			"End": 0,
			"Heal": 0,
			"History": 0,
			"Insight": 1,
			"Intimidate": 1,
			"Nature": 0,
			"Perception": 1,
			"Religion": 0,
			"Stealth": 3,
			"Street": 1,
			"Thievery": 3,
			"Paths": "",
			"Default feat": "",
			"Implements": "",
			"Special": "",
			"Encounter": "",
			"Feats": ["Sneak Attack", "Backstab", "Weapon Finesse:"],
			"Description": "A thief specializes in agility and trickery, using hard-earned skills to pilfer and hide, escape from tight situations, and overcome deadly traps. A thief has powerful combat abilities, but relies first and foremost on circumventing an enemy's defenses through acrobatics and stealth. Brute strength and arcane power have their uses, but a thief's quick reflexes and agile touch can get the drop on enemies before they know what hit them. Most thief adventurers are explorers and treasure hunters, keen on delving into long-forgotten ruins in the hope of finding valuable lore, treasure, or magic. Many thieves learn their skills on the streets or as unapologetic criminals. However, such characters often develop noble intentions, choosing to steal only from t h e wealthy or from those in need of being taught a lesson. After all, sometimes bad guys make the best good guys.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Class Features:"],
			"Detail bodies": ["Your quick wits and mastery of stealth let you slip past your enemies to strike when they least expect it. You do your best work when teamed with a defender or another striker to flank enemies.", "Cloth, leather", "Dagger, hand crossbow, shortbow, short sword, sling", " ", "Stealth and Thievery, plus four more from the list of class skills: Acrobatics (Dex), Athletics\n(Str), Bluff (Cha), Dungeoneering (Wis), Insight (Wis), Intimidate (Cha), Perception (Wis), Stealth (Dex), Streetwise (Cha), Thievery (Dex)", "Sneak Attack, Backstab, Weapon Finesse, First Strike, Roque's Trick"],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Runepriest",
			"Source": "PHB3",
			"Power": "Divine",
			"Role": "Leader",
			"Abilities": ["Strength", "Constitution", "Wisdom"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 0,
			"Ref": 0,
			"Will": 2,
			"Attack": 0,
			"Surges": 7,
			"Melee": false,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": true,
			"Scale": true,
			"Plate": false,
			"Shield": false,
			"Training": 3,
			"Acro": 0,
			"Arca": 1,
			"Athl": 1,
			"Bluf": 0,
			"Dipl": 0,
			"Dung": 0,
			"End": 1,
			"Heal": 1,
			"History": 1,
			"Insight": 1,
			"Intimidate": 0,
			"Nature": 0,
			"Perception": 0,
			"Religion": 3,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 1,
			"Paths": ["Defiant Word", "Wrathful Hammer"],
			"Default feat": "",
			"Implements": "",
			"Special": "Rune of Mending",
			"Encounter": "",
			"Feats": ["Rune Master", "Destruction", "Protection", "Rune of Mending:", "Destruction", "Protection", "Runic Artistry"],
			"Description": "Isolated in sacred forges and holy libraries, runepriests seek to unlock the secrets ofthe runes ofdivine power. Legend holds that the gods crafted a set ofpowerful runes, each imbued with a core of divine power, to help create the world and give it order. During the long war against the primordials, many ofthese runes were lost. Even the gods only dimly recall the runes of power. Somewhere in the forgotten depths ofa dungeon or the isolated corner ofthe planes, those ancient runes wait to be discovered. A runepriest can learn much in the peaceful halls ofa temple. but sooner or later he or she must put on armor and go forth to find or create a new rune, and in so doing earn a name among the masters ofrune magic. You learned the art ofrune smithing from your master. Perhaps you sweated over a forge deep within a dwarven stronghold , crafting weapons and armor for the faithful as part ofyour apprenticeship. Or you might have helped inscribe runes in the living wood ofthe forest. crafting signs to warn of approaching enemies. Along the way, you learned how to take inscribed runes and turn them into words and signs of power that you can incorporate into your prayers. But now, the time for learning is at an end. Now is the time for adventure. Merge the runes of power with your weapons and armor. Call to the gods and channel their might against your enemies. The runes are your weapons, and the gods' foes await your judgment.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features:"],
			"Detail bodies": ["You are a master of divine runes, a powerful alphabet that formed the basis of the gods' power. Other runic structures exist, but you have mastered the runes of the gods.", "Cloth, leather, hide, chainmail, scale; light shield", "Simple melee, simp.le ranged", " ", "Religion, plus three more from the list of class skills: Arcana (Int), Athletics (Str), Endurance (Con), Heal (Wis), History (Int), Insight (Wis), Religion (Int). Thievery (Dex)", "You use melee attacks to harass your enemies and leave them vulnerable to your allies' attacks. With your heavy armor and your ability to heal, you are ideally suited for standing on the front line.", "Runepriests are found among the followers of all the gods, but they most commonly worship Corellon, Erathis, loun, or Moradin. Moradin is a patron of smiths and other artisans who seek to master a craft. Many runepriests create fine goods as they practice thei!' ability to forge runes. Corellon attracts runepriests who view the inscribing of runes as an art. loun values the protective aspects of rune magic and the knowledge contained in the runes. Erathis favors inventors and others who seek knowledge, a perfect match for runepriests who seek to uncover or create new runes.", "Deva runepriests favor the way of the Defiant Word and create beautiful illuminated manuscripts of religiOUS lore. bUilding libraries that grow for generations in hidden corners of the Astral Sea. Elf runepriests also embrace this path. tending trees and other plants to grow in runic patterns to honor the gods. Dwarves. minotaurs. and goliaths commonly follow the path of the Wrathful Hammer. In great caverns. divine runes decorate dwarven chapels as well as secluded minotaur shrines. Goliath runepriests carve massive runes atop their holy peaks. marking the territory as warded by the gods and serving as landmarks for their people as they migrate from one mountain to the next.", "Rune Master. rune of mending. Runic Artistry"],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Seeker",
			"Source": "PHB3",
			"Power": "Martial",
			"Role": "Striker",
			"Abilities": ["Wisdom", "Strength", "Dexterity"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 0,
			"Ref": 1,
			"Will": 1,
			"Attack": 0,
			"Surges": 7,
			"Melee": false,
			"Ranged": true,
			"Cloth": true,
			"Leather": true,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 3,
			"Acro": 1,
			"Arca": 0,
			"Athl": 1,
			"Bluf": 0,
			"Dipl": 0,
			"Dung": 0,
			"End": 1,
			"Heal": 1,
			"History": 0,
			"Insight": 1,
			"Intimidate": 1,
			"Nature": 3,
			"Perception": 1,
			"Religion": 0,
			"Stealth": 1,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Bloodbond", "Spiritbond"],
			"Default feat": "",
			"Implements": "",
			"Special": "",
			"Encounter": "",
			"Feats": ["Inevitable Shot", "Seeker's Bond"],
			"Description": "Seekers are primal champions who scour the wilderness in search of those who would defile it. Versed in hunting techniques handed down through the generations, seekers combine thrown weapon and bow techniques with primal evocations. The combination allows seekers great range in which to deliver deadly attacks that confound and hamper their enemies. When a seeker looses a missile, the primal spirits bound to it through ancient evocations are freed , sometimes as terrifying beasts and sometimes as nature's raw destructive potential. As a seeker, you are both a hunter and a mystic. You attune yourselfto the wilderness you call your home, but you are equally tied to the spirits that dwell in the world around you. With your people's traditions and whispered advice from the spirits, you navigate the wilds with ease, at home in that environment as any beast. If an enemy appears, you have nothing to fear, both because you have mastered your weapons and because the spirits to whom you have bound yourself add their savage might to your attacks. Whether you use lightning strikes, grasping vines, or spectral beasts, your enemies cannot stand against your assault.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features:"],
			"Detail bodies": ["Through ancient ceremonies and whispered evocations, you call on primal spirits to lend their might to your cause.", "Cloth, leather", "Simple melee, simple ranged, military ranged", " ", "Nature, plus three more from the list of class skills: Acrobatics (Dex), Athletics (Str), Endurance (Con), Heal (Wis), Insight (Wis), Intimidate (Cha), Nature (Wis), Perception (Wis), Stealth (Dex)", "Your arrows or thrown weapons loose primal power when used. They might manifest as primal spirits hungering for revenge or as icy winds or crackling lightning. Your powers control your enemies, interfering with their movement, holding them in place, or injuring them for their actions. Also, your attacks might call forth spirits to worry your enemies and pursue them across the battlefield.", "like other primal characters, seekers view the world's primal spirits as kindred and partners, and they venerate them more than they worship the gods. Seekers who do follow deities commonly worship Melora for her dominion over the forces of nature, Corellon (who is sometimes depicted as the founder of archery), Kord, or Sehanine. Evil seekers sometimes follow Gruumsh or Zehir.", "Elves and shifters are the most common seekers, since both their natural inclinations toward primal paths and their inherent abilities make them well matched with the capabilities of the class. Goliaths who favor ranged combat sometimes become seekers (preferring thrown weapons over bows or crossbows), and wilden seekers are also fairly common.", "Inevitable shot, Seeker's Bond"],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Shaman",
			"Source": "PHB2",
			"Power": "Primal",
			"Role": "Leader",
			"Abilities": ["Wisdom", "Constitution", "Intelligence"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 1,
			"Ref": 0,
			"Will": 1,
			"Attack": 0,
			"Surges": 7,
			"Melee": false,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 3,
			"Acro": 0,
			"Arca": 1,
			"Athl": 1,
			"Bluf": 0,
			"Dipl": 0,
			"Dung": 0,
			"End": 1,
			"Heal": 1,
			"History": 1,
			"Insight": 1,
			"Intimidate": 0,
			"Nature": 3,
			"Perception": 1,
			"Religion": 1,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Protector Spirit", "Stalker Spirit", "Watcher Spirit", "World Speaker Spirit", "Elemental Spirit"],
			"Default feat": "",
			"Implements": "Totem",
			"Special": "",
			"Encounter": "Healing Spirit",
			"Feats": ["Speak with Spirits", "Companion Spirit", "Spirit Boon", "Healing Spirit"],
			"Description": "Shamans are inspiring and dangerous battle leaders. They command powerful spirit guides, and through them lead their allies. These nature spirits bolster their allies’ attacks and offer protection and healing when needed. In a rite of passage or initiation, you pledged yourself to the spirits, to be their voice and hands in the world. Through ancient song and sacred ceremony, you have called a powerful spirit companion to your side. The primal spirits of nature affirm your will, guide the actions of your allies, and deal mighty attacks against your foes. You might be a venerable advisor to a tribal leader, a young traveler seeking to bring tales of a wider world back to your people, or a scholar devoted to the pursuit of nearly forgotten lore. The spirits and voices of nature guide your every step. Their power flows through you, calling you to lead, to fight, and to triumph.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features:"],
			"Detail bodies": ["The spirits of the natural world give you power and manifest on your behalf.", "Cloth, leather", "Simple melee, longspear", "Totems", "Nature, plus three more from the list of class skills: Arcana (Int), Athletics (Str), Endurance (Con), Heal (Wis), History (Int), Insight (Wis), Nature (Wis), Perception (Wis), Religion (Int)", "You lead your adventuring party from a position of relative safety, sending your spirit companion to the front of the battle while you linger behind. Your powers fall into two broad categories: melee attacks yourspirit companion makes, and ranged attacks. Your daily powers include a number of conjurations and zones, representing your ability to call on additional spirits for aid.", "Shamans draw their power from the primal power source and therefore don’t usually worship gods. They view themselves as agents—not servants or masters— of the spirits of nature and instruct others how tolive their lives in harmony with those spirits. Like druids,  shamans call on the spirits to witness significant events but don’t worship them.", "Elves, humans, and shifters are the most common shamans, putting their high Wisdom and innate connection to nature to good use in this class. Dwarves make excellent bear shamans, and devas excel as panther shamans.", "Companion Spirit, healing spirit, speak with spirits"],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Sorcerer",
			"Source": "PHB2",
			"Power": "Arcane",
			"Role": "Striker",
			"Abilities": ["Charisma", "Dexterity", "Strength"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 0,
			"Ref": 0,
			"Will": 2,
			"Attack": 0,
			"Surges": 6,
			"Melee": false,
			"Ranged": false,
			"Cloth": true,
			"Leather": false,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 3,
			"Acro": 0,
			"Arca": 3,
			"Athl": 1,
			"Bluf": 1,
			"Dipl": 1,
			"Dung": 1,
			"End": 1,
			"Heal": 0,
			"History": 1,
			"Insight": 1,
			"Intimidate": 1,
			"Nature": 1,
			"Perception": 0,
			"Religion": 0,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Dragon Magic", "Wild Magic", "Cosmic Magic", "Storm Magic"],
			"Default feat": "",
			"Implements": "Staff",
			"Special": "",
			"Encounter": "",
			"Feats": "",
			"Description": "The sorcerer is the arcane antithesis of the wizard. Wielding raw, barely contained magical power, sorcerers channel bursts and blasts of arcane energy through their bodies. They gain their power not through rigorous study of esoteric tomes, but by harnessing magic in their blood, waiting to be tapped and shaped. If wizards wield magic as fighters wield swords, a sorcerer’s magic is the arcing greataxe of a raging barbarian. You might be a proud dragonborn scion of ancient Arkhosia, calling on the draconic power of your heritage, or perhaps you were bathed in dragon blood as an infant to fill you with that power. You might have been born in a place where planar forces converged in strange eddies, infusing you with chaos, or perhaps you survived implantation of a slaad embryo, which left the taint of chaos upon you. Magic pulses through your veins, calling on you to give it expression. As it grows ever stronger, will it consume you or transform you into magic incarnate?",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features:"],
			"Detail bodies": ["Arcane magic is in your blood, as a touch of either ancient draconic power or untamed chaos energy, and you unleash it through sheer force of will and physical discipline.", "Cloth", "Simple melee, simple ranged", "Daggers, staffs", "Arcana, plus three more from the list of class skills: Arcana (Int), Athletics (Str), Bluff (Cha),  Diplomacy  (Cha), Dungeoneering (Wis), Endurance (Con), History (Int), Insight (Wis), Intimidate (Cha), Nature (Wis)", "As an arcane striker, you have a resemblance to the warlock. However, more of your powers create bursts or blasts of elemental forces to damage multiple foes, and your magic is the result of powerful arcane forces in your blood rather than the result of pacts you have made with mysterious entities.", "If the diverse lot of sorcerers has one quality in common, it’s a high opinion of themselves. Many sorcerers dream of becoming gods one day, and the majority find it hard to supplicate any being more powerful than themselves. That said, dragon sorcerers often nod to Bahamut or Tiamat, and some chaos sorcerers\nacknowledge Avandra, Corellon, and Sehanine for their inclinations toward wild magic.", "Dragonborn are the iconic dragon sorcerers, giving arcane expression to the draconic blood that flows in their veins. Half-elves are also often dragon sorcerers. Halflings and drow make excellent chaos sorcerers. Gnomes and tieflings are often sorcerers as well.", "Spell Source"],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Elementalist",
			"Source": "HoEC",
			"Power": "Arcane",
			"Role": "Striker",
			"Abilities": ["Charisma", "Constitution"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 0,
			"Ref": 0,
			"Will": 2,
			"Attack": 0,
			"Surges": 6,
			"Melee": false,
			"Ranged": false,
			"Cloth": true,
			"Leather": false,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 3,
			"Acro": 0,
			"Arca": 3,
			"Athl": 1,
			"Bluf": 1,
			"Dipl": 1,
			"Dung": 1,
			"End": 1,
			"Heal": 0,
			"History": 1,
			"Insight": 1,
			"Intimidate": 1,
			"Nature": 1,
			"Perception": 0,
			"Religion": 0,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": "",
			"Default feat": "",
			"Implements": ["Dagger", "Staff"],
			"Special": "",
			"Encounter": "",
			"Feats": ["Elemental Bolt", "Elemental Magic", "Elemental Specialty", "Escalating Elements"],
			"Description": "",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Class Features:"],
			"Detail bodies": ["Elementalists who specialize in air or fire magic scour their foes with destructive energy, hurling blasts of flame or bolts of lightning. Those who specialize in earth or water magic hinder enemies, catching them in tides and quakes. Few can withstand an elementalist's wrath for long.Elementalists who specialize in air or fire magic scour their foes with destructive energy, hurling blasts of flame or bolts of lightning. Those who specialize in earth or water magic hinder enemies, catching them in tides and quakes. Few can withstand an elementalist's wrath for long.", "Cloth", "Simple melee, simple ranged", "Daggers, staffs", "Arcana, plus three more from the list of class skills: Arcana (lnt), Athletics (Str), Bluff (Cha}, Diplomacy (Cha), Dungeoneering (Wis}, Endurance (Con), History (lnt), Insight (Wis}, Intimidate (Cha}, Nature (Wis}", "Elemental Bolt, Elemental Magic, Elemental Specialty, Escalating Elements"],
			"Option 1 details": ["Elemental Specialty: ", "The most important step in a novice elementalist's early days is realizing his or her favored element: air, earth, fire, or water. Your specialty shapes your identity as an elementalist, and it strongly influences other choices you make throughout your career. Benefit: Choose an elemental specialty. You gain the benefits of that specialty."],
			"Option 1": ["Air Elementalist", "Earth Elementalist", "Fire Elementalist", "Water Elementalist"],
			"Opt 1 choices": ["You wield the howl of the storm. Wild gales and raging lightning are your weapons. With time and experience, you master powers of weather and flight. You dislike spending too much time with a roof over your head; you are most comfortable in wide-open spaces and in high places, where the winds are strong and free. Air elementalists generally dislike wielding spells of elemental earth. Elemental air is the essence of movement and change. Earth feels too immobile and inflexible to an air elementalist. experience, you develop the ability to shape the earth ~ around you or even pass through solid rock. ...J Benefit: You gain the following features. Attack Power: You gain either the howling zephyr or the static charge power (see page 90). Enhanced Elemental Bolt: Your elemental bolt deals lightning damage. On a hit, its target gains vulnerable 3 to your elemental attacks until the end of your next turn. Elemental Soul: At 5th level, you gain resist 10 lightning. At 15th level, you gain a +2 bonus to saving throws against ongoing lightning damage. At 25th level, choose either cold or thunder. You gain resist 10 to the chosen damage type and a + 2 bonus to saving throws against ongoing damage of that type. Fly: At 23rd level, you can fly up to half your speed as a move action.", "You are a master of the solid and unyielding powers of elemental earth. At your command, stone armors your body, and rock and earth erupt from the ground or materialize from\nthin air to batter or bury your enemies. As you gain experience, you develop the ability to shape the earth around you or even pass through solid rock. Elemental air is the antithesis of earth, so you probably dislike learning spells of air. That element lacks solidity, substance, and permanence-the very qualities that lend you power over elemental earth. Benefit: You gain the following features. Attack Power: You gain either the erupting earth or the seismic shock power (see page 90). Enhanced Elemental Bolt: Your elemental bolt deals acid damage. On a hit, its target is slowed until the end of your next turn. Elemental Soul: At 5th level, you gain resist 10 acid. At 15th level, you gain a +2 bonus to saving throws against ongoing acid damage. At 25th level, choose either fire or thunder. You gain resist 10 to the chosen damage type and a + 2 bonus to saving throws against ongoing damage of that type. Burrow: At 23rd level, you can burrow up to half your speed as a move action. You have tremorsense 5 while burrowing.", "You are a living conflagration, a master of the most spectacular and destructive\nof all the elements. Yours is the power of the raging forest fire, the burning sun, and incinerating heat. Subtlety is not your strong suit; in battle you seek to burn down all who oppose you. Fire elementalists tend to disdain powers of elemental water, which is often calming and cooling. Benefit: You gain the following features. Attack Power: You gain either the blazina cloud or the ianition power (see page 90). Enhanced Elemental Bolt: Your elemental bolt deals fire damage. On a hit, its damage increases by ld6. Elemental Soul: At 5th level, you gain resist 10 fire. At 15th level, you gain a +2 bonus to saving throws against ongoing fire damage. At 25th level, choose either lightning or thunder. You gain resist 10 to the chosen\ndamage type and a + 2 bonus to saving throws against ongoing damage of that type. Teleport: At 23rd level, you can teleport up to half your speed as a move action.", "You command the most subtle and mutable of the four elements. Water transforms easily to ice, mist, and steam. In the form of a gentle rain it nourishes and sustains, but as a raging flood it can scour channels through solid rock and sweep away all before it. You are especially drawn to water in motion-the ocean with its pounding surf and seething tides, and rivers and streams as they wind their way across the land to the sea. You likely prefer not to use fire powers. That element burns the moisture from all it touches. Benefit: You gain the following features.\nAttack Power: You gain either the deluae or the ice prison power (see page 90). Enhanced Elemental Bolt: Your elemental bolt deals' cold damage. On a hit, you can slide each creature adjacent to its target 1 square. Elemental Soul: At 5th level, you gain resist 10 cold. At 15th level, you gain a + 2 bonus to saving throws against ongoing cold damage. At 25th level, choose\neither acid or thunder. You gain resist 10 to the chosen damage type and a +2 bonus to saving throws against ongoing damage of that type. Swim: At 23rd level, you gain a swim speed equal to your speed+ 2. You also gain the aquatic trait; you can breathe underwater, and in aquatic combat, you gain a + 2 bonus to attack rolls against nonaquatic creatures."],
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Swordmage",
			"Source": "FRPG",
			"Power": "Arcane",
			"Role": "Defender",
			"Abilities": ["Charisma", "Dexterity", "Intelligence"],
			"HP Start": 15,
			"HP": {
				"LVL": 6
			},
			"Fort": 0,
			"Ref": 0,
			"Will": 2,
			"Attack": 0,
			"Surges": 8,
			"Melee": true,
			"Ranged": true,
			"Cloth": true,
			"Leather": true,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 3,
			"Acro": 0,
			"Arca": 3,
			"Athl": 1,
			"Bluf": 0,
			"Dipl": 1,
			"Dung": 0,
			"End": 1,
			"Heal": 0,
			"History": 1,
			"Insight": 1,
			"Intimidate": 1,
			"Nature": 0,
			"Perception": 0,
			"Religion": 0,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Aegis of Assault", "Aegis of Shielding", "Aegis of Ensnarement"],
			"Default feat": "",
			"Implements": "Weapon",
			"Special": "",
			"Encounter": "",
			"Feats": ["Swordbond", "Swordmage Warding", "Swordmage Aegis"],
			"Description": "Swordmages apply the arcane arts to melee combat. The combat skills they possess are enhanced by the magic they wield. The flourish of a swordmage’s blade not only bites with steel, but also with fire, lightning, or other powerful forces. You studied and practiced for years to master your skills. You mastered the fundamentals of arcane magic and combined this academic study with endless hours of physical training. You might be a young eladrin in search of your fortune, a stranger to the wider world outside the seclusion of your homeland; a self-trained genasi sellsword, gifted with an affinity for elemental magic; the scion of a disgraced noble human family, taught by the finest tutors in your youth but now a footloose xpatriate; or a half-elf arcane champion, rigorously trained in a war magic academy to serve in the armies of your homeland. Magical barriers of force swirl around you, protecting you from harm. The blade you carry is an extension of your being, both body and mind. It pulses with eldritch energy as you prepare to defend your allies and unleash magical fury against your foes.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features:"],
			"Detail bodies": ["You study ancient magical traditions and practice swordplay, developing arcane powers that work well with your physical attacks.", "Cloth, leather", "Simple melee, military light blades, military heavy blades, simple ranged", "Any light blade or heavy blade. Your blade adds its enhancement bonus to attack rolls and damage rolls and any extra damage granted by a property (if applicable) when used as an implement. You do not gain your weapon proficiency bonus to the attack roll when using your blade as an implement.", "Arcana, plus three more from the list of class skills: Arcana (Int), Athletics (Str), Diplomacy (Cha), Endurance (Con), History (Int), Insight (Wis), Intimidate (Cha)", "Your melee skills are most important, but you also have attacks that can hit multiple creatures or injure creatures at range. Your defensive powers can protect your allies and yourself.", "Swordmages favor deities of magic or skill. Corellon, Selûne, Torm, and Tymora are common among swordmages of good heart. Swordmages of a darker bent often revere Shar, regarding their usual skills as a secret art to be kept hidden from the uninitiated.", "Genasi from Returned Abeir are the archetypal assault swordmages. Humans and eladrin are the main practitioners of the shielding swordmage style. Githyanki are also known to practice their own swordmage tradition, which is similar to the shielding swordmage.", "Swordbond, Swordmage Aegis (aegis of assault or aegis of shielding), Swordmage Warding"],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Vampire",
			"Source": "HoS",
			"Power": "Shadow",
			"Role": "Striker",
			"Abilities": ["Dexterity", "Charisma"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 1,
			"Ref": 0,
			"Will": 1,
			"Attack": 0,
			"Surges": 2,
			"Melee": false,
			"Ranged": false,
			"Cloth": true,
			"Leather": false,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 4,
			"Acro": 1,
			"Arca": 1,
			"Athl": 1,
			"Bluf": 1,
			"Dipl": 1,
			"Dung": 0,
			"End": 0,
			"Heal": 0,
			"History": 1,
			"Insight": 0,
			"Intimidate": 1,
			"Nature": 0,
			"Perception": 1,
			"Religion": 1,
			"Stealth": 1,
			"Street": 0,
			"Thievery": 1,
			"Paths": "",
			"Default feat": "",
			"Implements": ["Symbol", "Focus"],
			"Special": "",
			"Encounter": "",
			"Feats": "",
			"Description": "You are a monster, fated and infected by a vile curse that transformed YOll into a creature of nightmare . Normal emotions have become alien to you. Only cold , gJl awing hunger remains. Most of those who become vampires are victims of monstrous attacks, created by a callous hunter who drained them dry ofblood and life force, then cast them aside. Others seek out this path from their own fear ofinArmity and death. discovering the arcane rites and alchemical formulas that promise dark power. In some cases, a character finds his or her vampirism invoked by an anc ient family curse, or that he or she is a member of an extended clan of vampires who pass their hlood down to those they deem worthy-whether by choice or not. Vv'h atever their origins, vampire characters are not slaves to their creators. Even those beholden to an older vampire rctain free will. and have a chance to avoid sinking into the bestial depravity so common among their kind. Vampire characters are the most exccptional examples of those wbo carry this dark curse, using tJ1eir powers not solely for murder and personal gain. Some become the greatest of heroes, but even those vampires are aware that few among the Common folk have the ability to see past the frightening reality of their dark nature. Avoiding the scrutiny of superstitious folk and disguising his or her needs and abilities serves a vam.pire best. Trusted companions. enemies to slay and feast upon, and reasons to avoid civilized areas for extended times make an adventuring life the perfect chioce for shuch characters.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Class Features:"],
			"Detail bodies": ["Infused with the power of darkness and having already experienced death, you are a leathal creature of the night.", "Cloth", "Simple melee, simple ranged", "Holy Symbols, Ki Focuses", "Choose four from the list of class skills: Acrobatics (Dex), Aracana (Int), Athletics (Str), Bluff (Cha), Diplomacy (Cha), History (Int), Intimidate (Cha), Perception (Wis), Religion (Int), Stealth (Dex), Thievery (Dex)", "Blood is Life, Enduring Soul, Hidden Might, Vampiric Reflexes"],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Warden",
			"Source": "PHB2",
			"Power": "Primal",
			"Role": "Defender",
			"Abilities": ["Strength", "Intelligence", "Charisma"],
			"HP Start": 17,
			"HP": {
				"LVL": 7
			},
			"Fort": 1,
			"Ref": 0,
			"Will": 1,
			"Attack": 0,
			"Surges": 9,
			"Melee": true,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": true,
			"Training": 3,
			"Acro": 0,
			"Arca": 0,
			"Athl": 1,
			"Bluf": 0,
			"Dipl": 0,
			"Dung": 1,
			"End": 1,
			"Heal": 1,
			"History": 0,
			"Insight": 0,
			"Intimidate": 1,
			"Nature": 3,
			"Perception": 1,
			"Religion": 0,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Earthstrength", "Wildblood", "Lifespirit", "Stormheart"],
			"Default feat": "",
			"Implements": "",
			"Special": "",
			"Encounter": "",
			"Feats": ["Font of Life", "Guardian Might", "Nature's Wrath"],
			"Description": "As mountains stand fast against the buffeting wind and trees bend but do not break in the storm, wardens are stalwart protectors who draw on the primal spirits of nature to defend the natural world from those who would corrupt or destroy it. Some wardens use the power of earth and stone to shield their allies from harm, whereas others summon the primal strength within themselves to increase their ferocity and tenacity. As a warden, you might be the staunch defender of a tribe, chosen by the spirits to be your people’s champion. Perhaps you were visited by spirits at a sacred grove and charged with protecting it against a spreading corruption. You might have been raised by a bear or nurtured by dryads, chosen from infancy to stand fast against nature’s enemies. Primal power waits in the ground beneath your feet, surges with every beat of your heart, and flows through your lungs with every breath. The world cries out to you, calling for a champion to defend it. Will you heed its call?",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features:"],
			"Detail bodies": ["You are a primal champion, a guardian of the natural world and custodian of all living things.", "Cloth, leather, hide; light shield, heavy shield", "Simple melee, military melee, simple ranged", " ", "Nature, plus three more from the list of class skills: Athletics (Str), Dungeoneering (Wis), Endurance (Con), Heal (Wis), Intimidate (Cha),\nNature (Wis), Perception (Wis)", "Boasting more hit points than most other characters of your level, you sometimes stand up to your foes by staunchly taking whatever punishment they throw at you. Thanks to the primal power coursing through you, you can throw it right back at them, manipulating the earth around you or altering your own form to hinder and punish your foes.", "Like other primal classes, wardens generally disdain worship of the gods, which they view as interlopers in the natural world. Instead, they live in harmony with the spirits of beasts, trees, and stone that infuse the world. Some wardens, though, acknowledge some gods as peaceful partners of the primal spirits and look kindly upon such deities as Melora, Corellon, Kord, Moradin, and Pelor.", "Goliaths make ideal earth wardens, combining natural strength and endurance with a love of earth and stone. Longtooth shifters embody the ideals of the wild warden, channeling the beast within as a manifestation of the primal spirits. Humans, dwarves, dragonborn, and half-orcs are also commonly wardens.", "Font of Life, Guardian Might, Nature’s Wrath"],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Warlock",
			"Source": "PHB",
			"Power": "Arcane",
			"Role": "Striker",
			"Abilities": ["Charisma", "Constitution", "Intelligence"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 0,
			"Ref": 1,
			"Will": 1,
			"Attack": 0,
			"Surges": 6,
			"Melee": false,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 4,
			"Acro": 0,
			"Arca": 1,
			"Athl": 0,
			"Bluf": 1,
			"Dipl": 0,
			"Dung": 0,
			"End": 0,
			"Heal": 0,
			"History": 1,
			"Insight": 1,
			"Intimidate": 1,
			"Nature": 0,
			"Perception": 0,
			"Religion": 1,
			"Stealth": 0,
			"Street": 1,
			"Thievery": 1,
			"Paths": ["Fey Pact", "Infernal Pact", "Star Pact", "Dark Pact", "Vestige Pact"],
			"Default feat": "",
			"Implements": ["Rod", "Totem"],
			"Special": "",
			"Encounter": "",
			"Feats": ["Eldritch Blast", "Eldritch Pact", "Prime Shot", "Shadow Walk", "Warlock's Curse"],
			"Description": "Warlocks channel arcane might wrested from primeval entities. They commune with infernal intelligencesand fey spirits, scour enemies with potent blasts of  eldritch power, and bedevil foes with hexing curses. Armed with esoteric secrets and dangerous lore, warlocks are clever and resourceful foes.However you came to your arcane knowledge, you need not accept the poor reputation warlocks sometimes endure. You could be a libram-toting scholar captivated by ominous lore, a foot-loose wanderer searching for elusive ultimate truths, a devil-touched hunter using infernal spells to eliminate evil, or even a black-clad mercenary who uses sinister trappings to discourage prying strangers and unwanted attention. On the other hand, you could be a true diabolist using\nyour gifts to tyrannize the weak—some warlocks unfortunately are exactly that. The pacts are complete. The rites have concluded. The signs are drawn in blood, and the seals are broken. Your destiny beckons.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features:", "Eldritch Blast", "Eldritch Pact", "Prime Shot", "Shadow Walk", "Warlock’s Curse"],
			"Detail bodies": ["You gain your magical power from a pact you forge with a powerful, supernatural force or an unnamed entity.", "Cloth, leather", "Simple melee, simple ranged", "Rods, wands", "Choose four from the list of class skills: Arcana (Int), Bluff (Cha), History (Int), Insight (Wis), Intimidate (Cha),  Religion (Int), Streetwise (Cha), Thievery (Dex)", "You have excellent short-ranged attack ability, and your powers confuse or weaken your opponent. You can shift easily from ranged attacks to melee attacks. However, you are not very resilient and rely on powers of evasion and concealment to avoid attack.", "Warlocks favor deities of cleverness, arcane power, or secrets. These include Corellon, Ioun, and Sehanine. Evil warlocks often revere Asmodeus or Vecna.", "Tieflings are natural warlocks and are drawn to this path. Halflings, half-elves, and humans make formidable warlocks as well.", "You have the following class features.", "All warlocks know the eldritch blast at-will power. This power can be used as a basic attack. You gain this power as well as another at-will power as determined by your Eldritch Pact.", "You have forged a pact with mysterious entities that grant you your arcane powers. Choose one of the following pacts: fey pact, infernal pact, or star pact. The pact you choose determines the following warlock abilities: At-Will Spells: Your pact determines one of the atwill spells you know. Pact Boon: Each pact includes a pact boon. The pact boon is a granted power you can use to further hex your enemies. The pact you take also provides bonuses to certain warlock powers. Individual powers detail the effects (if any) your Eldritch Pact selection has on them.", "If none of your allies are nearer to your target than you are, you receive a +1 bonus to ranged attack rolls against that target.", "On your turn, if you move at least 3 squares away from where you started your turn, you gain concealment until the end of your next turn.", " Once per turn as a minor action, you can place a Warlock’s Curse on the enemy nearest to you that you can see. A cursed enemy is more vulnerable to your attacks. If you damage a cursed enemy, you deal extra damage. You decide whether to apply the extra damage after making the damage roll. You can deal this extra damage once per round. A Warlock’s Curse remains in effect until the end of the encounter or until the cursed enemy drops to 0 hit points or fewer. You can place a Warlock’s Curse on multiple targets over the course of an encounter; each curse requires the use of a minor action. You can’t place a Warlock’s Curse on a creature that is already affected by your or another character’s Warlock’s Curse."],
			"Option 1 details": ["Eldritch Pact", "You have forged a pact with mysterious entities that grant you your arcane powers. Choose one of the following pacts: fey pact, infernal pact, or star pact. The pact you choose determines the following warlock abilities: At-Will Spells: Your pact determines one of the atwill spells you know. Pact Boon: Each pact includes a pact boon. The pact boon is a granted power you can use to further hex your enemies. The pact you take also provides bonuses to certain warlock powers. Individual powers detail the effects (if any) your Eldritch Pact selection has on them."],
			"Option 1": ["Fey Pact", "Infernal Pact", "Star Pact"],
			"Opt 1 choices": ["You have forged a bargain with ancient, amoral powers of the Feywild. Some are primitive earth spirits, grim and menacing; some are capricious wood, sky, or water spirits; and others are incarnations of seasons or natural forces who roam the faerie realm like wild gods. They bestow magic that ranges from feral and savage to wondrous and enchanting.\nEyebite: You know the eyebite at-will spell.\nMisty Step: You have the Misty Step pact boon. You instantly transform into silver mist that streams a short distance and reforms, allowing you to flee or maneuver to set up a deadly attack.\nWhen an enemy under your Warlock’s Curse is reduced to 0 hit points or fewer, you can immediately teleport 3 squares as a free action.", "Long ago a forgotten race of devils created a secret path to power and taught it to the tieflings of old to weaken their fealty to Asmodeus. In his wrath, Asmodeus destroyed the scheming devils and struck their very names from the memory of all beings—but you dare to study their perilous secrets anyway.\nHellish Rebuke: You know the hellish rebuke at-will spell.\nDark One’s Blessing: You have the Dark One’s Blessing pact boon. You instantly gain vitality from a cursed enemy when that enemy falls.\nWhen an enemy under your Warlock’s Curse is reduced to 0 hit points or fewer, you immediately gain temporary hit points equal to your level.", "You have mastered the astrologer’s art, learning the secret names of the stars and gazing into the Far Realm beyond, gaining great power thereby. You can call upon powers that madden or terrify your enemies, manipulate chance and fate, or scour your foes with icy banes and curses drawn from beyond the night sky.\nDire Radiance: You know the dire radiance at-will spell.\nFate of the Void: You have the Fate of the Void pact boon. Your curse intermingles with the lost vitality of a cursed enemy to reveal a glimpse of the future to you. \nWhen an enemy under your Warlock’s Curse is reduced to 0 hit points or fewer, you gain a +1 bonus to any single d20 roll you make during your next turn (attack roll, saving throw, skill check, or ability check). If you don’t use this bonus by the end of your turn, it is lost. This bonus is cumulative; if three cursed enemies drop to 0 hit points or fewer before your next turn, you gain a +3 bonus to a d20 roll during your turn."],
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Binder",
			"Source": "HoS",
			"Power": "Arcane",
			"Role": "Controller",
			"Abilities": ["Charisma", "Dexterity", "Intelligence"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 0,
			"Ref": 1,
			"Will": 1,
			"Attack": 0,
			"Surges": 6,
			"Melee": false,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 4,
			"Acro": 0,
			"Arca": 1,
			"Athl": 0,
			"Bluf": 1,
			"Dipl": 0,
			"Dung": 1,
			"End": 0,
			"Heal": 0,
			"History": 1,
			"Insight": 1,
			"Intimidate": 1,
			"Nature": 0,
			"Perception": 0,
			"Religion": 1,
			"Stealth": 0,
			"Street": 1,
			"Thievery": 1,
			"Paths": "",
			"Default feat": "",
			"Implements": ["Rod", "Wand"],
			"Special": "",
			"Encounter": "",
			"Feats": ["Pact Boon", "Pact Lore", "Shadow Claws", "Shadow Twist", "Shadow Walk"],
			"Description": "A binder is a warlock who bends the power of extraplanar entities to his or her will through the use of mystic words, true names, and powerful arcane symbois and talismans. Unlike warlocks who cleave to one master, a binder might call on several different creatures and entities as a mealls of channeling arcane power. Because they seck to master th e magic of controlling other creatures, all binders fear having the power they channel turned against them in the end. Like all warlocks, bi'lders are typically distrusted by the common pcople, who know the tales of the dark bargains on which that class's power is built. Eschewing a single master might seem to offer a binder a level offreedom from direct, malign manipulation. However, binders have a reputation for unpredictability that makes them as feared as hexblades and other warlocks. Warlocks channel arcane magic and spiritual energy of their slain foes. A binder's spells are focused on twisting reality more than on single combat-manipulating enemies and putting them at a disadvantage that hastens their demise. Binders rely on their allies to dispatch foes, and for the protection that allows them to freely work their magic. As a seeker of knowledge and power, as well as one who seldom wishes to endure the scrutiny of the common folk for long, a binder makes a good adventuring partner. Legends and rumors lead a binder onward into theunkown, as do the whispers of the entities that provide the binder's power.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Class Features:"],
			"Detail bodies": ["The magical energy you channel enables you to bind your enemies with arcane power, turning their bodies and minds against them.", "Cloth, leatehr", "Simple melee, simple ranged", "Rods, wands", "Choose four from the list of class skills: Aracna (Int), Bluff (Cha), Dungeoneering (Wis), History (Int), Insight (Wis), Intimidate (Cha), Religion (Int), Streetwise (Cha), Thievery (Dex)", "Pact Boon, Pact Lore, Shadow Claws, Shadow Twist, Shadow Walk"],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Hexblade",
			"Source": "HoFL",
			"Power": "Arcane",
			"Role": "Striker",
			"Abilities": ["Charisma", "Dexterity", "Constitution"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 1,
			"Ref": 0,
			"Will": 1,
			"Attack": 0,
			"Surges": 6,
			"Melee": true,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": true,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 4,
			"Acro": 0,
			"Arca": 1,
			"Athl": 0,
			"Bluf": 1,
			"Dipl": 0,
			"Dung": 0,
			"End": 0,
			"Heal": 0,
			"History": 1,
			"Insight": 1,
			"Intimidate": 1,
			"Nature": 0,
			"Perception": 0,
			"Religion": 1,
			"Stealth": 1,
			"Street": 1,
			"Thievery": 1,
			"Paths": ["Fey Pact", "Infernal Pact", "Star Pact"],
			"Default feat": "",
			"Implements": ["Rod", "Totem"],
			"Special": "",
			"Encounter": "",
			"Feats": ["Pact Boon", "Pact Weapon"],
			"Description": "",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Class Features:"],
			"Detail bodies": ["You wield a deadly weapon forged with magic, backed by your skill at spells, stout armor, and keen fighting ability.", "Cloth, leather, hide, chainmail", "Simple melee, military melee, simple ranged", "Rods, wands", "Choose four from the list of class skills: Arcana (Int), Bluff (Cha), History (Int), Insight (Wis), Intimidate (Cha), Religion (Int), Stealth (Dex), Streetwise (Cha), Thievery (Dex)", "Eldritch Bolt, Pact Reward, Pact Boon, Pact Weapon"],
			"Option 1 details": ["Eldritch Pact: ", "Hexblades, like other warlocks, enter into pacts with powerful beings from across the planes. Your choice of pact has an important effect on the powers and other abilities you gain."],
			"Option 1": ["Fey Pact", "Infernal Pact"],
			"Opt 1 choices": ["The fey pact represents a bargain struck with an enigmatic, unpredictable lord of the Feywild. Such entities grant you arcane power in exchange for a shard of the soul energy taken from each of your defeated foes. In this manner, a fey lord gains more power and more territory within the Feywild. This pact requires that you have a good Dexterity score, because its  magic focuses on speed and agility. Fey pact hexblades rely on quick feet and a sharp blade to overcome their enemies. See page 225 for more information on the fey pact.", "While the fey pact embraces speed and elegance, the infernal pact is all about brutal strength and powerful attacks. By using infernal laws against the rulers of the hells, this pact allows you to steal power from devils without making any offering in return. However, the strain of performing this act and the power you channel through your pact is a burden on your physical vitality. A good Constitution score is critical to succeeding with an infernal pact. Most infernal pact hexblades rely on heavy armor and great durability to outlast their foes. See page 230 for more information on the infernal pact."],
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Warlord",
			"Source": "PHB",
			"Power": "Martial",
			"Role": "Leader",
			"Abilities": ["Strength", "Intelligence"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 1,
			"Ref": 0,
			"Will": 1,
			"Attack": 0,
			"Surges": 7,
			"Melee": true,
			"Ranged": false,
			"Cloth": true,
			"Leather": true,
			"Hide": true,
			"Chain": true,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 4,
			"Acro": 0,
			"Arca": 0,
			"Athl": 1,
			"Bluf": 0,
			"Dipl": 1,
			"Dung": 0,
			"End": 1,
			"Heal": 1,
			"History": 1,
			"Insight": 0,
			"Intimidate": 1,
			"Nature": 0,
			"Perception": 0,
			"Religion": 0,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Inspiring Presence", "Tactical Presence", "Bravura Presence", "Resourceful Presence", "Insightful Presence", "Combat Leader", "Canny Leader", "Battlefront Leader"],
			"Default feat": "",
			"Implements": "",
			"Special": "Inspiring Word",
			"Encounter": "",
			"Feats": ["Commanding Presence", "Ally Action Point", "Inspiring Word"],
			"Description": "Warlords are accomplished and competent battle leaders. Warlords stand on the front line issuing commands and bolstering their allies while leading the battle with weapon in hand. Warlords know how to rally a team to win a fight. Your ability to lead others to victory is a direct result of your history. You could be a minor warchief looking to make a name for yourself, a pious knightcommander on leave from your militant order, a youthful noble eager to apply years of training to life outside the castle walls, a calculating mercenary captain, or a courageous marshal of the borderlands who fights to protect the frontier. Regardless of your background, you are a skillful warrior with an uncanny gift for leadership. The weight of your armor is not a hindrance; it is a familiar comfort. The worn weapon grip molds to your hand as if it were a natural extension of your arm. It’s time to fight and to lead.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features:", "Combat Leader", "Commanding Presence", "Inspiring Word"],
			"Detail bodies": ["You have become an expert in tactics through endless hours of training and practice, personal determination, and your own sheer physical toughness.", "Cloth, leather, hide, chainmail, light shield", "Simple melee, military melee, simple ranged", " ", "Choose four from the list of class skills: Athletics (Str), Diplomacy (Cha), Endurance (Con), Heal (Wis), History (Int), Intimidate (Cha)", "You are a strong warrior in melee, able to stand beside the fighter or paladin in your party. Your powers grant allies immediate actions (usually moves or attacks), provide bonuses to attack or defense, and grant healing in the midst of battle.", "Warlords favor martial gods such as Bahamutand Kord, and those who have a particular eye for strategy or leadership esteem Ioun or Erathis. Evil and unaligned warlords often worship Bane.", "Dragonborn make excellent inspiring warlords, and half-elves are equally inspiring leaders. Eladrin are skilled tactical warlords. Tiefling warlords are versatile, combining powers from both builds, and humans can excel at either path.", "All warlords have these class features.", "You and each ally within 10 squares who can see and hear you gain a +2 power bonus to initiative.", "Choose one of the following two benefits Inspiring Presence or Tactical Presence. The choice you make also provides bonuses to certain warlord powers. Individual powers detail the effects (if any) your Commanding Presence selection has on them.", "Using the inspiring word power, warlords can grant their comrades additional resilience with nothing more than a shout of encouragement."],
			"Option 1 details": ["Commanding Presence",
				"Choose one of the following two benefits. The choice you make also provides bonuses to certain warlord powers. Individual powers detail the effects (if any) your Commanding Presence selection has on them."
			],
			"Option 1": ["Inspiring Presence", "Tactical Presence"],
			"Opt 1 choices": ["When an ally who can see you spends an action point to take an extra action, that ally also regains lost hit points equal to one-half your level + your Charisma modifier.", "When an ally you can see spends an action point to make an extra attack, the ally gains a bonus to the attack roll equal to one-half your Intelligence modifier."],
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Wizard",
			"Source": "PHB",
			"Power": "Arcane",
			"Role": "Controller",
			"Abilities": ["Intelligence", "Constitution"],
			"HP Start": 10,
			"HP": {
				"LVL": 4
			},
			"Fort": 0,
			"Ref": 0,
			"Will": 2,
			"Attack": 0,
			"Surges": 6,
			"Melee": false,
			"Ranged": false,
			"Cloth": true,
			"Leather": false,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 3,
			"Acro": 0,
			"Arca": 3,
			"Athl": 0,
			"Bluf": 0,
			"Dipl": 1,
			"Dung": 0,
			"End": 0,
			"Heal": 0,
			"History": 1,
			"Insight": 1,
			"Intimidate": 0,
			"Nature": 1,
			"Perception": 0,
			"Religion": 1,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Orb of Imposition", "Staff of Defense", "Wand of Accuracy", "Orb of Deception", "Tome of Binding"],
			"Default feat": "Ritual Caster",
			"Implements": ["Orb", "Staff", "Tome", "Wand"],
			"Special": "",
			"Encounter": "",
			"Feats": ["Arcane Implement Mastery", "Cantrips", "Spellbook"],
			"Description": "Wizards are scions of arcane magic. Wizards tap the true power that permeates the cosmos, research esotericrituals that can alter time and space, and hurl balls of fire that incinerate massed foes. Wizards wield spells the way warriors brandish swords. Magic lured you into its grasp, and now you seek to master it in turn. You could be a bespectacled sage searching for dusty tomes in forgotten sepulchers, a scarred war mage plying foes with fireballs and foul language in equal measure, a disgruntled apprentice who absconded with your master’s spellbooks, an eladrin upholding the magical tradition of your race, or even a power-hungry student of magic who might do anything to learn a new spell. A cloak of spells enfolds you, ancient rituals bolster your senses, and runed implements of your craft hang from your belt. Effervescing arcane lore pulses through your consciousness, a constant pressure craving release. When will you know enough magic to storm the ramparts of reality itself?",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features:", "Arcane Implement Mastery", "Cantrips", "Ritual Casting", "Spellbook"],
			"Detail bodies": ["You channel arcane forces through extensive study, hidden knowledge, and intricate preparation. To you, magic is an art form, an xpressive and powerful method by which you seek to control the world around you.", "Cloth", "Dagger, quarterstaff", "Orbs, staffs, wands", "Arcana, plus three more from the list of class skills: Arcana (Int), Diplomacy (Cha), Dungeoneering (Wis), History (Int), Insight (Wis), Nature (Int), Religion (Int)", "Your powers are all about affecting multiple targets at the same time—sometimes two or three foes, sometimes everyone in a room. In addition, you are the master of utility spells that let you avoid or overcome many obstacles, from flying across chasms to halting the flow of time.", "Wizards favor deities of magic, art, knowledge, and secrets, such as Corellon, Ioun, and Vecna.", "Eladrin, humans, and half-elves esteem and excel at the practice of arcane magic.", "You have the following class features.", "You specialize in the use of one kind of implement to gain additional abilities when you wield it. Choose one of the following forms of implement mastery Orb,  Imposition or Staff of Defense, or Wand of  Accuracy.", "Cantrips are minor spells you gain at 1st level. You can use the ghost sound, light, mage hand, and prestidigitation cantrips as at-will powers.", "You gain the Ritual Caster feat as a bonus feat, allowing you to use magical rituals.", "You possess a spellbook, a book full of mystic lore in which you store your rituals and your daily and utility spells."],
			"Option 1 details": ["Arcane Implement Mastery", "You specialize in the use of one kind of implement to gain additional abilities when you wield it. Choose one of the following forms of implement mastery."],
			"Option 1": ["Orb of Imposition", "Staff of Defense", "Wand of Accuracy"],
			"Opt 1 choices": ["Once per encounter as a free action, you can use your orb to gain one of the following two effects. You can designate one creature you have cast a  wizard spell upon that has an effect that lasts until the subject succeeds on a saving throw. That creature takes a penalty to its saving throws against that effect equal to your Wisdom modifier. Alternatively, you can choose to extend the duration of an effect created by a wizard at-will spell (such as cloud of daggers or ray of frost) that would otherwise end at the end of your current turn. The effect instead ends at the end of your next turn. You must wield an orb to use this ability. Control wizards select this form of mastery because it helps extend the duration of their control effects.", "A staff of defense grants you a +1 bonus to AC. In addition, once per encounter as an immediate interrupt, you gain a bonus to defense against one attack equal to your Constitution modifier. You can declare the bonus after the Dungeon Master has already told you the damage total. You must wield your staff to benefit from these features. This form of mastery is useful for all wizards, particularly if you dabble in both control and damage-dealing spells.", "Once per encounter as a free action, you gain a bonus to a single attack roll equal to your Dexterity modifier. You must wield your wand to benefit from this feature. This form of mastery is good for war wizards because it helps increase their accuracy with damaging powers."],
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Bladesinger",
			"Source": "NWCS",
			"Power": "Arcane",
			"Role": "Controller",
			"Abilities": ["Inteligence", "Dexterity"],
			"HP Start": 12,
			"HP": {
				"LVL": 5
			},
			"Fort": 0,
			"Ref": 0,
			"Will": 2,
			"Attack": 0,
			"Surges": 7,
			"Melee": true,
			"Ranged": true,
			"Cloth": true,
			"Leather": true,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 3,
			"Acro": 1,
			"Arca": 3,
			"Athl": 1,
			"Bluf": 0,
			"Dipl": 1,
			"Dung": 0,
			"End": 0,
			"Heal": 0,
			"History": 1,
			"Insight": 0,
			"Intimidate": 1,
			"Nature": 1,
			"Perception": 1,
			"Religion": 0,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": "",
			"Default feat": "",
			"Implements": ["Orb", "Staff", "Wand"],
			"Special": "",
			"Encounter": "",
			"Feats": "",
			"Description": "Those who see a blade singer in battle never forget the sight. Amid the chaos and blood, the bladesinger moves in an otherworldly dance. Spells and sword act as partners, matching awe-inspiring beauty with an awful deadliness. When the bladesinger engages in the true heart of the art, when the sword whirls through the air so swiftly that it keens and the air\nhums and whistles in chorus, when the bladesong has begun-then the bladesinger becomes something unreal, something timeless. According to legend, Corellon himself inspired and taught the first bladesinger. The techniques handed down as a gift from the leader of the elven Character Options deities have passed from one to another among the Tel'Quessir for untold generations, and though different styles evolved as eladrin and elves turned its power to suit their needs, none have improved upon the essential core of the art. The bladesinger wields a weapon one-handed, leaving the other free or using it to employ a wandthat can be incorporated into the fighting style. This technique gives a blade singer the speed and freedom of movement necessary for the dancelike motions of the various forms of martial art, which allow for both magical and physical attacks to flow freely. Few among the Tel'Quessir have the honor of being inducted into the bladesingers. One must have the mind necessary to be a great wizard, and also the agility of the greatest dancer. Yet those traits alone\nare not enough. A blade singer is first and foremost devoted to the ways and the people of the Tel'Quessir, for that was the purpose of Corell on's gift. A bladesinger who has set out beyond the borders of a nation of the People must have had good cause. Adventuring blade singers might seek out relics or locations of great meaning to the Tel'Quessir, or they could leave in order to guard a specific person or group against harm. A bladesinger might instead embark upon a quest to eliminate a threat to the People or to find and communicate with some long-lost branch of the race. In a more tragic case, a blade singer might have failed in the duty to protect a community and be death-pledged to avenge it and restore his or her honor.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features:"],
			"Detail bodies": ["You realize the ultimate blending of swordplay and spellcasting, unleashing magic and making attacks with your blade with equal ease.", "Cloth, leather", "Simple melee, military melee, simple ranged, military ranged", "Orbs, staffs, wands", "Arcana, plus three more from the list of class skills: Acrobatics (Dex), Arcana (lnt), Athletics (Str), Diplomacy (Cha), History (Int), Intimidate (Cha), Nature (Wis), Perception (Wis)", "Instinctive Attack, Guarded Flourish, Blade Magic, Bladesong, Bladesinger's Spellbook, Bladespells,Bladesinger Cantrips, Magic Missile"],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Mage",
			"Source": "HoFL",
			"Power": "Arcane",
			"Role": "Controller",
			"Abilities": ["Intelligence", "Constitution", "Wisdom", "Charisma"],
			"HP Start": 10,
			"HP": {
				"LVL": 4
			},
			"Fort": 0,
			"Ref": 0,
			"Will": 2,
			"Attack": 0,
			"Surges": 6,
			"Melee": false,
			"Ranged": false,
			"Cloth": true,
			"Leather": false,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 3,
			"Acro": 0,
			"Arca": 3,
			"Athl": 0,
			"Bluf": 0,
			"Dipl": 1,
			"Dung": 1,
			"End": 0,
			"Heal": 0,
			"History": 1,
			"Insight": 1,
			"Intimidate": 0,
			"Nature": 1,
			"Perception": 0,
			"Religion": 1,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": ["Enchantment School", "Evocation School", "Illusion School", "Pyromancy School"],
			"Default feat": "",
			"Implements": ["Orb", "Staff", "Wand"],
			"Special": "",
			"Encounter": "",
			"Feats": ["Mage's Spellbook", "Cantrips", "Magic Missile", "Apprentice Mage:"],
			"Description": "A mage is a specialized wizard, a spellcaster who focuses on the tenets of a particular school of magic. This specialization makes each mage distinctive. After all, a mage who casts evocation spells presents a very different picture to the world from a mage who has mastered the art of illusion or enchantment. jMages tend to approach arcane magic with a more scholarly bent than other wizards, and that's saying a lot. Don't expect to find adventuring mages hidden away in dusty towers, however. They hit the ground running, ready to explore every dungeon and ancient ruin in search of lore and knowledge that will increase their understanding of everything arcane—and thereby increase their personal power. The ancient traditions of the schools have been handed down since the first mortals began to dabble in arcane magic. What started as techniques and methods of training between masters and apprentices eventually became more institutionalized, and eventually actual academies of arcane study sprang upA mage is a specialized wizard, a spellcaster who focuses on the tenets of a  particular school of magic. This specialization makes each mage distinctive. After all, a mage who casts evocation spells presents a very different picture to the world from a mage who has mastered the art of illusion or enchantment. jMages tend to approach arcane magic with a more scholarly bent than n other wizards, and that's saying a lot. Don't expect to find adventuring mages hidden away in dusty towers, however. They hit the ground running, ready to explore every dungeon and ancient ruin in search of lore and knowledge that will increase their understanding of everything arcane—and thereby increase their personal power. The ancient traditions of the schools have been handed down since the first mortals began to dabble in arcane magic. What started as techniques and methods of training between masters and apprentices eventually became more institutionalized, and eventually actual academies of arcane study sprang up in the world and even among the eladrin of the Feywild. In time, single towers devoted to a single arcane discipline gave way to grand academies where illusion magic was taught alongside evocation magic. Today, where and how arcane magic is taught depends on where you happen to be. On the borderlands, in places such as Fallcrest, solitary mages pass on their knowledge to one or two apprentices at a time. In larger settlements, such as thecity of Nera, academies are dedicated to the training of mages in all of the schools of magic.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Class Features:"],
			"Detail bodies": ["You are a master of t h e mystic arts, capable of bending your enemies to your will, reshaping perception, or summoning devastating elemental power.", "Cloth", "Dagger, quarterstaff", "Orbs, staffs, wands", "Arcana, plus three more from the list of class skills: Arcana (Int), Diplomacy (Cha), Dungeoneering (Wis), History (Int), Insight (Wis), Nature (Wis), Religion (Int)", "Apprentice Mage, Mage's Spellbook, Mage Cantrips, Magic Missle"],
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Sha'ir",
			"Source": "HoEC",
			"Power": "Arcane",
			"Role": "Controller",
			"Abilities": ["Intelligence", "Constitution"],
			"HP Start": 10,
			"HP": {
				"LVL": 4
			},
			"Fort": 0,
			"Ref": 0,
			"Will": 2,
			"Attack": 0,
			"Surges": 6,
			"Melee": false,
			"Ranged": false,
			"Cloth": true,
			"Leather": false,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 3,
			"Acro": 0,
			"Arca": 3,
			"Athl": 0,
			"Bluf": 0,
			"Dipl": 1,
			"Dung": 1,
			"End": 0,
			"Heal": 0,
			"History": 1,
			"Insight": 1,
			"Intimidate": 0,
			"Nature": 1,
			"Perception": 0,
			"Religion": 1,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": "",
			"Default feat": "",
			"Implements": ["Orb", "Staff", "Wand"],
			"Special": "",
			"Encounter": "",
			"Feats": ["Gen Servant", "Sha'ir Cantrips", "Elemental Resistance"],
			"Description": "Sha'irs cull magical energy from the Elemental Chaos to power their spells. Rather than pore over ancient formulas and techniques, these wizards bargain with elemental powers for the magical knowledge they need. Sha'irs do not deal directly with these powers; instead, they rely on proxies, elemental spirits called gen servants, to negotiate on their behal£ Dispatching these servants to the Elemental Chaos each day, a sha'ir replenishes the necessary power and informa· tion to wield the forces of creation. Their unconventional methods, combined with their reputation for consorting with dangerous, often violent, powers, place sha'irs on the fringes of the magical world. Other wizards regard sha'irs with scorn and distrust, believing that they cheat by circumventing the arduous training and research wizards must typically undergo. This mistrust stems from ignorance, however, for even though a sha'ir draws magic from a gen servant, a foundation in arcane training is necessary to wield the power he or she gains. Since sha'irs do not clutter their minds with mystical formulas and arcane utterances, they have wider access to spells than other wizards enjoy. They needonly know a spell's basic structure to request it from their gen servants. The gen servant then vanishes into the Elemental Chaos, where it bargains with more powerful elemental lords and creatures to acquire the spell the sha'ir seeks and then returns without fail to provide its master with the energy and means to cast the spell. So even though sha'irs do not employ spell· books, they have access to the full expanse of wizards' most powerful and versatile spells. The elemental powers that lend magical knowledge and energy to sha'irs do not do so without an expectation of recompense. Sha'irs often take up the adventurer's life for this reason. They work in the world and beyond as representatives, agents, and servants of their elemental masters. Many times a sha'ir does not even realize that his or her actions are furthering some elemental being's designs, and what might seem to be a normal expedition into the unknown could have consequences not realized for years to come.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Class Features:"],
			"Detail bodies": ["Using magic granted by your gen servant, you take control of the battlefield with the raw forces of elemental energy.", "Cloth", "Dagger, quarterstaff", "Orbs, staffs, wands", "Arcana, plus three more from the list of class skills: Arcana (lnt), Diplomacy (Cha), Dun· geoneering (Wis), History (lnt), Insight (Wis), Nature (Wis), Religion (lnt)", "Gen Servant, Sha'ir Cantrips, Elemental Resistance"],
			"Option 1 details": ["Gen Servant:", "Elemental magic bows to no mortal master. Only those steeped in elemental energy or who can broker with the elemental powers can coax forth its magic. You enlist the aid of a minor elemental spirit, a gen servant, to keep you supplied with the magical energy you need to cast your spells. Each day, you dispatch this servant to the Elemental Chaos\nto steal, beg, or borrow this energy from the greater powers residing there. When the servant returns, the energy it brings back floods into your mind. A gen servant is an arcane familiar forged from your own essence and that of elemental substance until it adopts a fixed and permanent form. As with any familiar, the characteristics that your gen servant takes on depend on you. The familiar might just be an extension of your magical abilities, or it might develop a distinctive personality, aiding you with knowledge from the Plane Below. How large a part your servantplays in your adventures is up to you. Benefit: You gain the Arcane Familiar feat (page 142) as a bonus feat. You can choose any familiar normally available to a wizard or one of the familiars available only to sha'irs, which are described below. At the end of each extended rest, when your familiar returns from its venture into the Elemental Chaos, you can replace one of your wizard daily attack powers or wizard utility powers with another wizard power of the same type. The new power must have a level, and\nits level must be the same as the old power's level."],
			"Option 1": ["Daolanin", "Djinnling", "Efreetkin", "Maridan"],
			"Opt 1 choices": ["Stoic to the point of rudeness, daolanin tend to be dour and ill-tempered companions. They prefer the truth, even when that truth cuts like a knife. Daolanin are squat creatures with brown or gray skin, dark hair, and brutish features. They are strong and fie rce in battle and prove adept at keeping enemies at bay.", "The mercurial djinnlings often have unpredictable personalities. They are quick to anger, but quicker to forget, tending to drift through many moods with little warning or reason. Djinnlings are short, thin humanoids with blue skin and tousled white hair. They are swift servants, and they can use the winds as weapons to disperse your enemies.", "The aggressive and malicious efreetkin resemble their larger cousins in both appearance and temperament. With fiery hair, ruddy skin, and small horns sprouting from their brows, they look like little devils and often behave as such. They delight in causing mischief and are famous for causing trouble for their masters. Despite this tendency, efreetkin are potent allies in battle, and many sha'irs tolerate their wickedness because of the power they offer."],
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Witch",
			"Source": "HoF",
			"Power": "Arcane",
			"Role": "Controller",
			"Abilities": ["Intelligence", "Wisdom"],
			"HP Start": 10,
			"HP": {
				"LVL": 4
			},
			"Fort": 0,
			"Ref": 0,
			"Will": 2,
			"Attack": 0,
			"Surges": 6,
			"Melee": false,
			"Ranged": false,
			"Cloth": true,
			"Leather": false,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 3,
			"Acro": 0,
			"Arca": 3,
			"Athl": 0,
			"Bluf": 0,
			"Dipl": 1,
			"Dung": 1,
			"End": 0,
			"Heal": 0,
			"History": 1,
			"Insight": 1,
			"Intimidate": 0,
			"Nature": 1,
			"Perception": 0,
			"Religion": 1,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": "",
			"Default feat": "",
			"Implements": ["Orb", "Staff", "Wand"],
			"Special": "",
			"Encounter": "",
			"Feats": ["Witch's Familiar", "Witch Cantrips", "Moon Coven", "Augury"],
			"Description": "Part religion, part ritual, and all mystery, witchcraft is an ancient practice that came about in an age before arcane magic was studied, institutionalized, and etched in writing, when monstrous titans ruled over creation and the secret of making fire was yet undiscovered. In this chaotic dark age, the gods had little influence on the titans' world. Instead of seeking\ntheir aid, the primitive peoples called out to the night for protection and power, and a voice from the darkness answered. Those who accepted its arcane gifts became the first witches, and they wielded such power as only immortals had known-seen by some jealous gods as an affront that they have never forgiven. Witches gain their power from a patron who instructs them by way of a mystical familiar that comes and goes as it pleases, unbound by the strictures of the material world. The most prevalent patron among witches-the original voice from the darkness-is the moon goddess Sehanine, referred to by witches as simply the Goddess. Other entities have since seen the advantage of imbuing mortals with power, and so your patron might be an archfey, a god, an angel, a primordial, a demon lord, a devil, or another legendary being that believes it can benefit by imbuing you with a gift of arcane prowess. It might prefer to remain anonymous. The circumstances by which you obtained your gift can vary widely. Some witches seek out the gift in order to fulfill a personal desire or vendetta, while others were brought up in a coven. Some receive their power after making a pact with a devil, as a warlock might do, and others have it bestowed upon them by a fairy godparent or a witch queen. Though witches are common among the fey races in the Feywild, as a witch in the natural world you must be mindful of whom you trust. In the world, common folk fear your kind. Envious wizards refuse to acknowledge you as a peer and would see your wondrous powers vanish from the world, while clerics of jealous gods decree you an unholy menace, sending witch hunters to track you down and destroy you.",
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Class Features:"],
			"Detail bodies": ["You practice the first, most ancient form of arcane magic, which allows you to charm, transform, and curse your enemies.", "Cloth", "Dagger, quarterstaff", "Orbs, staffs, wands", "Arcana, plus three more from the list of class skills: Arcana (lnt), Diplomacy (Cha), Dungeoneering (Wis), History (lnt), Insight (Wis), Nature (Wis), Religion (lnt)", "Witch's Familiar, Witch Cantrips, Moon Coven, Augury"],
			"Option 1 details": ["Moon Coven: ", "When you create your witch, you choose a moon coven with which you are affiliated. A moon coven is a loose order of witches that share a philosophy of witchcraft. Each moon coven represents one of two phases of the moon- full or dark (new)-and symbolizes the witch's quintessential attitude toward the application of his or her craft. Each moon coven reflects a member witch's philosophy regarding the use of magic-not necessarily corresponding to the witch's alignment, since witches of all alignments are found in each coven. Nevertheless, a greater number of evil witches gravitate toward the dark moon and its powers over ill fortune and necromancy, whereas good witches more frequently\naffiliate themselves with the full moon coven and favor its charms and healing magic. Witches are solitary by nature, requiring little arcane instruction beyond the teachings of their familiar, and most prefer to keep their craft secret lest they be targeted by witch hunters. Therefore, a moon coven typically convenes only once during the course of a year, in an isolated  ocation in the wilderness often near standing stones, ley lines, or other sites that thrum with arcane power, on an evening when the coven's moon phase displays in its ideal state in the dark heavens above. Despite their opposing philosophies on witchcraft, the two moon covens sometimes come together on the night of a lunar eclipse, when both are symbolically represented in the night sky. Such meetings occur only when all witches, or the world in which they live, are threatened by forces bent on their extermination. In addition to, or instead of, meeting with their moon coven, some witches gather in local covens attended by witches that inhabit the area. Such local covens are often the way new witches are initiated\ninto the craft, and they show the initiate the way to call on a powerful entity and receive the gift of its power in the form of a familiar. These local covens usually have their own aims and goals related to their immediate surroundings, and might or might not adhere to the philosophy of either of the moon covens. Many witches learn their craft in isolation, unaware of the presence of the fundamental moon covens, or even of other witches. Regardless of whether a witch or a local coven identifies with a moon coven, every witch makes a choice concerning the type of witchcraft he or she wants to practice. Benefit: Choose a coven, and gain its benefits."],
			"Option 1": ["Dark Moon Coven", "Full Moon Coven"],
			"Opt 1 choices": ["The witches of the dark moon coven believe that the night is a witch's birthright. Powers over fate and darkness are theirs to command, and they strive to further their own ends at any cost. Good dark moon witches use their powers of fear, terror, and darkness against the wicked, whereas evil dark moon witches blight those that cross them with ill fortune and plague, heedless of the mortal lives that fall in their wake. Dark moon witches call on the tides and the night winds and summon the dead from their graves; they conjure objects from nowhere, or imbue them with momentary life. Benefit: You gain the dread presence power (page 92). In addition, you gain training in the Intimidate skill. At level 5, you gain a + 2 bonus to  intimidate checks and Stealth checks.", "Witches of the full moon coven believe in the sanctity oflife, the tidal pull oflove, and the capacity of pure beauty to enchant the eye. These witches use their powers to beguile, charm, and inspire. Many full moon witches are kind and good; others are stark, aloof, and compassionless, idealizing the image of beauty and grace but not the heart of it. When they manifest their power, full moon witches awe allies and enemies alike with the celestial majesty of their presence. Benefit: You gain the glorious presence power (page 92). In addition, you gain training in the Heal skill. t 5th level, you gain a +2 bonus to Heal checks and Diplomacy checks."],
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		},
		{
  			"$doctype": "Subclass",
			"Subclass": "Hybrid",
			"Source": "PHB3",
			"Power": "",
			"Role": "Any",
			"Abilities": ["Any", "Any"],
			"HP Start": 0,
			"HP": {
				"LVL": 0
			},
			"Fort": 0,
			"Ref": 0,
			"Will": 0,
			"Attack": 0,
			"Surges": 0,
			"Melee": false,
			"Ranged": false,
			"Cloth": false,
			"Leather": false,
			"Hide": false,
			"Chain": false,
			"Scale": false,
			"Plate": false,
			"Shield": false,
			"Training": 0,
			"Acro": 0,
			"Arca": 0,
			"Athl": 0,
			"Bluf": 0,
			"Dipl": 0,
			"Dung": 0,
			"End": 0,
			"Heal": 0,
			"History": 0,
			"Insight": 0,
			"Intimidate": 0,
			"Nature": 0,
			"Perception": 0,
			"Religion": 0,
			"Stealth": 0,
			"Street": 0,
			"Thievery": 0,
			"Paths": "",
			"Default feat": "",
			"Implements": "",
			"Special": "",
			"Encounter": "",
			"Feats": "",
			"Description": ["The hybrid character rules allow you to combine elements of two character classes into a whole. Effectively, you create a brand-new class from portions of two classes. Like the multiclass feats introduced in the Player's Handbook, these rules let you reflect a more varied array of character abilities than traditional classes do. Whether you're doing this to reflect your character's elaborate backs tory, to combine different mechanical elements to create a potent new combination, or to fill out a group that needs just a little something extra, the end result is the same: Your hybrid character gives up depth of ability in exchange for greater flexibility."],
			"Builds": "",
			"Detail Headers": ["Power Source Interest:", "Armor Proficiencies:", "Weapon Proficiencies:", "Implement:", "Trained Skills:", "Characteristics:", "Religion:", "Races:", "Class Features:"],
			"Detail bodies": " ",
			"Option 1 details": "",
			"Option 1": "",
			"Opt 1 choices": "",
			"Option 2 details": "",
			"Option 2": "",
			"Opt 2 Choices": "",
			"PP": false
		}
	]
}